[ 
 {
    "Question :": "1",
    "EN": "Firewalk has just completed the second phase (the scanning phase) and a technician receives the output shown below. What conclusions can be drawn based on these scan results? TCP port 21 no response TCP port 22 no response TCP port 23 Time-to-live exceeded",
    "C": "Firewalk 剛完成第二階段（掃描階段），技術人員收到了如下所示的輸出。根據這些掃描結果，可以得出什麼結論？ TCP 埠 21 無回應 TCP 埠 22 無回應 TCP 埠 23 存留時間超時 (Time-to-live exceeded)",
    "選項": "A. The lack of response from ports 21 and 22 indicate that those services are not running on the destination server (埠 21 和 22 無回應表示目的伺服器上未運行這些服務) B. The scan on port 23 was able to make a connection to the destination host prompting the firewall to respond with a TTL error (對埠 23 的掃描能夠連線到目的主機，促使防火牆回應 TTL 錯誤) C. The scan on port 23 passed through the filtering device. This indicates that port 23 was not blocked at the firewall (對埠 23 的掃描通過了過濾設備。這表明埠 23 在防火牆處未被阻止) D. The firewall itself is blocking ports 21 through 23 and a service is listening on port 23 of the target host (防火牆本身正在阻止埠 21 到 23，並且目標主機的埠 23 上有服務正在監聽)",
    "Answer": "C",
    "Explanation": "Firewalk 工具利用 TTL（存留時間）差異來判斷防火牆規則。當回應為「Time-to-live exceeded」（TTL 超時）時，表示封包通過了第一個過濾設備（防火牆）並到達了下一跳路由器，但被路由器丟棄。這意味著 **埠 23 在防火牆處是開放的**（未被阻止），因此掃描通過了過濾設備 [cite: 7978, 7979]。埠 21 和 22 無回應則通常表示它們被防火牆阻止（filtered）或目的服務未運行。"
  },
  {
  "Question :": "53",
  "EN": "Switches maintain a CAM Table that maps individual MAC addresses on the network to physical ports on the switch. In MAC flooding attack, a switch is fed with many Ethernet frames, each containing different source MAC addresses, by the attacker. Switches have a limited memory for mapping various MAC addresses to physical ports. What happens when the CAM table becomes full? \n\nOptions:\nA. Switch then acts as hub by broadcasting packets to all machines on the network\nB. The CAM overflow table will cause the switch to crash causing Denial of Service\nC. The switch replaces outgoing frame switch factory default MAC address of FF:FF:FF:FF:FF:FF\nD. Every packet is dropped and the switch sends out SNMP alerts to the IDS port",
  "C": "交換機維護一個 CAM 表，將網路上的各個 MAC 地址映射到交換機上的物理埠。在 MAC 洪泛攻擊中，攻擊者向交換機發送許多乙太網路幀，每個幀包含不同的源 MAC 地址。交換機用於映射各種 MAC 地址到物理埠的記憶體是有限的。當 CAM 表滿時會發生什麼？\n\n選項:\nA. 交換機然後充當集線器，將封包廣播到網路上的所有機器\nB. CAM 溢出表將導致交換機崩潰，從而導致阻斷服務（Denial of Service）\nC. 交換機將傳出幀的 MAC 地址替換為出廠預設 MAC 地址 FF:FF:FF:FF:FF:FF\nD. 每個封包都被丟棄，交換機將 SNMP 警報發送到 IDS 埠",
  "選項": [
    "A. Switch then acts as hub by broadcasting packets to all machines on the network",
    "B. The CAM overflow table will cause the switch to crash causing Denial of Service",
    "C. The switch replaces outgoing frame switch factory default MAC address of FF:FF:FF:FF:FF:FF",
    "D. Every packet is dropped and the switch sends out SNMP alerts to the IDS port"
  ],
  "Answer": "A",
  "Explanation": "MAC 洪泛攻擊（MAC Flooding attack）利用交換機 CAM 表的容量限制。當攻擊者使用大量虛假 MAC 地址填滿 CAM 表時，交換機無法再學習新的 MAC 地址與埠的映射。此時，對於目的地 MAC 地址不在 CAM 表中的幀，交換機將退化為類似於集線器（Hub）的工作模式，將這些幀**廣播 (broadcast)** 到除了接收埠之外的所有埠上 [cite: 6][cite_start]，從而允許攻擊者嗅探（sniff）流量，這通常被稱為 'Fail Open' 或 'Fail Secure' 的情況。正確答案是 A [cite: 6]。"
 }
]

